<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Motion Planning</title>


	
	<meta http-equiv="X-UA-Compatible" content="IE=9">
	<link rel="stylesheet" href="../../../style.css" type="text/css" media="screen" title="style" charset="utf-8"></head><body>

<h1>Motion Planning &#36816;&#21160;&#35268;&#21010;<br>
</h1>

<h2>&#26412;&#31456;&#33410;&#20171;&#32461;&#36816;&#21160;&#35268;&#21010;&#30340;&#20989;&#25968;</h2>
<p>&#22312;&#35768;&#22810;&#28216;&#25103;&#20013;&#65292;&#20320;&#24819;&#35201;&#30340;&#23545;&#25163;&#65292;NPC&#65292;&#25932;&#20154;&#31561;..&#19982;&#29609;&#23478;&#20114;&#21160;&#65292;&#24182;&#21363;&#26102;&#34920;&#29616;&#20986;&#19968;&#23450;&#30340;&#26234;&#33021;&#36208;&#21160;&#65306;&#20320;&#24819;&#35753;&#20182;&#20204;&#36991;&#24320;&#38556;&#30861;&#29289;&#65292;&#35745;&#21010;&#36335;&#32447;&#65292;&#36890;&#24120;&#19981;&#20250;&#30896;&#25758;&#21040;&#20219;&#20309;&#20107;&#24773;&#22312;&#31227;&#21160;&#26102;&#65281;&#20026;&#20102;&#24110;&#21161;&#36825;&#20010;<i>GameMaker:Studio</i> &#26377;&#19968;&#31995;&#21015;&#30340;&#36816;&#21160;&#35268;&#21010;&#19982;&#22788;&#29702;&#30340;&#20989;&#25968;&#12290; 
<br>
<br>

&#36816;&#21160;&#35268;&#21010;&#22312;<i>GameMaker:Studio</i>&#26159;&#36890;&#36807; <b>mp_</b> functions&#22788;&#29702;&#30340;&#65292;&#23427;&#26412;&#36523;&#26159;&#20998;&#25104;&#19977;&#32452;&#65306;<br>
<br>

</p><h3>mp_linear &#20989;&#25968;</h3>
<p>
&#36825;&#31867;&#20989;&#25968;&#26159;&#20026;&#23454;&#20363;&#35797;&#22270;&#35745;&#31639;&#19968;&#20010;&#26080;&#30896;&#25758;&#36335;&#24452;&#12290;&#19968;&#26086;&#36825;&#26465;&#36947;&#36335;&#24050;&#32463;&#35745;&#31639;&#21487;&#20197;&#23558;&#20854;&#20998;&#37197;&#21040;&#30340;&#23454;&#20363;&#26397;&#30528;&#30446;&#26631;&#12290;&#36335;&#24452;&#30340;&#35745;&#31639;&#38656;&#35201;&#19968;&#23450;&#30340;&#26102;&#38388;&#65292;&#20294;&#22312;&#36825;&#20043;&#21518;&#25191;&#34892;&#36335;&#24452;&#23558;&#26159;&#24555;&#36895;&#30340;&#12290;&#24403;&#28982;&#65292;&#36825;&#26159;&#21807;&#19968;&#26377;&#25928;&#30340;&#65292;&#22312;&#27492;&#26399;&#38388;&#65292;&#22914;&#26524;&#24773;&#20917;&#27809;&#26377;&#25913;&#21464;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#38556;&#30861;&#25913;&#21464;&#65292;&#20320;&#21487;&#33021;&#20250;&#38656;&#35201;&#37325;&#26032;&#35745;&#31639;&#36335;&#24452;&#12290;&#20877;&#27425;&#27880;&#24847;&#21040;&#36825;&#20123;&#20989;&#25968;&#21487;&#33021;&#20250;&#22833;&#36133;&#65292;&#24182;&#27809;&#26377;&#20026;&#23454;&#20363;&#25214;&#21040;&#36335;&#24452;&#12290;

</p><blockquote>
<ol>
	<li><a href="mp_linear_step.html">mp_linear_step</a><br>
	</li><li><a href="mp_linear_step_object.html">mp_linear_step_object</a><br>
	</li><li><a href="mp_linear_path.html">mp_linear_path</a><br>
	</li><li><a href="mp_linear_path_object.html">mp_linear_path_object</a><br>
</li></ol>
</blockquote>

<h3>mp_potential &#20989;&#25968;</h3>
<p>
&#36825;&#20123;&#26159;&#22522;&#26412;&#30340;&#30340;&#22238;&#36991;&#21151;&#33021;&#21644;&#33391;&#22909;&#30340;&#31616;&#21333;&#30340;AI&#12290;&#20182;&#20204;&#30340;&#24037;&#20316;&#23454;&#20363;&#8203;&#8203;&#23545;&#29305;&#23450;&#30340;&#30446;&#26631;&#20301;&#32622;&#65292;&#21516;&#26102;&#35797;&#22270;&#30452;&#26469;&#30452;&#21435;&#65292;&#22914;&#26524;&#26377;&#21487;&#33021;&#65292;&#20294;&#22914;&#26524;&#38656;&#35201;&#30340;&#35805;&#65292;&#37319;&#21462;&#20102;&#19981;&#21516;&#30340;&#26041;&#21521;&#36208;&#20102;&#19968;&#27493;&#12290;&#36825;&#20123;&#20989;&#25968;&#24212;&#35813;&#22312;&#23454;&#20363;&#30340;&#27493;&#20107;&#20214;&#20013;&#20351;&#29992;&#12290;

</p><blockquote>
<ol>
	<li><a href="mp_potential_settings.html">mp_potential_settings</a><br>
	</li><li><a href="mp_potential_step.html">mp_potential_step</a><br>
	</li><li><a href="mp_potential_step_object.html">mp_potential_step_object</a><br>
	</li><li><a href="mp_potential_path.html">mp_potential_path</a><br>
	</li><li><a href="mp_potential_path_object.html">mp_potential_path_object</a><br>
</li></ol>
</blockquote>

<h3>mp_grid &#20989;&#25968;</h3>
<p>
&#26368;&#21518;&#19968;&#31181;&#31867;&#22411;&#30340;&#20989;&#25968;&#20351;&#29992;&#19968;&#20010;&#26356;&#22797;&#26434;&#30340;&#26426;&#21046;&#65292;&#22522;&#20110;&#32593;&#26684;&#30340;&#26041;&#27861;&#65288;&#26377;&#26102;&#20063;&#34987;&#31216;&#20026;A *&#31639;&#27861;&#65289;&#30340;&#22522;&#30784;&#19978;&#12290;&#36825;&#23558;&#26159;&#26356;&#25104;&#21151;&#30340;&#23547;&#25214;&#36335;&#24452;&#65288;&#34429;&#28982;&#23427;&#20173;&#28982;&#21487;&#33021;&#20250;&#22833;&#36133;&#65289;&#65292;&#20250;&#25214;&#21040;&#21487;&#33021;&#30340;&#26368;&#30701;&#36335;&#24452;&#65292;&#20294;&#23427;&#38656;&#35201;&#26356;&#22810;&#30340;&#24037;&#20316;&#22312;&#20320;&#30340;&#36523;&#36793;&#35774;&#32622;&#12290;<br>
<br>&#20840;&#23616;&#30340;&#24605;&#36335;&#22914;&#19979; -
&#39318;&#20808;&#65292;&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010;&#32593;&#26684;&#65292;&#35206;&#30422;&#25151;&#38388;&#65288;&#25110;&#26377;&#20851;&#30340;&#37096;&#20998;&#65289;&#12290;&#24744;&#21487;&#20197;&#36873;&#25321;&#20351;&#29992;&#32454;&#32593;&#26684;&#65292;&#36895;&#24230;&#20250;&#21464;&#24930;&#65292;&#25110;&#31895;&#31961;&#30340;&#32593;&#26684;&#65292;&#20294;&#20182;&#20204;&#37117;&#24212;&#35813;&#22522;&#20110;&#36825;&#26679;&#30340;&#36335;&#24452;&#21457;&#29616;&#26159;&#23613;&#21487;&#33021;&#20934;&#30830;&#30340;
&#20998;&#36776;&#29575;&#30340;&#25151;&#38388;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#25151;&#38388;&#26159;400X200&#20687;&#32032;&#30340;&#65292;&#20320;&#21487;&#20197;&#26377;&#19968;&#20010;&#32593;&#26684;&#20998;&#36776;&#29575;&#20026;40&#25110;20&#65292;&#25110;10...&#36825;&#19968;&#20999;&#37117;&#21462;&#20915;&#20110;&#20320;&#38656;&#35201;&#22914;&#20309;&#20934;&#30830;&#30340;&#36335;&#24452;&#21644;
&#22810;&#22823;&#30340;&#22788;&#29702;&#20570;&#20320;&#24819;&#35201;GameMaker&#29983;&#25104;&#12290;<br>
<br>
&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#38656;&#35201;&#30830;&#23450;&#25152;&#26377;&#30456;&#20851;&#30340;&#23545;&#35937;&#65292;&#25105;&#20204;&#35201;&#36991;&#20813;&#20182;&#20204;&#37325;&#21472;&#65288;&#22522;&#20110;&#36793;&#30028;&#30418;&#25110;&#31934;&#30830;&#30340;&#31934;&#28789;&#65289;&#21644;&#26631;&#35760;&#36825;&#20123;&#21333;&#20803;&#26684;&#34987;&#31105;&#27490;&#12290;&#22240;&#27492;&#65292;&#19968;&#20010;&#21333;&#20803;&#23558;&#34987;&#26631;&#35760;&#23436;&#20840;&#31105;&#27490;&#65292;&#21363;&#20351;&#38556;&#30861;&#29289;&#20165;&#37096;&#20998;&#37325;&#21472;&#12290;<br>
<br>
&#26368;&#21518;&#65292;&#25105;&#20204;&#25351;&#23450;&#30340;&#36215;&#22987;&#20301;&#32622;&#21644;&#19968;&#20010;&#30446;&#26631;&#20301;&#32622;&#65292;&#20004;&#32773;&#37117;&#24517;&#39035;&#22312;&#20110;&#33258;&#30001;&#21333;&#20803;&#26684;&#65292;&#28982;&#21518;&#35813;&#20989;&#25968;&#35745;&#31639;&#21487;&#33021;&#22312;&#36825;&#20004;&#20010;&#20301;&#32622;&#20043;&#38388;&#30340;&#26368;&#30701;&#36335;&#24452;&#12290;&#35813;&#36335;&#24452;&#23558;&#36816;&#34892;&#22312;&#20840;&#37096;&#33258;&#30001;&#21333;&#20803;&#26684;&#20013;&#65292;
&#22240;&#27492;&#65292;&#22914;&#26524;&#21333;&#20803;&#26684;&#36275;&#22815;&#22823;&#65292;&#20351;&#35813;&#23454;&#20363;&#23558;&#23436;&#20840;&#22312;&#23427;&#37324;&#38754;&#30340;&#65292;&#36825;&#23558;&#26159;&#25104;&#21151;&#30340;&#12290;&#28982;&#21518;&#65292;&#36825;&#26465;&#36335;&#24452;&#26159;&#20998;&#37197;&#30340;&#23454;&#20363;&#65292;&#36981;&#24490;&#20351;&#29992;path_functions&#12290;&#20320;&#24212;&#35813;&#35201;&#30693;&#36947;&#21333;
&#20803;&#26684;&#22823;&#23567;&#26159;&#22810;&#20040;&#37325;&#35201;&#65292;&#21333;&#20803;&#26684;&#24517;&#39035;&#26159;&#36275;&#22815;&#22823;&#65292;&#20351;&#31227;&#21160;&#30340;&#29289;&#20307;&#36215;&#28857;&#23436;&#20840;&#20301;&#20110;&#21333;&#20803;&#20013;&#12290;
&#65288;&#35831;&#23567;&#24515;&#20851;&#20110;&#29289;&#20307;&#30340;&#36215;&#28857;&#20301;&#32622;&#12290;&#20320;&#20063;&#21487;&#20197;&#36716;&#31227;&#30340;&#36335;&#24452;&#65292;&#22914;&#26524;&#23545;&#35937;&#36215;&#28857;&#19981;&#26159;&#22312;&#23427;&#30340;&#20013;&#24515;&#65281;&#65289;&#21478;&#19968;&#26041;&#38754;&#65292;&#36739;&#23567;&#30340;&#21333;&#20803;&#26684;&#26356;&#21487;&#33021;&#35753;&#36335;&#24452;&#23384;&#22312;&#12290;&#22914;&#26524;&#24744;&#20570;&#30340;&#21333;&#20803;&#26684;&#36807;&#22823;&#65292;&#21487;&#33021;
&#20250;&#22240;&#20026;&#25152;&#26377;&#30340;&#32454;&#32990;&#30456;&#20132;&#30340;&#38556;&#30861;&#32780;&#20351;&#24471;&#24320;&#21475;&#20851;&#38381;&#12290;
</p><blockquote>
<ol>
	<li><a href="mp_grid_create.html">mp_grid_create</a><br>
	</li><li><a href="mp_grid_destroy.html">mp_grid_destroy</a><br>
	</li><li><a href="mp_grid_path.html">mp_grid_path</a><br>
	</li><li><a href="mp_grid_add_cell.html">mp_grid_add_cell</a><br>
	</li><li><a href="mp_grid_add_instances.html">mp_grid_add_instances</a><br>
	</li><li><a href="mp_grid_add_rectangle.html">mp_grid_add_rectangle</a><br>
	</li><li><a href="mp_grid_clear_all.html">mp_grid_clear_all</a><br>
	</li><li><a href="mp_grid_clear_cell.html">mp_grid_clear_cell</a><br>
	</li><li><a href="mp_grid_clear_rectangle.html">mp_grid_clear_rectangle</a><br>
	</li><li><a href="mp_grid_draw.html">mp_grid_draw</a><br>
</li></ol>
</blockquote>

<p>&#22522;&#20110;&#32593;&#26684;&#30340;&#26041;&#27861;&#26159;&#38750;&#24120;&#24378;&#22823;&#30340;&#65288;&#22312;&#35768;&#22810;&#19987;&#19994;&#28216;&#25103;&#20013;&#34987;&#20351;&#29992;&#65289;&#65292;&#20294;&#23427;&#38656;&#35201;&#20320;&#20570;&#19968;&#20123;&#35748;&#30495;&#30340;&#24605;&#32771;&#65292;&#22240;&#20026;&#20320;&#24517;&#39035;&#30830;&#23450;&#21738;&#20123;&#21306;&#22495;&#21644;&#21333;&#20803;&#26684;&#22823;&#23567;&#22909;&#36275;&#22815;&#35299;&#20915;&#28216;&#25103;&#12290;&#21478;&#22806;&#65292;
&#20320;&#24517;&#39035;&#30830;&#23450;&#21738;&#20123;&#23545;&#35937;&#24517;&#39035;&#36991;&#20813;&#21644;&#31934;&#30830;&#30340;&#26816;&#26597;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;&#25152;&#26377;&#36825;&#20123;&#21442;&#25968;&#24378;&#28872;&#22320;&#24433;&#21709;&#35813;&#26041;&#27861;&#30340;&#25928;&#29575;&#12290;&#24744;&#36824;&#24517;&#39035;&#20915;&#23450;&#26159;&#21542;&#23427;&#23454;&#38469;&#19978;&#26159;&#24517;&#35201;&#30340;&#65292;&#22240;&#20026;&#65292;&#20063;&#35768;&#20854;&#20013;&#19968;&#20010;&#30340;&#25104;&#26412;
&#36739;&#20302;mp_ functions&#21487;&#20197;&#20570;&#30340;&#24037;&#20316;&#19968;&#26679;&#12290;<br>
<br>

&#26080;&#35770;&#20320;&#36873;&#25321;&#65292;&#24212;&#35813;&#25351;&#20986;&#65292;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#19978;&#36848;&#20250;&#32473;&#20320;&#19968;&#20010;&#23436;&#32654;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#20320;&#23558;&#26377;&#8220;&#28151;&#21512;&#21644;&#21305;&#37197;&#8221;&#30340;&#21151;&#33021;&#65292;&#22312;&#20320;&#30340;&#28216;&#25103;&#20013;&#20351;&#29992;&#19968;&#20010;&#25110;&#20854;&#20182;&#35270;&#24773;&#20917;&#32780;&#23450;&#12290;<br>
<br>

</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Movement and Collisions</a>
	</div>
	<div style="float: right;">
		Next : <a href="../Collisions/index.html">Collisions</a>
	</div>
</div>


<!-- KEYWORDS
--></body></html>