<!doctype html>
<html><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->

<head>
    <!-- InstanceBeginEditable name="doctitle" -->
<title>Using Buffers</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />
    <link rel="stylesheet" href="../../src/css/style.css" type="text/css" media="screen" title="style" charset="utf-8" />
    <link type="text/css" rel="stylesheet" href="../../src/css/jquery.mmenu.all.css" />
    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
      <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
      <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->
    <link rel="icon" type="../image/png" href="favicon.png">
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header" class="mm-fixed-top">
            <a href="#menu_left" class="menu_left" title="点击此按钮打开左侧目录菜单，右边的按钮则打开右侧菜单。"></a>GameMaker:Studio帮助手册
            <a href="#menu_right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Using Buffers &#20351;&#29992;&#32531;&#20914;&#21306;<br>
</h1>
  
<h2>&#22312;&#36825;&#37324;&#65292;&#20320;&#21487;&#20197;&#24471;&#21040;&#19968;&#20010;&#27010;&#36848;&#32531;&#20914;&#21306;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#65292;&#20182;&#20204;&#22312;&#28216;&#25103;&#20013;&#22914;&#20309;&#20351;&#29992;&#12290;</h2>

<p>
<i>GameMaker:Studio</i>&#24050;&#32463;&#25512;&#20986;&#20102;&#19968;&#31995;&#21015;&#28216;&#25103;&#21046;&#20316;&#35821;&#35328;&#65288;GML&#65289;&#20989;&#25968;&#22788;&#29702;&#32531;&#20914;&#21306;&#12290;&#22240;&#20026;&#23427;&#26159;&#29992;&#26469;&#22788;&#29702;&#35745;&#31639;&#26426;&#21644;&#32534;&#31243;&#25152;&#26377;&#30340;&#26102;&#20505;&#65292;&#22823;&#22810;&#25968;&#20154;&#24212;&#35813;&#29087;&#24713;&#36825;&#20010;&#26415;&#35821;&#65292;&#20294;&#30693;&#36947;&#36825;&#20010;&#35789;&#20854;&#23454;&#24182;&#19981;&#24847;&#21619;&#30528;&#20320;&#30693;&#36947;&#36825;&#24847;&#21619;&#30528;&#20160;&#20040;&#12290;&#25152;&#20197;&#36825;&#20010;&#39029;&#38754;&#30340;&#30446;&#30340;&#26159;&#35299;&#37322;&#20160;&#20040;&#32531;&#20914;&#65292;&#20197;&#21450;&#22914;&#20309;&#20351;&#29992;&#23427;&#20204;&#22312;<i>GameMaker:Studio</i>&#32534;&#31243;&#30340;&#33539;&#22260;&#20869;&#65292;&#34429;&#28982;&#20182;&#20204;&#30340;&#24037;&#20316;&#26041;&#24335;&#26159;&#30456;&#21516;&#30340;&#65292;&#26080;&#35770;&#35821;&#35328;&#25110;&#25216;&#26415;&#65292;&#36825;&#23601;&#26159;&#20026;&#20160;&#20040;&#20182;&#20204;&#30340;&#21407;&#22240;&#20043;&#19968;&#22914;&#27492;&#37325;&#35201;&#12290;<br>
<br>

</p><h3>&#20160;&#20040;&#26159;&#19968;&#20010;&#32531;&#20914;&#21306;</h3>
<p>&#32531;&#20914;&#21306;&#65288;&#32534;&#31243;&#65289;&#22522;&#26412;&#19978;&#26159;&#31995;&#32479;&#20869;&#30340;&#23384;&#20648;&#22120;&#65292;&#29992;&#20110;&#23384;&#20648;&#65288;&#20363;&#22914;&#25968;&#25454;&#20256;&#36755;&#65292;&#30896;&#25758;&#65292;&#24425;&#33394;&#25968;&#25454;&#31561;..&#65289;&#30340;&#23567;&#25968;&#25454;&#21253;&#30340;&#25968;&#25454;&#30340;&#31354;&#38388;&#12290;&#26082;&#28982;&#26159;&#22312;&#31995;&#32479;&#20869;&#23384;&#20013;&#20030;&#34892;&#65292;&#36825;&#26159;&#38750;
&#24120;&#24555;&#30340;&#35775;&#38382;&#65292;&#19968;&#20010;&#32531;&#20914;&#21306;&#36890;&#24120;&#20250;&#34987;&#29992;&#20110;&#38750;&#24120;&#30701;&#26399;&#23384;&#20648;&#65292;&#23601;&#20687;&#22312;&#22788;&#29702;&#20043;&#21069;&#65292;&#25509;&#25910;&#32593;&#32476;&#20449;&#24687;&#65292;&#25110;&#23384;&#20648;&#22312;&#20320;&#30340;&#28216;&#25103;&#20013;&#30340;&#19968;&#20010;&#26816;&#26597;&#28857;&#65288;&#36825;&#26159;&#22312;&#36827;&#19968;&#27493;&#35299;&#37322;&#20363;&#23376;&#22312;&#21518;&#38754;&#39029;&#65289;&#12290;
<img class="center" src="Buffer_Memory.png">
&#21019;&#24314;&#32531;&#20914;&#21306;&#65292;&#22312;&#31995;&#32479;&#20869;&#23384;&#20013;&#20998;&#37197;&#31354;&#38388;&#65292;&#20197;&#23383;&#33410;&#20026;&#21333;&#20301;&#35745;&#31639;&#65292;&#28982;&#21518;&#21482;&#35201;&#20445;&#30041;&#20320;&#30340;&#28216;&#25103;&#20320;&#30340;&#28216;&#25103;&#27491;&#22312;&#36816;&#34892;&#25110;&#20351;&#29992;&#30456;&#24212;&#30340;&#20989;&#25968;&#65292;&#30452;&#21040;&#20320;&#21024;&#38500;&#32531;&#20914;&#21306;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#21363;&#20351;&#20320;&#30340;&#28216;
&#25103;&#26159;&#19981;&#26159;&#28966;&#28857;&#65288;&#20363;&#22914;&#65292;&#22312;&#31227;&#21160;&#35774;&#22791;&#19978;&#65292;&#24403;&#20320;&#25226;&#28216;&#25103;&#19968;&#23450;&#20250;&#34987;&#25918;&#21040;&#21518;&#21488;&#65289;&#30340;&#32531;&#20914;&#21306;&#20173;&#28982;&#20250;&#23384;&#22312;&#65292;&#20294;&#22914;&#26524;&#28216;&#25103;&#34987;&#20851;&#38381;&#25110;&#37325;&#26032;&#21551;&#21160;&#19968;&#20010;&#21628;&#21483;&#32531;&#20914;&#21306;&#23558;&#34987;&#20002;&#22833;&#12290;<br>
<br>

<i><b>NOTE:</b> &#37325;&#26032;&#21551;&#21160;&#28216;&#25103;&#23558;&#26080;&#27861;&#28165;&#38500;&#25110;&#21024;&#38500;&#32531;&#20914;&#21306;&#65281;&#20294;&#23427;&#20250;&#38450;&#27490;&#20219;&#20309;&#36827;&#19968;&#27493;&#30340;id&#25163;&#26564;&#23558;&#24050;&#32463;&#22833;&#21435;&#20102;&#20808;&#21069;&#21019;&#24314;&#30340;&#32531;&#20914;&#21306;&#65292;&#23548;&#33268;&#20869;&#23384;&#27844;&#28431;&#20320;&#30340;&#28216;&#25103;&#26368;&#32456;&#20250;&#23849;&#28291;&#12290;&#25152;&#20197;&#65292;&#24403;&#37325;&#26032;&#24320;&#22987;&#28216;&#25103;&#65292;&#35760;&#24471;&#20808;&#21024;&#38500;&#32531;&#20914;&#21306;&#12290;</i>

</p><h3>&#32531;&#20914;&#21306;&#31867;&#22411;</h3>
<p>
<i>GameMaker:Studio</i>&#20801;&#35768;&#22235;&#31181;&#19981;&#21516;&#30340;&#32531;&#20914;&#21306;&#31867;&#22411;&#30340;&#21019;&#24314;&#12290;&#36825;&#26679;&#20570;&#30340;&#21407;&#22240;&#26159;&#65292;&#32531;&#20914;&#21306;&#34987;&#35774;&#35745;&#25104;&#19968;&#20010;&#39640;&#24230;&#20248;&#21270;&#30340;&#20020;&#26102;&#23384;&#20648;&#20171;&#36136;&#65292;&#22240;&#27492;&#20320;&#24212;
&#35813;&#21019;&#24314;&#19968;&#20010;&#32531;&#20914;&#21306;&#65292;&#26159;&#21512;&#36866;&#30340;&#65292;&#20320;&#24076;&#26395;&#23427;&#26469;&#23384;&#20648;&#25968;&#25454;&#30340;&#31867;&#22411;&#65292;&#21542;&#21017;&#20320;&#21487;&#33021;&#20250;&#24471;&#21040;&#38169;&#35823;&#25110;&#36896;&#25104;&#29942;&#39048;&#22312;&#20320;&#30340;&#20195;&#30721;&#20013;&#12290;&#22312;&#36827;&#19968;&#27493;&#35299;&#37322;&#20043;&#21069;&#65292;&#35753;&#25105;&#20204;&#26469;&#30475;&#30475;&#22235;&#20010;&#21487;&#29992;&#30340;&#32531;&#20914;&#31867;
&#22411;&#65288;&#23450;&#20041;&#22312;GML&#24120;&#37327;&#65289;&#65306;<br>
<br>

</p><div class="compat">
	<table>
	
		<tbody><tr><th>Constant</th><th>description</th></tr>

		<tr><td>buffer_fixed</td><td><br>&#19968;&#20010;&#22266;&#23450;&#22823;&#23567;&#30340;&#32531;&#20914;&#21306;&#65292;&#20197;&#23383;&#33410;&#20026;&#21333;&#20301;&#12290;&#30340;&#22823;&#23567;&#34987;&#35774;&#32622;&#21019;&#24314;&#32531;&#20914;&#21306;&#26102;&#65292;&#19981;&#33021;&#20877;&#27425;&#26356;&#25913;&#12290;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_grow</td><td><br>&#32531;&#20914;&#21306;&#23558;&#22686;&#38271;&#23558;&#25968;&#25454;&#28155;&#21152;&#21160;&#24577;&#12290;&#21019;&#24314;&#23427;&#30340;&#21021;&#22987;&#22823;&#23567;&#65288;&#36825;&#24212;&#35813;&#26159;&#19968;&#20010;&#36817;&#20284;&#30340;&#39044;&#26399;&#35201;&#23384;&#20648;&#30340;&#25968;&#25454;&#30340;&#22823;&#23567;&#65289;&#65292;&#28982;&#21518;&#23558;&#23427;&#25193;&#23637;&#25509;&#21463;&#36827;&#19968;&#27493;&#30340;&#25968;&#25454;&#65292;&#36825;&#28322;&#20986;&#30340;&#21021;&#22987;&#22823;&#23567;&#12290;<br><br></td></tr>

		<tr><td>buffer_wrap</td><td><br>&#32531;&#20914;&#21306;&#25968;&#25454;&#23558;&#21253;&#35013;&#12290;&#24403;&#25152;&#28155;&#21152;&#30340;&#25968;&#25454;&#30340;&#32531;&#20914;&#21306;&#30340;&#22823;&#23567;&#36798;&#21040;&#38480;&#21046;&#20540;&#26102;&#65292;&#35206;&#30422;&#23558;&#34987;&#25918;&#22238;&#21040;&#19978;&#38754;&#24320;&#22987;&#30340;&#32531;&#20914;&#21306;&#65292;&#24182;&#36827;&#19968;&#27493;&#20889;&#20837;&#23558;&#32487;&#32493;&#20174;&#35813;&#28857;&#12290;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_fast</td><td><br>&#36825;&#26159;&#19968;&#20010;&#29305;&#27530;&#30340;&#8220;stripped down&#8221;&#26497;&#24555;&#30340;&#35835;/&#20889;&#32531;&#20914;&#21306;&#12290;&#28982;&#32780;&#65292;&#23427;&#21482;&#33021;&#34987;&#29992;&#20110;&#26377;buffer_u8&#21644;buffer_s8&#30340;&#25968;&#25454;&#31867;&#22411;&#65292;&#21644;&#24517;&#39035;&#20026;1&#23383;&#33410;&#23545;&#40784;&#12290; &#65288;&#25968;&#25454;&#31867;&#22411;&#21644;&#23383;&#33410;&#23545;&#40784;&#30340;&#20449;&#24687;&#21487;&#20197;&#21457;&#29616;&#26412;&#39029;&#19979;&#26041;&#65289;&#12290;<br><br></td></tr>

	</tbody></table>
</div>		

<p>
<br>
&#36825;&#20123;&#37117;&#26159;&#32531;&#20914;&#21306;&#31867;&#22411;&#25552;&#20379;&#32473;&#24744;<i>GameMaker:Studio</i>&#65292;&#20320;&#36873;&#25321;&#21738;&#19968;&#20010;&#23558;&#22312;&#24456;&#22823;&#31243;&#24230;&#19978;&#21462;&#20915;&#20110;&#20320;&#24076;&#26395;&#25226;&#23427;&#30340;&#20351;&#29992;&#12290;&#20363;&#22914;&#65292;&#19968;
&#20010;&#25104;&#38271;&#32531;&#20914;&#23558;&#34987;&#29992;&#20110;&#23384;&#20648;&#25968;&#25454;&#30340;&#8220;snapshot"&#8221;&#26469;&#21019;&#24314;&#19968;&#20010;&#20445;&#23384;&#28216;&#25103;&#65292;&#22240;&#20026;&#20320;&#19981;&#30693;&#36947;&#23558;&#34987;&#25918;&#32622;&#22312;&#25968;&#25454;&#30340;&#23454;&#38469;&#24635;&#39069;&#65292;&#25110;&#24555;&#36895;&#32531;&#20914;&#26102;&#23558;&#20351;&#29992;&#20320;&#25105;&#30693;&#36947;&#65292;&#24744;&#27491;&#22312;&#20351;
&#29992;&#30340;&#20540;&#20171;&#20110;0&#21644;255&#25110;-128&#21644;127&#20043;&#38388;&#65292;&#20363;&#22914;&#65292;&#24403;RGB&#22270;&#20687;&#25968;&#25454;&#22788;&#29702;&#12290;<br>
<br>

<img class="center" src="Buffer_Types.png">&#21019;&#24314;&#19968;&#20010;&#32531;&#20914;&#21306;&#26102;&#65292;&#24744;&#24212;&#35813;&#24635;&#26159;&#8203;&#8203;&#23581;&#35797;&#21019;&#24314;&#19968;&#20010;&#22823;&#23567;&#26159;&#21512;&#36866;&#30340;&#31867;&#22411;&#65292;&#19982;&#19968;&#33324;&#30340;&#35268;&#21017;&#26159;&#65292;&#23427;&#24212;&#35813;&#21019;&#24314;&#36866;&#24212;&#65292;&#23427;&#26159;&#23384;&#20648;&#25968;&#25454;&#30340;&#26368;&#22823;&#22823;&#23567;&#65292;&#22914;&#26377;&#30097;&#38382;&#65292;&#20351;&#29992;<b>grow</b>&#32531;&#20914;&#21306;&#65292;&#20197;&#38450;&#27490;&#25913;&#20889;&#38169;&#35823;&#12290;<br>
<br>&#23454;&#38469;&#30340;&#20195;&#30721;&#26469;&#21019;&#24314;&#19968;&#20010;&#32531;&#20914;&#21306;&#20250;&#26159;&#36825;&#20010;&#26679;&#23376;&#65306;
</p><p class="code">
player_buffer = buffer_create(16384, buffer_fixed, 2);
</p>
<p>
&#36825;&#23558;&#21019;&#24314;&#19968;&#20010;&#22266;&#23450;&#30340;&#30340;&#30340;&#20849;16348&#20010;&#23383;&#33410;&#21644;&#23383;&#33410;&#23545;&#40784;&#21040;2&#30340;&#32531;&#20914;&#21306;&#65292;&#21017;&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#29420;&#29305;&#30340;id&#20540;&#65292;id&#20540;&#26159;&#23384;&#20648;&#22312;&#19968;&#20010;&#21464;&#37327;&#20013;&#65292;&#26159;&#20026;&#21518;&#38754;&#24341;&#29992;&#36825;&#20010;&#32531;&#20914;&#21306;&#12290;&#29616;&#22312;&#25105;&#20204;&#26377;&#19968;&#20010;&#32531;&#20914;&#21306;&#22522;&#26412;&#35299;&#37322;&#20102;&#65292;&#20320;&#24212;&#35813;&#23398;&#26377;&#20851;&#25968;&#25454;&#31867;&#22411;&#21644;&#23383;&#33410;&#23545;&#40784;&#30340;&#30340;&#22522;&#26412;&#27010;&#24565;&#12290;<br>
<br>

</p><h3>&#25968;&#25454;&#31867;&#22411;</h3>
<p>
&#24403;&#35835;&#21462;&#21644;&#20889;&#20837;&#25968;&#25454;&#30340;&#32531;&#20914;&#21306;&#65292;&#36890;&#36807;''data type''&#20320;&#29992;&#23427;&#22312;&#8220;chunks&#8221;&#23450;&#20041;&#25968;&#25454;&#12290; ''data type'''&#35774;&#32622;&#20998;&#37197;&#30340;&#32531;&#20914;&#21306;&#20869;&#30340;&#20215;&#20540;&#34987;&#20889;&#20837;&#30340;&#23383;&#33410;&#25968;&#65292;&#23427;&#26159;&#24517;&#19981;&#21487;&#23569;&#30340;&#65292;&#20320;&#35201;&#27491;&#30830;&#33719;&#21462;&#65292;&#21542;&#21017;&#20320;&#20250;&#20026;&#24744;&#30340;&#20195;&#30721;&#24471;&#21040;&#19968;&#20123;&#38750;&#24120;&#22855;&#24618;&#30340;&#32467;&#26524;&#65288;&#29978;&#33267;&#26159;&#38169;&#35823;&#30340;&#65289;&#12290;<br>
<br>

&#32531;&#20914;&#21306;&#34987;&#20889;&#20837;&#65288;&#35835;&#20986;&#65289;&#39034;&#24207;&#65292;&#38470;&#32493;&#22312;&#37027;&#19968;&#20010;&#34987;&#20889;&#20837;&#30340;&#25968;&#25454;&#22359;&#65292;&#27599;&#19968;&#22359;&#26159;&#19968;&#32452;&#31867;&#22411;&#30340;&#25968;&#25454;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#29702;&#24819;&#24773;&#20917;&#19979;&#65292;&#20320;&#24212;&#35813;&#30693;&#36947;&#20320;&#26159;&#20160;&#20040;&#26679;&#30340;&#25968;&#25454;&#22312;&#20219;&#20309;&#26102;&#20505;&#20889;&#20837;&#21040;&#32531;&#20914;&#21306;&#12290;&#36825;&#20123;&#25968;&#25454;&#31867;&#22411;&#23450;&#20041;&#22312;GML&#30001;&#20197;&#19979;&#24120;&#37327;&#65306;

</p><div class="compat">
	<table>
	
		<tbody><tr><th>Data Type Constant</th><th>Bytes</th><th>Description</th></tr>

		<tr><td>buffer_u8</td><td>1</td><td><br>&#19968;&#20010;&#26080;&#31526;&#21495;8&#20301;&#25972;&#25968;&#12290;&#36825;&#26159;&#19968;&#20010;&#27491;&#30340;&#20540;&#20174;0&#21040;255&#12290;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_s8</td><td>1</td><td><br>&#26377;&#31526;&#21495;8&#20301;&#25972;&#25968;&#12290;&#36825;&#21487;&#20197;&#26159;&#19968;&#20010;&#27491;&#25110;&#36127;&#30340;&#20540;&#65292;&#20174;-128&#21040;127&#65288;0&#20010;&#34987;&#24402;&#31867;&#20026;&#27491;&#24615;&#65289;&#12290;<br><br></td></tr>

		<tr><td>buffer_u16</td><td>2</td><td><br>&#19968;&#20010;&#26080;&#31526;&#21495;16&#20301;&#25972;&#25968;&#12290;&#36825;&#26159;&#19968;&#20010;&#27491;&#30340;&#20540;&#20174;0 - 65,535&#12290;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_s16</td><td>2</td><td><br>&#26377;&#31526;&#21495;16&#20301;&#25972;&#25968;&#12290;&#36825;&#21487;&#20197;&#26159;&#19968;&#20010;&#27491;&#25110;&#36127;&#30340;&#20215;&#20540;&#20174;-32,768&#21040;32,767&#65288;0&#34987;&#24402;&#31867;&#20026;&#27491;&#24615;&#65289;&#12290;<br><br></td></tr>

		<tr><td>buffer_u32</td><td>4</td><td><br>&#19968;&#20010;&#26080;&#31526;&#21495;32&#20301;&#25972;&#25968;&#12290;&#36825;&#26159;&#19968;&#20010;&#27491;&#30340;&#20540;&#20174;0&#21040;4294967295&#12290;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_s32</td><td>4</td><td><br>&#26377;&#31526;&#21495;32&#20301;&#25972;&#25968;&#12290;&#36825;&#21487;&#20197;&#26159;&#19968;&#20010;&#27491;&#25110;&#36127;&#30340;&#20215;&#20540;&#20174;-2,147,483,648&#21040;2,147,483,647&#65288;0&#34987;&#24402;&#31867;&#20026;&#27491;&#24615;&#65289;&#12290;<br><br></td></tr>

		<tr><td>buffer_f16</td><td>2</td><td><br>&#19968;&#20010;16&#20301;&#28014;&#28857;&#25968;&#23383;&#12290;&#20316;&#20026;16&#20301;&#26377;&#31526;&#21495;&#25972;&#25968;&#65292;&#36825;&#21487;&#20197;&#26159;&#19968;&#20010;&#27491;&#25110;&#36127;&#30340;&#20540;&#30456;&#21516;&#30340;&#33539;&#22260;&#20869;&#12290; &#65288;&#30446;&#21069;&#19981;&#25903;&#25345;&#65281;&#65289;<br><br></td></tr>
		
		<tr class="alt"><td>buffer_f32</td><td>4</td><td><br>&#19968;&#20010;32&#20301;&#28014;&#28857;&#25968;&#23383;&#12290;&#36825;&#21487;&#20197;&#26159;&#19968;&#20010;&#27491;&#25110;&#36127;&#30340;&#20540;&#30456;&#21516;&#30340;&#33539;&#22260;&#20869;&#65292;&#20316;&#20026;&#19968;&#20010;32&#20301;&#26377;&#31526;&#21495;&#25972;&#25968;&#12290;<br><br></td></tr>

		<tr><td>buffer_f64</td><td>8</td><td><br>64&#20301;&#28014;&#28857;&#25968;&#23383;&#12290;&#36825;&#21487;&#20197;&#26159;&#27491;&#20540;&#25110;&#36127;&#20540; -(2<sup>63</sup>) to 2<sup>63</sup> - 1.<br><br></td></tr>
		
		<tr class="alt"><td>buffer_bool</td><td>1</td><td><br>&#19968;&#20010;&#24067;&#23572;&#20540;&#12290;&#21482;&#33021;&#26159;1&#25110;0&#65288;true&#25110;false&#65289;<br><br></td></tr>

		<tr><td>buffer_string</td><td>N/A</td><td><br>&#36825;&#26159;&#19968;&#20010;UTF-8&#31354;&#20540;&#32456;&#27490;&#23383;&#31526;&#20018;&#65288;0X00&#65289;&#12290;&#22522;&#26412;&#19978;GameMaker&#23383;&#31526;&#20018;&#34987;&#25172;&#22312;&#32531;&#20914;&#21306;&#20013;&#65292;&#24182;&#22312;&#26368;&#21518;&#25918;&#19968;&#20010;0&#12290;<br><br></td></tr>
		
	</tbody></table>
</div>

<p>
<br>
&#25152;&#20197;&#65292;&#35828;&#20320;&#24050;&#32463;&#21019;&#24314;&#20102;&#19968;&#20010;&#32531;&#20914;&#65292;&#20320;&#24819;&#35201;&#20889;&#30340;&#20449;&#24687;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#20351;&#29992;&#31867;&#20284;&#19979;&#38754;&#30340;&#20195;&#30721;&#65306;
</p><p class="code">
buffer_write(buff, buffer_bool, global.Sound);<br>
buffer_write(buff, buffer_bool, global.Music);<br>
buffer_write(buff, buffer_s16, obj_Player.x);<br>
buffer_write(buff, buffer_s16, obj_Player.y);<br>
buffer_write(buff, buffer_string, global.Player_Name);<br>
</p>
<p>
&#22312;&#19978;&#38754;&#30340;&#20363;&#23376;&#20013;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#65292;&#20320;&#21487;&#20197;&#20889;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#30340;&#32531;&#20914;&#21306;&#65288;&#21482;&#38480;&#20110;&#19968;&#20010;&#29305;&#23450;&#30340;&#25968;&#25454;&#31867;&#22411;&#26102;&#65292;&#20351;&#29992;&#24555;&#36895;&#32531;&#20914;&#31867;&#22411;&#65289;&#65292;&#32780;&#36825;&#19968;&#25968;&#25454;&#23558;&#36830;&#32493;&#34987;&#28155;&#21152;&#21040;&#32531;&#20914;&#21306;&#65288;&#23613;&#31649;&#20854;&#32531;&#20914;&#21306;&#20013;&#30340;&#23454;&#38469;&#20301;&#32622;&#65292;&#23558;&#21462;&#20915;&#20110;&#23427;&#30340;&#23383;&#33410;&#23545;&#40784;&#65292;&#35299;&#37322;&#35265;&#19979;&#25991;&#65289;&#12290;&#36825;&#26159;&#30456;&#21516;&#30340;&#65292;&#20174;&#32531;&#20914;&#21306;&#20013;&#35835;&#20986;&#20449;&#24687;&#65292;&#24182;&#22312;&#19978;&#38754;&#32473;&#20986;&#30340;&#20363;&#23376;&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#20250;&#22312;&#20889;&#25968;&#25454;&#30456;&#21516;&#30340;&#39034;&#24207;&#65292;&#20174;&#32531;&#20914;&#22120;&#35835;&#20986;&#65292;&#26816;&#26597;&#30456;&#21516;&#30340;&#25968;&#25454;&#31867;&#22411;&#65292;&#20363;&#22914;&#65306;
</p><p class="code">
global.Sound = buffer_read(buff, buffer_bool);<br>
global.Music = buffer_read(buff, buffer_bool);<br>
obj_Player.x = buffer_read(buff, buffer_s16);<br>
obj_Player.y = buffer_read(buff, buffer_s16);<br>
global.Player_Name = buffer_read(buff, buffer_string);<br>
</p>
<p>&#27491;&#22914;&#20320;&#21487;&#20197;&#30475;&#21040;&#65292;&#20320;&#35835;&#20986;&#20449;&#24687;&#20197;&#30456;&#21516;&#30340;&#39034;&#24207;&#65292;&#20320;&#23558;&#23427;&#35835;&#20837;&#32531;&#20914;&#21306;&#12290;&#22914;&#20309;&#28155;&#21152;&#21644;&#21024;&#38500;&#25968;&#25454;&#20174;&#32531;&#20914;&#21306;&#27442;&#20102;&#35299;&#26356;&#22810;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;&#19979;&#38754;&#30340;&#31034;&#20363;&#37096;&#20998;&#12290; <br>
<br>

</p><h3>&#23383;&#33410;&#23545;&#40784;</h3>
<p>
&#22914;&#26524;&#20320;&#24050;&#32463;&#35835;&#36890;&#36807;&#36825;&#20010;&#39029;&#38754;&#65292;&#20320;&#20250;&#30475;&#21040;&#19968;&#20010;&#32531;&#20914;&#21306;&#30340;&#23383;&#33410;&#23545;&#40784;&#30340;&#24341;&#29992;&#12290;&#36825;&#22522;&#26412;&#19978;&#26159;&#25351;&#65292;&#26032;&#30340;&#25968;&#25454;&#23558;&#23384;&#20648;&#22312;&#19968;&#20010;&#32473;&#23450;&#30340;&#32531;&#20914;&#21306;&#20869;&#30340;&#20301;&#32622;&#12290;&#36825;&#26159;&#22914;&#20309;&#24037;&#20316;&#65311;&#37027;&#20040;&#65292;&#23545;&#20110;&#19968;
&#20010;&#21333;&#19968;&#30340;&#23383;&#33410;&#23545;&#40784;&#30340;&#32531;&#20914;&#21435;&#20013;&#65292;&#27599;&#19968;&#22359;&#30340;&#25968;&#25454;&#34987;&#20889;&#20837;&#21040;&#32531;&#20914;&#21306;&#65292;&#25353;&#39034;&#24207;&#65292;&#30452;&#25509;&#28155;&#21152;&#21518;&#65292;&#20197;&#21069;&#30340;&#27599;&#20010;&#26032;&#30340;&#25968;&#25454;&#26522;&#12290;&#28982;&#32780;&#65292;2&#20010;&#23383;&#33410;&#23545;&#40784;&#30340;&#32531;&#20914;&#65292;&#23558;&#27599;&#19968;&#22359;&#38388;&#38548;&#26102;&#38388;&#20026;2
&#20010;&#23383;&#33410;&#30340;&#25968;&#25454;&#20889;&#20837;&#65292;&#25152;&#20197;&#65292;&#21363;&#20351;&#20320;&#30340;&#21021;&#22987;&#20889;&#20837;1&#20010;&#23383;&#33410;&#30340;&#25968;&#25454;&#65292;&#19979;&#19968;&#27425;&#20889;&#23558;&#31227;&#21160;&#20004;&#20010;&#23383;&#33410;&#23545;&#40784;&#12290;
<img class="center" src="Buffer_Byte_Alignment.png"> &#25152;&#20197;&#65292;&#22914;&#26524;&#20320;&#30340;&#23383;&#33410;&#23545;&#40784;&#26041;&#24335;&#35774;&#32622;&#65292;&#27604;&#26041;&#35828;&#65292;4&#20010;&#23383;&#33410;&#65292;&#20320;&#20889;&#20102;&#19968;&#20010;&#21333;&#20214;&#30340;&#22823;&#23567;&#20026;1&#20010;&#23383;&#33410;&#30340;&#25968;&#25454;&#65292;&#28982;&#21518;&#20570;&#19968;&#20010;&#32531;&#20914;&#21306;&#65288;&#35835;/&#20889;&#32531;&#20914;&#21306;&#65289;&#33719;&#21462;&#24403;&#21069;&#30340;&#20301;&#32622;&#65292;&#20250;&#24471;&#21040;&#19968;&#20010;&#20559;&#31227;&#37327;&#20026;1&#65288;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#30340;&#20559;&#31227;&#37327;&#30340;&#23383;&#33410;&#25968;&#20174;&#32531;&#20914;&#21306;&#30340;&#24320;&#22987;&#21040;&#24403;&#21069;&#35835;/&#20889;&#20301;&#32622;&#65289;&#12290;<br>
<br>&#19981;&#36807;&#65292;&#22914;&#26524;&#20320;&#20889;&#30340;&#21478;&#19968;&#22359;&#25968;&#25454;&#65292;&#36824;&#26377;1&#20010;&#23383;&#33410;&#30340;&#22823;&#23567;&#65292;&#28982;&#21518;&#20570;&#19968;&#20010;&#32531;&#20914;&#21578;&#35785;&#65292;&#20320;&#20250;&#24471;&#21040;&#19968;&#20010;&#20559;&#31227;5&#20010;&#23383;&#33410;&#23545;&#40784;&#65288;&#21363;&#20351;&#20320;&#21482;&#20889;&#20102;2&#20010;&#23383;&#33410;&#30340;&#25968;&#25454;&#65289;&#22635;&#20805;&#25968;&#25454;&#23558;&#20854;&#19982;4&#23383;&#33410;&#30340;&#32531;&#20914;&#21306;&#23545;&#40784;&#12290;<br>
<br>&#22522;&#26412;&#19978;&#65292;&#36825;&#26159;&#20160;&#20040;&#24847;&#24605;&#26159;&#23545;&#20934;&#21482;&#20250;&#24433;&#21709;&#37027;&#37324;&#30340;&#19996;&#35199;&#26159;&#20889;&#65292;&#22240;&#27492;&#65292;&#22914;&#26524;&#20320;&#20570;&#19968;&#20010;&#32531;&#20914;&#21578;&#35785;&#20320;&#20889;&#30340;&#19996;&#35199;&#21518;&#65292;&#23427;&#20250;&#36820;&#22238;&#24403;&#21069;&#20889;&#20837;&#30340;&#20301;&#32622;&#65292;&#32039;&#36319;&#30528;&#20320;&#20197;&#21069;&#20889;&#30340;&#25968;&#25454;&#12290;&#20294;&#26159;&#65292;&#35831;&#27880;&#24847;&#65292;&#22914;&#26524;&#20320;&#20889;&#30340;&#21478;&#19968;&#22359;&#25968;&#25454;&#65292;&#20869;&#37096;&#32531;&#20914;&#21306;&#20889;&#20837;&#20301;&#32622;&#31227;&#21160;&#27839;&#23545;&#40784;&#22823;&#23567;&#30340;&#19979;&#19968;&#20010;&#20493;&#25968;&#30340;&#23454;&#38469;&#20889;&#20837;&#30340;&#25968;&#25454;&#22359;&#20043;&#21069;&#12290;<br>
<br>

</p><h3>&#31034;&#20363;</h3>
<p>&#20320;&#21487;&#20197;&#25214;&#21040;&#20004;&#20010;&#20363;&#23376;&#65292;&#20351;&#29992;&#32531;&#20914;&#21306;&#19979;&#39029;&#65306;
</p><blockquote>
	<ol>
		<li><a href="Buffer%20Examples.html">Buffer Examples &#32531;&#20914;&#21306;&#31034;&#20363;</a><br> 	
	</li></ol>
</blockquote>	

<p>
- &#30887;&#32511;&#30340;&#28246; - <br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">Buffers</a>
	</div>
	<div style="float: right;">
		Next : <a href="Buffer%20Examples.html">Buffer Examples</a>
	</div>
</div>


<h5>?Copyright YoYo Games Ltd. 2013 All Rights Reserved</h5>
<!-- KEYWORDS
byte alignment
data types
using buffers
buffers
-->  <!-- InstanceEndEditable -->
        </div>
        
        <div id="page_popup">
            <div class="popup ">
                <div>
                    <a href="#page" class="close">x</a>
                    <div>
                        <h4>喵~</h4>
                        <p>欢迎，这里是404号猫国皇室会所~~</p>
                        <p>因为找不到其它的地方，你来到了这里。</p>
                    </div>

                </div>

            </div>
        </div>
        <div id="page_fullscreen">

            <div class="panel ">
                <div>
                    <a href="#page" class="close">x</a>
                    <div>
                        <h4>喵~</h4>
                        <p>欢迎，这里是404号猫国皇室会所~~</p>
                        <p>因为找不到其它的地方，你来到了这里。</p>
                    </div>

                </div>

            </div>
        </div>

        <div id="page_mmenu">
            <nav id="menu_left">
            </nav>
            <nav id="menu_right">
            </nav>
        </div>

        <!-- KEYWORDS
        pages
        -->
    </div>
    <script type="text/javascript" src="src/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../src/js/subpage.js"></script>

</body>

<!-- InstanceEnd --></html>