<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->

<head>
    <!-- InstanceBeginEditable name="doctitle" -->
<title>Particles</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />    
    <link rel="stylesheet" href="../../src/css/style.css" type="text/css" media="screen" title="style" charset="utf-8" />
    <link type="text/css" rel="stylesheet" href="../../src/css/jquery.mmenu.all.css" />
    <link rel="stylesheet" href="../../src/css/zebra_tooltips.css" type="text/css">
    <link rel="icon" type="../image/png" href="favicon.png">
    
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
    <!-- InstanceParam name="OptionalRegion_pagefull" type="boolean" value="false" -->
    <!-- InstanceParam name="OptionalRegion_mmenutip" type="boolean" value="false" -->
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header">
           <a href="#menu-left" class="mmenu-left tooltips" title="点击此按钮打开左侧目录菜单，右边的按钮则打开右侧菜单。"></a>
            <!-- InstanceBeginEditable name="EditRegion_pagetitle" -->点击左边图标打开菜单<!-- InstanceEndEditable -->
            <a href="#menu-right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Particles &#31890;&#23376;<br>
</h1>

<h2>&#26412;&#31456;&#33410;&#26159;&#20851;&#20110;&#20351;&#29992;&#31890;&#23376;&#31995;&#32479;&#21019;&#36896;&#20302;&#32791;&#30340;&#32472;&#21046;&#29305;&#25928;&#12290;</h2>

<p>
&#22312;<i>GameMaker:Studio</i>&#20013;&#22797;&#26434;&#30340;&#20107;&#24773;&#26159;&#20320;&#36890;&#24120;&#26377;&#20010; <a href="../Objects%20and%20Instances/Objects/index.html">object</a> &#24182;&#19988;&#21019;&#36896;
<a href="../Objects%20and%20Instances/Objects/index.html">instances</a> &#20197;&#36825;&#20010;&#23545;&#35937;<i>&#21040;&#25151;&#38388;&#20013;&#65292;</i>&#28982;&#32780;&#65292;&#32472;&#21046;&#29305;&#25928;&#65292;&#20197;&#36825;&#26679;&#30340;&#26041;&#24335;&#26159;&#20195;&#20215;&#39640;&#26114;&#30340;&#65292;&#22240;&#20026;&#27599;&#20010;&#23454;&#20363;&#37117;&#22312;&#19981;&#21516;&#20107;&#20214;&#20013;&#21253;&#21547;&#20182;&#33258;&#24049;&#30340;&#21464;&#37327;&#65292;&#27599;&#20010;&#23454;&#20363;&#37117;&#23558;&#20195;&#30721;&#19981;&#21516;&#31243;&#24230;&#30340;&#8220;&#33457;&#38144;&#8221;&#65292;&#24744;&#21487;&#20197;&#36890;&#36807; 
<a href="../Game%20Assets/Backgrounds/Background%20Tiles/index.html">tiles</a> &#32472;&#21046;&#26469;&#20943;&#23569;&#33457;&#38144;&#65292;&#20294;&#26159;&#19968;&#33324;&#37117;&#26159;&#38745;&#24577;&#30340;&#65292;&#19981;&#23481;&#26131;&#25913;&#21464;&#21644;&#31227;&#21160;&#12290;&#28982;&#32780;&#65292;&#36825;&#37324;&#26377;&#19968;&#20123;&#20854;&#23427;&#30340;&#36873;&#25321;&#26469;&#24555;&#36895;&#32472;&#21046;&#29305;&#25928;&#22312;&#24744;&#30340;&#28216;&#25103;&#20013;&#65292;&#23601;&#26159;&#20351;&#29992;&#31890;&#23376;&#12290;

</p><h3>&#20160;&#20040;&#26159;&#31890;&#23376;?</h3>
<p>&#31890;&#23376;&#26159;&#23450;&#20041;&#22312;&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;&#37324;&#26377;&#19968;&#23450;&#23646;&#24615;&#30340;&#22270;&#24418;&#36164;&#28304;&#12290;&#36825;&#20123;&#23646;&#24615;&#21487;&#20197;&#19981;&#30452;&#25509;&#25805;&#21333;&#20010;&#31890;&#23376;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#29992;&#20110;&#23450;&#20041;&#21333;&#20010;&#30340;&#31890;&#23376;&#21644;&#23427;&#23646;&#20110;&#30340;&#31995;&#32479;&#30340;&#20195;&#30721;&#25913;&#21464;&#12290;&#23427;&#20204;&#20026;
&#21019;&#36896;&#32654;&#20029;&#21644;&#21326;&#20029;&#30340;&#25928;&#26524;&#65288;&#25110;&#31934;&#32454;&#21644;&#35880;&#24910;&#30340;&#65289;&#65292;&#22914;&#29190;&#28856;&#65292;&#36148;&#33457;&#65292;&#38632;&#65292;&#38634;&#65292;&#26143;&#22495;&#21644;&#30862;&#29255;&#22312;&#19968;&#22330;&#28216;&#25103;&#20013;CPU&#24320;&#38144;&#23601;&#20687;&#27809;&#20351;&#29992;&#23454;&#20363;&#19968;&#26679;&#65292;&#36825;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290; <br>
<br>&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;&#30340;&#22522;&#26412;&#35774;&#32622;&#19977;&#20010;&#27493;&#39588;&#65292;&#31532;&#19977;&#27493;&#26159;&#21487;&#36873;&#30340;&#65292;&#21462;&#20915;&#20110;&#20320;&#24590;&#20040;&#24819;&#21019;&#24314;&#24744;&#30340;&#25151;&#38388;&#20869;&#30340;&#31890;&#23376;&#25928;&#26524;&#65306;
</p><blockquote>
	<ul>
		<li><b>&#21019;&#36896;&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;</b> : <font class="" style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);">&#31890;&#23376;&#31995;&#32479;&#23601;&#20687;&#26159;&#19968;&#20010;&#23481;&#22120;&#65292;&#25105;&#20204;&#23558;&#29992;&#23427;&#26469;&#20351;&#29992;&#30340;&#19981;&#21516;&#31867;&#22411;&#30340;&#31890;&#23376;&#12290;</font><font class="" style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);">&#25105;&#20204;&#20351;&#29992;&#20195;&#30721;&#26469;&#23450;&#20041;&#19968;&#31995;&#21015;&#30340;&#35270;&#35273;&#26041;&#38754;&#21644;&#25105;&#20204;&#30340;&#31890;&#23376;&#30340;&#34892;&#20026;&#65292;&#28982;&#21518;&#25105;&#20204;&#25226;&#23427;&#20204;&#25918;&#20837;&#8220;&#23481;&#22120;&#8221;&#65292;&#20351;&#25105;&#20204;&#21487;&#20197;&#37319;&#21462;&#21644;&#20351;&#29992;&#30340;&#26102;&#20505;&#65292;&#28385;&#36275;&#26080;&#35770;&#25105;&#20204;&#20197;&#21518;&#20219;&#20309;&#26102;&#38388;&#20219;&#20309;&#22320;&#28857;&#30340;&#38656;&#35201;&#12290;</font></li><br>
		
		<li><b>&#21019;&#36896;&#19968;&#20010;&#31890;&#23376;&#31867;&#22411;</b> : &#31890;&#23376;&#31867;&#22411;&#30340;&#22270;&#24418;&#25928;&#26524;&#26412;&#36523;&#12290;&#24744;&#21487;&#20197;&#26377;&#35768;&#22810;&#19981;&#21516;&#30340;&#31867;&#22411;&#65292;&#27599;&#31181;&#31867;&#22411;&#30340;&#39068;&#33394;&#65292;&#36879;&#26126;&#24230;&#65292;&#22823;&#23567;&#21644;&#36816;&#21160;&#33539;&#22260;&#65292;&#20294;&#37325;&#35201;&#30340;&#26159;&#35201;&#27880;&#24847;&#65292;&#20320;&#19981;&#24517;&#23545;&#21333;&#20010;&#31890;&#23376;&#30340;&#25511;&#21046;&#12290;&#20320;&#23450;&#20041;&#19968;&#31995;&#21015;&#30340;&#21442;&#25968;&#21644;&#65292;&#31890;&#23376;&#23558;&#20174;&#20182;&#20204;&#30340;&#34892;&#20026;&#21019;&#24314;&#19968;&#20010;&#38543;&#26426;&#30340;&#34067;&#24310;&#12290;</li><br>		
		<li><b>&#21019;&#36896;&#21457;&#23556;&#22120;</b> : &#21457;&#23556;&#22120;&#26159;&#21487;&#20197;&#36873;&#25321;&#20351;&#29992;&#29190;&#21457;&#25110;&#32773;&#27969;&#27169;&#24335;&#22312;&#23450;&#20041;&#20013;&#26126;&#26174;&#38480;&#21046;&#65292;&#23427;&#20204;&#26159;&#21487;&#36873;&#30340;&#26159;&#22240;&#20026;&#20320;&#21487;&#20197;&#22312;&#20219;&#20309;&#23454;&#20363;&#20013;&#20351;&#29992; <a href="Particle%20Systems/part_particles_create.html"><tt>part_particles_create</tt></a> and <a href="Particle%20Systems/part_particles_create_color.html">
		<tt>part_particles_create_color</tt></a> &#20989;&#25968;&#26469;&#21019;&#36896;&#31890;&#23376;&#65292;&#20294;&#26159;&#23427;&#20204;&#24182;&#19981;&#33021;&#24635;&#26159;&#32988;&#20219;&#20219;&#20309;&#24773;&#20917;&#12290;
	</li></ul>
</blockquote>

<h3>&#38480;&#21046;</h3>
<p>&#34429;&#28982;&#31890;&#23376;&#26159;&#19968;&#20010;&#24456;&#22909;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#21019;&#24314;&#25928;&#26524;&#65292;&#20182;&#20204;&#26377;&#19968;&#23450;&#30340;&#38480;&#21046;&#21644;&#33391;&#22909;&#20570;&#27861;&#65292;&#24517;&#39035;&#36981;&#24490;&#30340;&#65292;&#38500;&#38750;&#20320;&#24819;&#35753;&#20320;&#30340;&#28216;&#25103;&#36234;&#26469;&#36234;&#32531;&#24930;&#24182;&#26368;&#32456;&#23849;&#28291;&#65306;
</p><blockquote>
	<ul>
		<li>&#31890;&#23376;&#31995;&#32479;&#65292;&#31890;&#23376;&#21644;&#21457;&#23556;&#22120;&#21344;&#29992;&#20869;&#23384;&#65292;&#22240;&#27492;&#20320;&#24212;&#35813;&#38750;&#24120;&#23567;&#24515;&#65292;&#20320;&#22914;&#20309;&#20351;&#29992;&#23427;&#20204;&#65292;&#22240;&#20026;&#23427;&#24456;&#23481;&#26131;&#23548;
&#33268;&#20869;&#23384;&#27844;&#28431;&#65292;&#36825;&#20250;&#20943;&#24930;&#65292;&#24182;&#26368;&#32456;&#23849;&#28291;&#20320;&#30340;&#28216;&#25103;&#12290;&#37197;&#21512;&#30340;&#26041;&#24335;&#20043;&#19968;&#26159;&#26377;&#19968;&#20010;&#20840;&#23616;&#31995;&#32479;&#30340;&#25152;&#26377;&#23450;&#20041;&#30340;&#28216;&#25103;&#24320;&#22987;&#26102;&#21644;&#32467;&#26463;&#26102;&#38500;&#21435;&#65292;&#20294;&#22914;&#26524;&#20320;&#24819;&#35201;&#19968;&#20010;&#21160;&#24577;&#31995;&#32479;&#65292;&#37027;&#20040;&#27599;&#20010;&#31890;
&#23376;&#21644;&#21457;&#23556;&#26497;&#65288;&#21644;&#31995;&#32479;&#26412;&#36523;&#65289;&#23427;&#19981;&#38656;&#35201;&#30340;&#26102;&#21051;&#24212;&#35813;&#34987;&#38144;&#27585;&#12290;</li><br>
		
		<li>&#31890;&#23376;&#21487;&#20197;&#34987;&#24555;&#36895;&#32780;&#36731;&#24039;&#22320;&#22312;CPU&#19978;&#25191;&#34892;&#65292;&#20294;&#20182;&#20204;&#20173;&#28982;&#38656;&#35201;&#19968;&#20123;&#22788;&#29702;&#65292;&#25152;&#20197;&#20320;&#19981;&#24212;&#35813;&#26377;40,000&#20154;&#22312;&#23631;&#24149;&#19978;&#29190;&#30772;&#19968;&#27425;&#12290;&#23558;&#23427;&#20204;&#38480;&#21046;&#22312;&#37027;&#20123;&#26159;&#24517;&#35201;&#30340;&#65292;&#20197;&#21482;&#23454;&#29616;&#29305;&#23450;&#30340;&#25928;&#26524;&#12290;</li><br>
		
		<li>&#22914;&#26524;&#20320;&#23450;&#20041;&#33258;&#24049;&#30340;&#31890;&#23376;&#31934;&#28789;&#65292;&#32780;&#19981;&#26159;&#20351;&#29992;&#30340;&#40664;&#35748;&#30340;14&#20010;&#31934;&#28789;&#20043;&#19968;&#65292;&#20320;&#24212;&#35813;&#23613;&#37327;&#35753;&#20182;&#20204;&#23613;&#21487;&#33021;&#23567;&#65292;&#20197;&#36798;&#21040;&#20320;&#38656;&#35201;&#30340;&#25928;&#26524;&#12290;</li><br>
		
		<li>&#31890;&#23376;&#19981;&#36827;&#34892;&#20219;&#20309;&#20132;&#20114;&#12290;&#22914;&#26524;&#20320;&#38656;&#35201;&#23427;&#20204;&#19982;&#29992;&#25143;&#26377;&#20219;&#20309;&#31867;&#22411;&#30340;&#20114;&#21160;&#25110;&#19982;&#20219;&#20309;&#20854;&#20182;&#23454;&#20363;&#20114;&#21160;&#22312;&#20320;&#30340;&#28216;&#25103;&#20013;&#65292;&#20320;&#24212;&#35813;&#23547;&#25214;&#22312;&#20351;&#29992;&#23454;&#20363;&#65292;&#32780;&#19981;&#26159;&#31890;&#23376;&#65292;&#31890;&#23376;&#26159;&#32431;&#22270;&#24418;</li><br>
		
		<li>&#21363;&#20351;&#27809;&#26377;&#25216;&#26415;&#19978;&#30340;&#38480;&#21046;&#20320;&#21487;&#20197;&#22312;&#19968;&#22330;&#28216;&#25103;&#20013;&#21019;&#36896;&#30340;&#31995;&#32479;&#65292;&#21457;&#23556;&#22120;&#21644;&#31890;&#23376;&#30340;&#37327;&#65292;&#20320;&#24212;&#35813;&#23581;&#35797;&#21644;&#38480;&#21046;&#19968;&#20999;&#21487;&#20197;&#20445;&#25345;&#26368;&#20302;&#38480;&#24230;&#22320;&#20351;&#29992;&#30340;&#20869;&#23384;&#30340;&#26368;&#23567;&#25968;&#30446;&#12290;</li><br>
		
		<li>&#22312;&#31227;&#21160;&#35774;&#22791;&#19978;&#65292;&#27880;&#24847;&#31890;&#23376;&#65292;&#22914;&#26524;&#20182;&#20204;&#35206;&#30422;&#20102;&#22823;&#38754;&#31215;&#30340;&#23631;&#24149;&#30340;&#32472;&#21046;&#20182;&#20204;&#21487;&#33021;&#20250;&#24456;&#24930;&#65292;&#65288;&#22312;&#31227;&#21160;&#35774;&#22791;&#19978;&#36807;&#36816;&#34892;&#25918;&#32531;&#30340;&#20027;&#35201;&#21407;&#22240;&#20043;&#19968;&#65289;</li><br>
		
		<li>&#22312;HTML5&#20013;&#27809;&#26377;&#28155;&#21152;&#28151;&#21512;&#65292;&#38500;&#38750;&#20320;&#20351;&#29992;WebGL&#65292;&#21542;&#32773;&#19981;&#33021;&#28151;&#21512;&#20219;&#20309;&#39068;&#33394;&#12290;</li><br>

	</ul>
</blockquote>

<p>
&#22914;&#19979;&#31456;&#33410;&#21253;&#25324;&#20102;&#24744;&#30340;&#31890;&#23376;&#31995;&#32479;&#30340;&#20840;&#37096;&#26041;&#38754;&#65306;
</p><blockquote>
	<ol>
		<li><a href="Simple%20Effects/index.html">Simple Effects &#31616;&#21333;&#29305;&#25928;</a><br>
		</li><li><a href="Particle%20Systems/index.html">Particle Systems &#31890;&#23376;&#31995;&#32479;</a><br>
		</li><li><a href="Particle%20Types/index.html">Particle Types &#31890;&#23376;&#31867;&#22411;</a><br>
		</li><li><a href="Particle%20Emitters/index.html">Particle Emitters &#31890;&#23376;&#21457;&#23556;&#22120;</a><br>
	</li></ol>
</blockquote>

<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Reference</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="Setting_Up_GM.html">  </a>
	</div>-->
</div>


<!-- KEYWORDS
particles
-->  <!-- InstanceEndEditable -->
        </div>
        
        <nav id="menu-left" >
        </nav>
        <nav id="menu-right" >
        </nav>
        
        
        <!-- KEYWORDS
        pages
        -->
    </div>
    
    <script type="text/javascript" src="../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../src/js/zebra_tooltips.js"></script>
    <script type="text/javascript" src="../../src/js/hammer.min.js"></script>
    <script type="text/javascript" src="../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../src/js/subpage.js"></script>
    
</body>

<!-- InstanceEnd --></html>