<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Physics Functions</title>


	
		
		<meta http-equiv="X-UA-Compatible" content="IE=9">
		<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8"></head><body>


<h1>Physics Functions &#29289;&#29702;&#20989;&#25968;<br>
</h1>

<h2><i>GameMaker:Studio</i> &#25317;&#26377;&#20016;&#23500;&#30340;&#65292;&#26131;&#20110;&#20351;&#29992;&#30340;&#65292;&#22522;&#20110;Box2D&#30340;&#65288;v2.1.2/Box2dWeb-2.1.a.3&#65289;&#30340;&#24320;&#28304;&#29289;&#29702;&#24211;&#12290;</h2>

<p>&#19968;&#20010;&#19987;&#29992;&#30340;&#29289;&#29702;&#24211;&#30340;&#25972;&#21512;&#21040; GameMaker:Studio
&#65292;&#20320;&#29616;&#22312;&#21487;&#20197;&#25511;&#21046;&#22312;&#20320;&#30340;&#28216;&#25103;&#19990;&#30028;&#20013;&#30340;&#29289;&#29702;&#23545;&#35937;&#30340;&#34892;&#20026;&#30340;&#25152;&#26377;&#26041;&#38754;&#65292;&#29305;&#21035;&#26159;&#30896;&#25758;&#21644;&#23545;&#35937;&#20132;&#20114;&#12290;&#8220;&#20256;&#32479;&#8221;&#30340;&#30896;&#25758;&#31995;&#32479;&#65288;GameMaker:Studio&#40664;&#35748;&#39033;&#65289;&#26159;
&#8220;&#21453;&#24212;&#8221;&#31995;&#32479;&#65292;&#22312;&#36825;&#37324;&#24744;&#26816;&#26597;&#26159;&#21542;&#26377;&#30896;&#25758;&#65292;&#28982;&#21518;&#20570;&#20986;&#21453;&#24212;&#65292;&#30896;&#25758;&#30340;&#20195;&#30721;&#25918;&#32622;&#22312;&#21333;&#29420;&#30340;&#23545;&#35937;&#12290;&#36825;&#36866;&#21512;&#31616;&#21333;&#30340;&#28216;&#25103;&#65292;&#20294;&#26159;&#24403;&#20320;&#26377;&#22823;&#37327;&#30340;&#23545;&#35937;&#21644;&#32534;&#30721;&#26102;&#65292;&#22312;&#28216;&#25103;&#19990;&#30028;&#20013;&#23427;&#20204;
&#22914;&#20309;&#24212;&#23545;&#19981;&#21516;&#30340;&#24773;&#20917;&#65292;&#24456;&#24555;&#26126;&#26174;&#30340;&#26159;&#31995;&#32479;&#26159;&#19981;&#22815;&#30340;&#65281;&#36825;&#26102;&#20505;&#20320;&#23601;&#35813;&#26159;&#20351;&#29992; GameMaker:Studio&#29289;&#29702;&#31995;&#32479;&#65281;<br>
<br>&#29289;&#29702;&#31995;&#32479;&#30340;&#24037;&#20316;&#21407;&#29702;&#26159;&#19968;&#20010;&#38750;&#24120;&#19981;&#21516;&#30340;&#26041;&#24335;&#26469;&#23454;&#29616;&#24120;&#35268;&#30896;&#25758;&#12290;&#23427;&#26356;&#22810;&#30340;&#26159;&#8220;&#34987;&#21160;&#8221;&#30340;&#31995;&#32479;&#65292;&#20320;&#21487;&#20197;&#23450;&#20041;&#19968;&#31995;&#21015;&#20026;&#23545;&#35937;&#30340;&#23646;&#24615;&#65292;&#20197;&#21450;&#22312;&#28216;&#25103;&#19990;&#30028;&#20013;&#30340;&#28216;&#25103;&#19990;&#30028;&#26412;&#36523;&#30340;&#23646;
&#24615;&#65292;&#22312;&#21457;&#29983;&#20219;&#20309;&#30896;&#25758;&#25110;&#30456;&#20114;&#20316;&#29992;&#20043;&#21069;&#12290;&#36825;&#20123;&#32534;&#30721;&#8220;&#35268;&#21017;&#8221;&#23558;&#25903;&#37197;&#19968;&#20999;&#37117;&#22312;&#20320;&#30340;&#28216;&#25103;&#19990;&#30028;&#20132;&#20114;&#30340;&#26041;&#24335;&#12290;&#22312;&#36825;&#31181;&#26041;&#24335;&#20013;&#65292;&#29992;&#19968;&#20123;&#31616;&#21333;&#30340;&#20195;&#30721;&#21644;&#27491;&#30830;&#30340;&#25151;&#38388;&#35774;&#32622;&#65292;&#24744;&#21487;&#20197;&#21019;
&#24314;&#38750;&#24120;&#22797;&#26434;&#30340;&#23545;&#35937;&#20043;&#38388;&#30340;&#30456;&#20114;&#20316;&#29992;&#21644;&#19990;&#30028;&#23558;&#21457;&#29983;&#21644;&#35299;&#20915;&#65292;&#32780;&#20320;&#19981;&#29992;&#20026;&#27599;&#19968;&#20010;&#21487;&#33021;&#30340;&#32467;&#26524;&#35774;&#35745;&#20195;&#30721;&#12290;<br>
<br>

&#26377;&#20960;&#20214;&#20107;&#24773;&#65292;&#20320;&#24212;&#35813;&#27880;&#24847;&#65292;&#24403;<i>GameMaker:Studio</i> &#29289;&#29702;&#19990;&#30028;&#24037;&#20316;&#26102;&#65306; <br>
<br>

</p><blockquote>
	<ul>
		<li><font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);"><font>&#29289;&#29702;&#31995;&#32479;&#30340;&#23384;&#22312;</font></font>&#26469;&#33267;&#22522;&#26412;&#25151;&#38388;&#30340;"apart"<font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);"><font>&#21644;</font></font><i>GameMaker:Studio</i><font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);"><font>&#23454;&#20363;&#32467;&#26500;</font><font>&#65292;&#36825;&#24847;&#21619;&#30528;&#23427;&#30340;&#26102;&#24207;&#21644;&#20989;&#25968;&#26410;&#24517;</font></font><font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);"><font>&#21644;&#20854;&#20182;&#20107;&#29289;&#19968;&#26679;</font></font><font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: left; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);"><font>&#32791;&#36153;&#25151;&#38388;&#36895;&#24230;&#21644;&#27493;&#39034;&#24207;&#12290;</font></font></li><br>

		<li>&#29289;&#29702;&#31995;&#32479;&#21462;&#20195;&#20102;&#35768;&#22810;&#30340;&#26222;&#36890;&#23454;&#20363;&#20989;&#25968;... &#20363;&#22914;&#65292;&#20026;&#19981;&#27490;&#19968;&#20010;&#23454;&#20363;&#35774;&#32622;&#30340;&#36895;&#24230;&#21644;&#26041;&#21521;&#65292;&#22914;&#26524;&#23427;&#24050;&#34987;&#23459;&#24067;&#20026;&#26159;&#19968;&#20010;&#23436;&#20840;&#30340;&#29289;&#29702;&#27169;&#25311;&#36523;&#20307;&#65292;&#20320;&#20250;&#20351;&#29992;&#21147;&#25110;&#25512;&#20351;&#23427;&#30340;&#22312;&#28216;&#25103;&#19990;&#30028;&#37324;&#31227;&#21160;&#12290;&#36825;&#38656;&#35201;&#19968;&#28857;&#26102;&#38388;&#26469;&#36866;&#24212;&#65292;&#22240;&#27492;&#65292;&#23454;&#39564;&#30340;&#29289;&#29702;&#24615;&#33021;&#21644;&#30693;&#36947;&#24590;&#26679;&#24037;&#20316;&#65292;&#28982;&#21518;&#20877;&#23581;&#35797;&#22914;&#20309;&#23558;&#23427;&#20204;&#38598;&#25104;&#21040;&#20320;&#30340;&#39033;&#30446;&#20013;&#12290;</li><br>

		<li>&#24744;&#25152;&#21019;&#24314;&#30340;&#23454;&#20363;&#30340;&#25968;&#37327;&#38480;&#21046;&#65292;&#21516;&#26679;&#29289;&#29702;&#19990;&#30028;&#30340;&#30896;&#25758;&#21644;&#30896;&#25758;&#22242;&#20307;&#22788;&#29702;&#20063;&#26377;&#38480;&#21046;&#12290;&#20320;&#19981;&#33021;&#26377;&#25104;&#21315;&#19978;&#19975;&#30340;&#23454;&#20363;&#65292;&#25152;&#26377;&#30340;&#29289;&#29702;&#24615;&#33021;&#21644;&#30896;&#25758;&#21644;&#19968;&#20999;&#26399;&#26395;&#30340;&#20107;&#24773;&#37117;&#24037;&#20316;&#33391;&#22909;&#65292;&#30001;&#20110;&#36825;&#26679;&#30340;&#20107;&#23454;&#65292;&#29289;&#29702;&#38656;&#35201;&#19968;&#20123;&#28418;&#20142;&#30340;&#23494;&#38598;&#22411;&#35745;&#31639;&#65292;&#25152;&#20197;&#38480;&#21046;&#33258;&#24049;&#65292;&#24182;&#22312;&#21487;&#33021;&#30340;&#24773;&#20917;&#19979;&#20248;&#21270;&#12290;<br>
      <br>
</li>

		<li>&#35774;&#32622;&#30340;&#30896;&#25758;&#26102;&#65292;&#23613;&#21487;&#33021;&#20351;&#29992;&#29238;&#27597;&#29992;&#26469;&#20026;Box2D&#30896;&#25758;&#26816;&#27979;&#20998;&#37197;&#23454;&#20363;&#65292;&#20351;&#24471;&#30896;&#25758;&#31995;&#32479;&#38480;&#21046;&#30896;&#25758;&#20301;&#25968;&#37327;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#24744;&#26377;&#20116;&#31181;&#19981;&#21516;&#30340;
&#22681;&#23545;&#35937;&#65292;&#19981;&#26816;&#26597;&#20116;&#20010;&#30340;&#30896;&#25758;&#65292;&#32780;&#26159;&#21019;&#24314;&#19968;&#20010;&#29238;&#23545;&#35937;&#65292;&#28982;&#21518;&#23558;&#20854;&#20998;&#37197;&#32473;&#20116;&#20010;&#22721;&#65292;&#21482;&#19982;&#29238;&#23545;&#35937;&#26816;&#27979;&#30896;&#25758;&#12290;&#29289;&#20307;&#30340;&#29289;&#29702;&#24615;&#36136;&#19981;&#21482;&#32487;&#25215;&#30896;&#25758;&#12290;&#22312;&#36825;&#31181;&#26041;&#24335;&#20013;&#65292;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#20320;
&#21487;&#20197;&#35753;&#20320;&#30340;&#28216;&#25103;&#30340;&#20248;&#21270;&#21644;&#36991;&#20813;&#38169;&#35823;&#12290;<br>
      <br>
</li>
		
		<li>&#23613;&#37327;&#19981;&#35201;&#20197;&#20219;&#20309;&#19981;&#21516;&#20110;&#29289;&#29702;&#20989;&#25968;&#30340;&#26041;&#24335;&#31227;&#21160;&#29289;&#20307;&#21040;&#25151;&#38388;&#20013;&#30340;&#19968;&#28857;&#65288;&#21363;&#65306;&#25163;&#21160;&#19981;&#35774;&#32622;X / Y&#22352;&#26631;&#65289;&#12290;&#34429;&#28982;&#36825;&#26159;&#21487;&#20197;&#20570;&#21040;&#30340;&#65292;&#24182;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#23427;&#21487;&#33021;&#26159;&#24517;&#35201;&#30340;&#65292;&#30001;&#20110;&#19981;&#21487;&#39044;&#30693;&#30340;&#32467;&#26524;&#36825;&#19968;&#33324;&#26159;&#35201;&#36991;&#20813;&#30340;&#65292;&#22312;&#21487;&#33021;&#26377;&#29289;&#29702;&#24341;&#25806;&#30340;&#24773;&#20917;&#19979;&#65292;&#23588;&#20854;&#26159;&#24403;&#35797;&#22270;&#35299;&#20915;&#30896;&#25758;&#26102;&#12290;<br>
      <br>
</li>
		
		<li>&#24403;&#37319;&#21462;&#32422;&#26463;&#21147;&#30340;&#35013;&#32622;&#24212;&#35813;&#23567;&#24515;&#65292;&#22240;&#20026;&#23427;&#20204;&#21487;&#20197;&#21508;&#33258;&#22320;&#34987;&#32465;&#23450;&#21040;&#23545;&#35937;&#21644;&#23454;&#20363;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#20320;&#32465;&#23450;&#19968;&#20010;&#22266;&#23450;&#30340;&#65288;&#20363;&#22914;&#65289;&#30340;&#8220;o_Wall&#8221;&#65292;&#35813;&#23545;&#35937;&#30340;&#25152;&#26377;&#23454;&#20363;&#23558;&#24471;&#21040;&#22266;&#23450;&#12290;&#22914;&#26524;&#24744;&#21482;&#24819;&#35201;&#32465;&#23450;&#19968;&#20010;&#22266;&#23450;&#23454;&#20363;&#65292;&#23601;&#35813;&#20351;&#29992;&#35813;&#23454;&#20363;&#30340;ID&#22312;&#30456;&#24212;&#30340;&#20989;&#25968;&#12290;<br>
      <br>
</li>
		
		<li>&#35831;&#27880;&#24847;&#65292;&#30001;&#20110;&#28014;&#28857;&#31934;&#24230;&#30340;&#24046;&#24322;&#65292;&#20320;&#21487;&#33021;&#20250;&#21457;&#29616;&#20320;&#30340;&#28216;&#25103;&#30340;HTML5&#29256;&#26412;&#21487;&#33021;&#20250;&#19982;Windows&#29256;&#26412;&#20986;&#29616;&#24494;&#22937;&#30340;&#19981;&#21516;&#34892;&#20026;&#65292;&#20294;&#27599;&#20010;&#29256;&#26412;&#23558;&#22312;&#21518;&#32493;&#30340;&#25191;&#34892;&#26159;&#39318;&#23614;&#19968;&#33268;&#30340;&#12290;<br>
      <br>
</li>
		
		<li>&#20026;&#20102;&#38450;&#27490;&#22312;&#29289;&#29702;&#27169;&#25311;&#20013;&#30340;&#19981;&#31283;&#23450;&#24615;&#65292;Box2D&#30340;&#38480;&#21046;&#21333;&#29420;&#26356;&#26032;&#19968;&#23450;&#25968;&#37327;&#30340;&#29289;&#20307;&#26059;&#36716;&#21644;&#32763;&#36716;&#12290;&#26126;&#26174;&#20250;&#26681;&#25454;&#29289;&#29702;&#19990;&#30028;&#30340;&#29289;&#29702;&#27169;&#25311;&#30340;&#20934;&#30830;&#24615;&#30340;&#19981;&#21516;&#38480;&#21046;&#26356;&#26032;&#30340;&#25968;&#37327;&#21644;&#26356;&#26032;&#36895;&#24230;&#30340;&#65292;&#24182;&#19988;&#20063;&#26681;&#25454;&#29289;&#29702;&#19990;&#30028;&#30340;&#32553;&#25918;&#12290;&#36825;&#24847;&#21619;&#30528;&#65288;&#20030;&#20363;&#26469;&#35828;&#65289;&#65292;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#19990;&#30028;&#30340;&#26356;&#26032;&#36895;&#24230;60&#65292;&#26368;&#22823;&#31227;&#21160;&#36895;&#24230;&#21487;&#33021;&#20026;20</li>
	</ul>
</blockquote>

<p>
&#29289;&#29702;&#20989;&#25968;&#20449;&#24687;&#21487;&#22312;&#22914;&#19979;&#39029;&#38754;&#25214;&#21040;&#65306;

</p><blockquote>
	<ol>
		<li><a href="The%20Physics%20World/index.html">The Physics World &#29289;&#29702;&#19990;&#30028;</a><br>
		</li><li><a href="Forces/index.html">Forces &#21147;</a><br>
		</li><li><a href="Fixtures/index.html">Fixtures &#22266;&#23450;</a><br>
		</li><li><a href="Joints/index.html">Joints &#32852;&#25509;</a><br>
		</li><li><a href="Physics%20Variables/index.html">Physics Variables &#29289;&#29702;&#21464;&#37327;</a><br>
	</li></ol>
</blockquote>

<p>&#26368;&#21518;&#65292;&#26377;&#19968;&#20123;&#29305;&#27530;&#30340;&#26356;&#20808;&#36827;&#30340;&#29289;&#29702;&#27169;&#25311;&#30340;&#29289;&#29702;&#20989;&#25968;&#21487;&#34987;&#20351;&#29992;&#12290;&#31532;&#19968;&#20010;&#26159;&#26816;&#27979;&#22312;&#19968;&#20010;&#22312;&#25151;&#38388;&#37324;&#29305;&#23450;&#30340;&#28857;&#21487;&#33021;&#21457;&#29983;&#30340;&#30896;&#25758;&#27979;&#35797;&#65292;&#31532;&#20108;&#20010;&#26159;&#22312;&#19968;&#20010;&#23454;&#20363;&#20013;&#29983;&#25104;&#33258;&#23450;&#20041;&#30340;&#36136;&#37327;&#21644;&#24815;&#24615;&#29305;&#24615;&#65306;

</p><blockquote>
<ol>
	<li><a href="physics_test_overlap.html">physics_test_overlap</a><br>
	</li><li><a href="physics_mass_properties.html">physics_mass_properties</a><br>
</li></ol>
</blockquote>
	
<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Reference</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="../Asynchronous Functions/index.html">Asynchronous Functions</a>
	</div>-->
</div>


<!-- KEYWORDS
physics
Box 2D
physics limitations
--></body></html>