<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Surfaces</title>

	
		
		<meta http-equiv="X-UA-Compatible" content="IE=9">
		<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" --><link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.css" />
<link type="text/css" rel="stylesheet" href="../../../src/css/extensions/jquery.mmenu.themes.css" />

<style type="text/css">
@media all and (min-width: 900px) {
html, body {
height: 100%;

}
#menu {
background: #eee;
}
#page {
border-left: 1px solid #ccc;
min-height: 100%;
}
}
</style>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<script type="text/javascript" src="../../../src/js/jquery.mmenu.js"></script>
<script type="text/javascript">
$(function() {
$('nav#menu').mmenu({
classes: 'mm-light'
});
});
</script>

<div id="page">
			<div id="header">
				<a href="#menu"></a>
				点击左边按键打开导航菜单
			</div>
			<div id="content">
			
<!-- 注意：使用此库文件的页面“/body”前面必须配置mmenu_body_down.lbi 2 -->


<!-- #EndLibraryItem --><h1>Surfaces &#34920;&#38754;<br>
</h1>

<h2>&#26412;&#31456;&#33410;&#35752;&#35770;&#20851;&#20110;&#21019;&#24314;&#21644;&#25805;&#20316;&#34920;&#38754;&#30340;&#20989;&#25968;&#12290;<br>
</h2>

<p>&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#24744;&#21487;&#33021;&#19981;&#24076;&#26395;&#30452;&#25509;&#32472;&#21046;&#21040;&#23631;&#24149;&#19978;&#65292;&#32780;&#26159;&#35201;&#8220;&#30011;&#24067;&#8221;&#65292;&#20877;&#21518;&#26469;&#34987;&#25805;&#32437;&#21644;&#32472;&#21046;&#21040;&#23631;&#24149;&#19978;&#65292;&#22312;&#38656;&#35201;&#30340;&#26102;&#20505;&#12290;&#36825;&#26679;&#30340;&#30011;&#24067;&#34987;&#31216;&#20026;&#19968;&#20010;&#34920;&#38754;&#65292;&#34920;&#38754;&#21487;&#20197;&#26159;&#19968;&#20010;&#38750;&#24120;&#24378;&#22823;&#30340;&#22270;&#24418;&#24037;&#20855;&#22312;&#21046;&#20316;<i>GameMaker:Studio</i>&#28216;
&#25103;&#26102;&#65292;&#12290;&#20363;&#22914;&#65292;&#24744;&#21487;&#20197;&#20351;&#29992;&#34920;&#38754;&#8220;&#25417;&#8221;&#23454;&#20363;&#65292;&#23427;&#21487;&#20197;&#34987;&#25703;&#27585;&#65292;&#24182;&#20197;&#36825;&#31181;&#26041;&#24335;&#65292;&#20320;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;&#36148;&#33457;&#25928;&#26524;&#26174;&#31034;&#23454;&#20363;&#30340;&#31934;&#28789;&#22312;&#34920;&#38754;&#19978;&#65292;&#22914;&#26524;&#23427;&#20173;&#28982;&#23384;&#22312;&#65292;&#20801;&#35768;&#32472;&#21046;&#25928;&#26524;&#65292;
&#22914;&#30862;&#29255;&#65292;&#34880;&#28082;&#31561;..
&#27809;&#26377;&#20219;&#20309;&#23454;&#38469;&#30340;&#22788;&#29702;&#24320;&#38144;&#12290;&#21478;&#19968;&#20214;&#20107;&#20320;&#21487;&#20197;&#20570;&#34920;&#38754;&#32441;&#29702;&#36827;&#34892;&#25805;&#20316;&#65292;&#25110;&#21019;&#24314;&#31934;&#28789;&#8220;&#22312;&#39134;&#8221;&#65292;&#25110;&#21019;&#24314;&#22797;&#26434;&#30340;&#21472;&#21152;&#12290;&#20107;&#23454;&#19978;&#65292;&#34920;&#38754;&#29992;&#36884;&#19978;&#26159;&#26080;&#31351;&#30340;&#65281; <br>
<br>&#34920;&#38754;&#26159;&#24456;&#23481;&#26131;&#20351;&#29992;&#65292;&#20294;&#20063;&#26377;&#20960;&#20010;&#24212;&#36981;&#24490;&#30340;&#22522;&#26412;&#35268;&#21017;&#65292;&#24403;&#24744;&#20351;&#29992;&#23427;&#20204;&#65306;
</p><blockquote>
<ul>
	<li>&#39318;&#20808;&#65292;&#20320;&#24212;&#35813;&#26126;&#30333;&#65292;&#34920;&#38754;&#19978;&#26159;&#8220;&#19981;&#31283;&#23450;&#8221;&#12290;&#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#35774;&#22791;&#25110;&#31383;&#21475;&#22833;&#21435;&#28966;&#28857;&#25110;&#26368;&#23567;&#21270;&#65288;&#24456;&#22909;&#30340;&#20363;&#23376;&#26159;&#65292;&#24403;&#23631;&#24149;&#20445;&#25252;&#31243;&#24207;&#20986;&#29616;&#22312;Windows&#25110;Android
&#35774;&#22791;&#19978;&#26102;&#65292;&#24212;&#29992;&#31243;&#24207;&#22833;&#21435;&#38598;&#20013;&#21628;&#21483;&#65289;&#30340;&#34920;&#38754;&#21487;&#33021;&#20250;&#34987;&#30772;&#22351;&#12290;&#36825;&#26159;&#22240;&#20026;&#23427;&#26159;&#23384;&#20648;&#22312;vRAM&#20013;&#65292;&#24403;&#30446;&#26631;&#24179;&#21488;&#38656;&#35201;&#20854;&#20182;&#30340;&#19996;&#35199;&#20889;&#20837;&#20869;&#23384;&#26102;&#65292;&#36825;&#24847;&#21619;&#30528;&#65292;&#20320;&#24212;&#35813;&#22987;&#32456;&#26377;&#26576;&#31181;
&#31867;&#22411;&#30340;&#25925;&#38556;&#23433;&#20840;&#30340;&#20195;&#30721;&#22312;&#24688;&#24403;&#30340;&#20301;&#32622;&#65292;&#36890;&#24120;&#26159;&#20351;&#29992; <a href="surface_exists.html"><tt>surface_exists</tt></a> &#12290;<br>
	<br>
	
	</li><li>&nbsp;&#20854;&#27425;&#65292;&#20320;&#24212;&#35813;&#27880;&#24847;&#30340;&#26159;&#34920;&#38754;&#38656;&#35201;&#20351;&#29992;&#22823;&#37327;&#30340;vRAM&#65292;&#25152;&#20197;&#20320;&#24212;&#35813;&#23581;&#35797;&#35753;&#20182;&#20204;&#23613;&#21487;&#33021;&#30340;&#23567;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#20320;&#23558;&#23613;&#37327;&#20445;&#25345;&#20182;&#20204;&#19981;&#36229;&#36807;&#35270;&#35282;&#25110;&#32773;&#26174;&#31034;&#31383;&#21475;&#22823;&#23567;&#12290;<br>
	<br>
	
	</li><li>&#31532;&#19977;&#65292;&#20320;&#24212;&#35813;&#23581;&#35797;&#32472;&#21046;&#34920;&#38754;&#22312;&#32472;&#21046;&#20107;&#20214;&#20013;&#12290;&#36825;&#24182;&#19981;&#24635;&#26159;&#21487;&#33021;&#30340;&#65292;&#20294;&#30001;&#20110;<i>GameMaker:Studio</i> &#32472;&#21046;&#21040;&#23631;&#24149;&#19978;&#30340;&#20248;&#21270;&#30340;&#26041;&#24335;&#65292;&#23427;&#26159;&#24314;&#35758;&#20320;&#25226;&#25152;&#26377;&#30340;&#32472;&#21046;&#25918;&#22312;&#32472;&#22270;&#20107;&#20214;&#20013;&#12290; <br>
	<br>
	
	</li><li>&#31532;
&#22235;&#65292;&#24403;&#25163;&#21160;&#32472;&#21046;&#34920;&#38754;&#65292;&#34920;&#38754;&#24635;&#26159;&#22312;&#25151;&#38388;&#20869;&#30340;&#65288;0,0&#65289;&#30340;&#20301;&#32622;&#22788;&#12290;&#36825;&#24847;&#21619;&#30528;&#20320;&#21487;&#33021;&#38656;&#35201;&#32477;&#23545;&#22352;&#26631;&#36716;&#25442;&#21040;&#23616;&#37096;&#22352;&#26631;&#31995;&#30340;&#34920;&#38754;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#35270;&#35282;&#23610;&#23544;&#30340;&#34920;&#38754;&#65292;&#24819;
&#30011;&#30340;&#19996;&#35199;&#22312;&#30446;&#21069;&#30340;&#35813;&#34920;&#38754;&#19978;&#65292;&#20320;&#24212;&#35813;&#20174;&#23454;&#38469;&#30340;x&#21644;y&#22352;&#26631;&#20943;&#21435;&#35270;&#35282;&#30340;X&#21644;Y&#22352;&#26631;&#65292;&#33719;&#24471;&#34920;&#38754;&#65288; 0,0&#65289;&#30340;&#20301;&#32622;&#30340;&#30456;&#23545;&#20301;&#32622;&#12290;&#22240;&#27492;&#65292;&#20195;&#30721;&#30475;&#36215;&#26469;&#20687;&#36825;&#26679;&#65306; <br>
	<br>
		<p class="code">
		if view_current = 0<br>
		&nbsp;&nbsp;&nbsp;{<br>
		&nbsp;&nbsp;&nbsp;surface_set_target(surf);<br>
		&nbsp;&nbsp;&nbsp;with (obj_Effect)<br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{<br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;draw_sprite(sprite_index, image_index, x - view_xview[1], y - view_yview[1]);<br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}<br>
		&nbsp;&nbsp;&nbsp;surface_reset_target();<br>
		&nbsp;&nbsp;&nbsp;}<br>
		else<br>
		&nbsp;&nbsp;&nbsp;{<br>
		&nbsp;&nbsp;&nbsp;draw_surface(surf, 0, 0);<br>
		&nbsp;&nbsp;&nbsp;}<br>
		</p>
	
</li></ul>
</blockquote>	
	
<p>&#34920;&#38754;&#30340;&#22522;&#26412;&#29992;&#27861;&#22914;&#19979;-&#39318;&#20808;&#21019;&#24314;&#19968;&#20010;&#34920;&#38754;&#65292;&#25226;&#23427;&#30340;&#32034;&#24341;&#20998;&#37197;&#32473;&#19968;&#20010;&#21464;&#37327;&#12290;&#28982;&#21518;&#65292;&#24744;&#21487;&#20197;&#35774;&#32622;&#32472;&#22270;&#30446;&#26631;&#21040;&#34920;&#38754;&#32780;&#19981;&#26159;&#26174;&#31034;&#22120;&#65292;&#21487;&#20197;&#32472;&#21046;&#24744;&#24076;&#26395;&#32472;&#21046;&#30340;&#20197;&#21450;&#36827;&#34892;&#20219;&#20309;&#20854;&#20182;
&#25805;&#20316;&#12290;&#19968;&#26086;&#20320;&#37325;&#26032;&#35774;&#23450;&#32472;&#22270;&#30446;&#26631;&#65292;&#23601;&#20351;&#25152;&#26377;&#36827;&#19968;&#27493;&#20877;&#27425;&#32472;&#21046;&#22312;&#23631;&#24149;&#19978;&#12290;&#26377;&#19968;&#28857;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#22914;&#26524;&#24744;&#38656;&#35201;&#25972;&#20010;&#26174;&#31034;&#34920;&#38754;&#65288;&#21253;&#25324;&#29943;&#30742;&#65292;&#32972;&#26223;&#31561;&#65289;&#65292;&#20320;&#24212;&#35813;&#20998;&#37197;&#21040;&#19968;&#20010;&#35270;&#35282;
&#20351;&#29992;&#30340;&#21464;&#37327;&nbsp;<a href="../Windows%20And%20Views/Views/view_surface_id.html"><tt>view_surface_id[0..7]<span style="font-family: Verdana,Helvetica,Arial,sans-serif;"> </span></tt></a>&#20197;&#36825;&#31181;&#26041;&#24335;&#65292;&#22312;&#35813;&#35270;&#22270;&#20013;&#21487;&#35265;&#30340;&#23558;&#34987;&#32472;&#21046;&#21040;&#30456;&#24212;&#30340;&#34920;&#38754;&#12290; <br>
<br>&#23384;&#22312;&#20197;&#19979;&#20989;&#25968;&#22788;&#29702;&#34920;&#38754;&#65306;
</p><blockquote>
<ol>
	<li><a href="surface_exists.html">surface_exists</a><br>
	</li><li><a href="surface_create.html">surface_create</a><br>
	</li><li><a href="surface_create_ext.html">surface_create_ext</a><br>
	</li><li><a href="surface_set_target.html">surface_set_target</a><br>
	</li><li><a href="surface_reset_target.html">surface_reset_target</a><br>
	</li><li><a href="surface_copy.html">surface_copy</a><br>
	</li><li><a href="surface_copy_part.html">surface_copy_part</a><br>
	</li><li><a href="surface_get_height.html">surface_get_height</a><br>
	</li><li><a href="surface_get_width.html">surface_get_width</a><br>
	</li><li><a href="surface_getpixel.html">surface_getpixel</a><br>
	</li><li><a href="surface_free.html">surface_free</a><br>
	</li><li><a href="surface_save.html">surface_save</a><br>
	</li><li><a href="surface_save_part.html">surface_save_part</a><br>
</li></ol>
</blockquote>

<p>&#36825;&#20123;&#20989;&#25968;&#26159;&#19987;&#38376;&#29992;&#20110;&#21019;&#24314;&#21644;&#25805;&#32437;&#34920;&#38754;&#65292;&#20294;&#35201;&#30495;&#27491;&#25226;&#23427;&#20204;&#30011;&#21040;&#23631;&#24149;&#19978;&#65292;&#20320;&#24212;&#35813;&#20351;&#29992;&#29305;&#23450;&#30340;&#32472;&#21046;&#20989;&#25968;&#65292;&#21487;&#20197;&#22312;&#22914;&#19979;&#31456;&#33410;&#25214;&#21040;&#30456;&#20851;&#20869;&#23481; <a href="../Drawing/Drawing%20Surfaces/index.html">Drawing Surfaces</a> &#12290;<br>
<br>

</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Reference</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="Setting_Up_GM.html">  </a>
	</div>-->
</div>


<!-- KEYWORDS
--><!-- #BeginLibraryItem "/Library/mmenu_body_down.lbi" -->
</div>
			<nav id="menu">
				<ul>
					<li ><a href="../../../index.html">GameMaker:Studio 手册首页</a></li>
					<li ><a href="../../000_Using GameMaker/index.html">GameMaker:Studio 使用</a></li>
					<li ><a href="../../001_Advanced Use/index.html">Advanced Use 高级使用</a></li>
					<li ><a href="../index.html">Reference 参考</a></li>
					<li ><a href="#">Tutorials 教程</a></li>
					<li ><a href="#">Setting 设置</a></li>					
				</ul>
			</nav>
</div>
<!-- 注意2 --><!-- #EndLibraryItem --></body></html>