<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
    <!-- InstanceBeginEditable name="doctitle" -->
<title>Particle Types</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9">
    <link rel="stylesheet" href="../../../style.css" type="text/css" media="screen" title="style" charset="utf-8">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />
    <link type="text/css" rel="stylesheet" href="/src/css/jquery.mmenu.all.css" />
    <script type="text/javascript" src="../../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../../src/js/hammer.min.js"></script>
    <script type="text/javascript" src="../../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../../src/js/index.js"></script>
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header">
            <a href="#menu-left"></a>
            <!-- InstanceBeginEditable name="EditRegion_pagetitle" -->点击左边图标打开菜单<!-- InstanceEndEditable -->
            <a href="#menu-right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Particle Types &#31890;&#23376;&#31867;&#22411;<br>
</h1>

<h2>&#26412;&#31456;&#33410;&#20851;&#20110;&#31890;&#23376;&#31995;&#32479;&#20013;&#23450;&#20041;&#31890;&#23376;&#30340;&#20989;&#25968;&#12290; </h2>

<p>&#31890;&#23376;&#26159;&#36890;&#36807;&#20351;&#29992;&#31890;&#23376;&#31995;&#32479;&#22312;&#28216;&#25103;&#20013;&#21019;&#24314;&#30340;&#22270;&#24418;&#25928;&#26524;&#12290;&#24744;&#20351;&#29992;&#36825;&#20123;&#20989;&#25968;&#23450;&#20041;&#31890;&#23376;&#21487;&#29992;&#20110;&#22312;&#20219;&#20309;&#20320;&#21019;&#24314;&#31995;&#32479;&#20013;&#65292;&#24182;&#19988;&#36890;&#24120;&#30340;&#31243;&#24207;&#26159;&#22312;&#24320;&#22987;&#28216;&#25103;&#21069;&#23558;&#23450;&#20041;&#22909;&#30340;&#31890;&#23376;&#23384;
&#25918;&#21040;&#20840;&#23616;&#21464;&#37327;&#20013;&#12290;&#36825;&#20123;&#20840;&#23616;&#21464;&#37327;&#33021;&#22815;&#22312;&#29190;&#21457;&#65292;&#21457;&#23556;&#25110;&#26032;&#24314;&#31890;&#23376;&#22312;&#20219;&#20309;&#26102;&#38388;&#22312;&#25972;&#20010;&#28216;&#25103;&#20013;&#26159;&#20351;&#29992;&#12290;&#24744;&#36824;&#21487;&#20197;&#21019;&#24314;&#65292;&#20351;&#29992;&#65292;&#28982;&#21518;&#25703;&#30772;&#22351;&#31890;&#23376;&#30340;&#22312;&#38656;&#35201;&#26102;&#65292;&#22914;&#35760;&#24518;&#20307;&#38382;&#39064;&#65292;
&#25110;&#22914;&#20320;&#24819;&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#31867;&#22411;&#65292;&#20294;&#21482;&#22312;&#24744;&#30340;&#28216;&#25103;&#30340;&#29305;&#23450;&#30340;&#28857;&#12290;&#26080;&#35770;&#24744;&#36873;&#25321;&#65292;&#31890;&#23376;&#26159;&#19968;&#31181;&#29992;&#36884;&#24456;&#24191;&#30340;&#36164;&#28304;&#65281; <br>
<br>

</p><h3>&#23450;&#20041;&#31890;&#23376;</h3>

<p>
&#31890;&#23376;&#38656;&#35201;&#21019;&#24314;&#32034;&#24341;&#23384;&#20648;&#22312;&#19968;&#20010;&#21464;&#37327;&#65292;&#20197;&#20415;&#36827;&#19968;&#27493;&#31890;&#23376;&#31243;&#24207;&#21487;&#20197;&#27491;&#30830;&#22320;&#35775;&#38382;&#23427;&#20204;&#12290;&#20197;&#19979;&#20989;&#25968;&#29992;&#20110;&#21019;&#24314;&#65292;&#26816;&#26597;&#65292;&#28165;&#38500;&#21644;&#38144;&#27585;&#30340;&#31890;&#23376;&#31867;&#22411;&#65306;
</p><blockquote>
	<ol>
		<li><a href="part_type_exists.html">part_type_exists<br></a>
		</li><li><a href="part_type_create.html">part_type_create<br></a>
		</li><li><a href="part_type_destroy.html">part_type_destroy<br></a>
		</li><li><a href="part_type_clear.html">part_type_clear<br></a>
	</li></ol>
</blockquote>

<p>
&#19968;&#26086;&#20320;&#24050;&#32463;&#21019;&#24314;&#20102;&#20320;&#30340;&#31890;&#23376;&#31867;&#22411;&#65292;&#20320;&#24212;&#35813;&#32473;&#23427;&#19968;&#20010;&#24418;&#29366;&#12290;&#36825;&#21487;&#20197;&#26159;64x64&#20687;&#32032;&#30340;&#31934;&#28789;&#19982;alpha&#28151;&#21512;&#30340;&#24418;&#29366;&#65292;&#24314;&#20110;14&#20010;&#20869;&#32622;&#24418;&#29366;&#65292;&#25110;&#32773;&#20320;&#21487;&#20197;&#20351;&#29992;&#33258;&#24049;&#30340;&#31934;&#28789;&#65292;&#23427;&#21487;&#20197;&#26159;&#21160;&#24577;&#30340;&#65292;&#38745;&#24577;&#30340;&#65292;&#25110;&#20351;&#29992;&#38543;&#26426;&#23376;&#22270;&#20687;&#12290;&#19979;&#38754;&#30340;&#20989;&#25968;&#23450;&#20041;&#27599;&#20010;&#31890;&#23376;&#30340;&#35270;&#35273;&#22522;&#26412;&#24418;&#29366;&#65306;
</p><blockquote>
	<ol>
		<li><a href="part_type_shape.html">part_type_shape<br></a>
		</li><li><a href="part_type_sprite.html">part_type_sprite<br></a>
	</li></ol>
</blockquote>

<p>
&#19979;&#22270;&#26174;&#31034;&#20102;14&#20010;&#20869;&#24314;&#31890;&#23376;&#30340;&#31867;&#22411;&#65292;&#20320;&#21487;&#20197;&#36873;&#25321;&#65306;
<img class="center" src="../../../images/Particle_Sprites.png">

</p><p>
&#19968;&#26086;&#20320;&#24050;&#32463;&#36873;&#25321;&#31890;&#23376;&#31867;&#22411;&#30340;&#31934;&#28789;&#65288;&#26080;&#35770;&#26159;&#40664;&#35748;&#30340;&#24418;&#29366;&#25110;&#24744;&#33258;&#24049;&#30340;&#65289;&#65292;&#20320;&#21487;&#20197;&#22768;&#26126;&#23427;&#30340;&#22823;&#23567;&#21644;&#27604;&#20363;&#12290;&#36825;&#20123;&#23610;&#23544;&#21487;&#34987;&#25351;&#23450;&#20026;&#19968;&#20010;&#33539;&#22260;&#65292;&#24182;&#20840;&#37096;&#30340;&#31934;&#28789;&#25353;&#29031;&#36873;&#23450;&#30340;&#33539;&#22260;&#26469;&#21019;&#24314;&#12290;&#27604;&#20363;&#26159;&#8220;&#22522;&#30784;&#8221;&#30340;&#20540;&#65292;&#26159;&#22312;&#20219;&#20309;&#21464;&#21270;&#21069;&#30340;x&#21644;y&#36724;&#30340;&#27604;&#20363;&#65292;&#19979;&#21015;&#20989;&#25968;&#26159;&#29992;&#26469;&#25511;&#21046;&#36825;&#20123;&#31890;&#23376;&#30340;&#20540;&#65306; 
</p><blockquote>
	<ol>
		<li><a href="part_type_size.html">part_type_size<br></a>
		</li><li><a href="part_type_scale.html">part_type_scale<br></a>
	</li></ol>
</blockquote>

<p>
<font style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);">&#31890;&#23376;&#20063;&#21487;&#20197;&#26377;&#19968;&#20010;&#26041;&#21521;&#21644;&#36816;&#21160;&#12290;</font><font class="" style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36);">&#27491;&#22914;&#22823;&#22810;&#25968;&#30340;&#31890;&#23376;&#30340;&#21151;&#33021;&#65292;&#36895;&#24230;&#65292;&#26041;&#21521;&#21644;&#26041;&#21521;&#25253;&#37117;&#34987;&#35299;&#26512;&#20026;&#19968;&#20010;&#38543;&#26426;&#30340;&#20540;&#65292;&#35813;&#20540;&#26159;&#20174;&#19968;&#20010;&#32473;&#23450;&#30340;&#33539;&#22260;&#20869;&#36873;&#25321;&#65292;&#24182;&#19988;&#21487;&#20197;&#20351;&#29992;&#20197;&#19979;&#20989;&#25968;&#35774;&#32622;&#65306;</font>
</p><blockquote>
	<ol>
		<li><a href="part_type_speed.html">part_type_speed<br></a>
		</li><li><a href="part_type_direction.html">part_type_direction<br></a>
		</li><li><a href="part_type_gravity.html">part_type_gravity<br></a>
		</li><li><a href="part_type_orientation.html">part_type_orientation<br></a>
  	</li></ol>
</blockquote>

<p>
&#19968;&#26086;&#20320;&#30340;&#39118;&#26684;&#21644;&#20320;&#30340;&#31890;&#23376;&#36816;&#21160;&#30340;&#25972;&#29702;&#20986;&#26469;&#65292;&#28982;&#21518;&#20320;&#21487;&#20197;&#35774;&#32622;&#23427;&#20204;&#30340;&#39068;&#33394;&#21644;alpha&#20540;&#65292;&#36825;&#20004;&#32773;&#37117;&#21487;&#20197;&#34987;&#35774;&#32622;&#20026;&#19968;&#20010;&#32477;&#23545;&#20540;&#65292;&#22312;&#25972;&#20010;&#29983;&#21629;&#21608;&#26399;&#30340;&#31890;&#23376;&#65292;&#25110;&#20316;&#20026;&#20540;&#20174;&#35268;&#27169;&#19968;&#20010;&#20854;&#20182;&#36880;&#28176;&#12290;&#35831;&#27880;&#24847;&#36825;&#37324;&#38754;&#36824;&#26377;&#19968;&#20010;&#29305;&#27530;&#30340;&#21151;&#33021;&#65292;&#20351;&#24744;&#33021;&#22815;&#35774;&#32622;&#28151;&#21512;&#31890;&#23376;&#21450;&#20854;&#21608;&#22260;&#65292;&#36825;&#26679;&#23601;&#21487;&#20197;&#27491;&#24120;&#25110;&#28155;&#21152;&#65292;&#23558;&#20570;&#20986;&#19968;&#20123;&#26790;&#24187;&#25928;&#26524;&#30340;&#21151;&#33021;&#65292;&#36825;&#20123;&#20989;&#25968;&#21253;&#25324;&#39068;&#33394;&#65292;&#36879;&#26126;&#24230;&#21644;&#28151;&#21512;&#65306;
</p><blockquote>
	<ol>
		<li><a href="part_type_color_mix.html">part_type_color_mix<br></a>
		</li><li><a href="part_type_color_rgb.html">part_type_color_rgb<br></a>
		</li><li><a href="part_type_color_hsv.html">part_type_color_hsv<br></a>
		</li><li><a href="part_type_color1.html">part_type_color1<br></a>
		</li><li><a href="part_type_color2.html">part_type_color2<br></a>
		</li><li><a href="part_type_color3.html">part_type_color3<br></a>
		</li><li><a href="part_type_alpha1.html">part_type_alpha1<br></a>
		</li><li><a href="part_type_alpha2.html">part_type_alpha2<br></a>
		</li><li><a href="part_type_alpha3.html">part_type_alpha3<br></a>
		</li><li><a href="part_type_blend.html">part_type_blend<br></a>
    	</li></ol>
</blockquote>

<p>
&#31890;&#23376;&#23384;&#22312;&#23631;&#24149;&#19978;&#30340;&#19968;&#20010;&#26377;&#38480;&#30340;&#26102;&#38388;&#20869;&#65292;&#36825;&#34987;&#31216;&#20026;&#20182;&#20204;&#30340;&#8220;&#29983;&#21629;&#21608;&#26399;&#8221;&#12290;&#31890;&#23376;&#23551;&#21629;&#26159;&#27979;&#37327;&#27493;&#65288;&#20687;&#20197;&#21069;&#19968;&#26679;&#65289;&#65292;&#36825;&#26159;&#34920;&#31034;&#20026;&#19968;&#20010;&#33539;&#22260;&#20540;&#30340;&#31890;&#23376;&#23558;&#34987;&#36171;&#20104;&#19968;&#20010;&#29305;&#23450;&#30340;&#29983;&#21629;&#21608;
&#26399;&#12290;&#20063;&#26377;&#19968;&#20123;&#26377;&#36259;&#30340;&#21151;&#33021;&#65292;&#21487;&#29992;&#20110;&#20351;&#31890;&#23376;&#20135;&#29983;&#20854;&#20182;&#31890;&#23376;&#65292;&#27599;&#19968;&#20010;&#27493;&#39588;&#25110;&#24403;&#20182;&#20204;&#8220;&#27515;&#8221;&#65288;&#21363;&#65306;&#20174;&#23631;&#24149;&#19978;&#28040;&#22833;&#65289;&#26102;&#65292;&#20294;&#36825;&#20123;&#21151;&#33021;&#24517;&#39035;&#38750;&#24120;&#23567;&#24515;&#65292;&#22240;&#20026;&#20182;&#20204;&#21487;&#20197;&#24555;&#36895;&#21019;&#24314;&#25968;
&#20197;&#21315;&#35745;&#30340;&#31890;&#23376;&#24182;&#36896;&#25104;&#28216;&#25103;&#31995;&#32479;&#23849;&#28291;&#65281;&#35774;&#32622;&#23551;&#21629;&#21644;&#27493;&#39588;&#25110;&#27515;&#20129;&#21457;&#23556;&#22120;&#30340;&#20989;&#25968;&#22914;&#19979;&#65306;
</p><blockquote>
	<ol>
		<li><a href="part_type_life.html">part_type_life<br></a>
		</li><li><a href="part_type_step.html">part_type_step<br></a>
		</li><li><a href="part_type_death.html">part_type_death<br></a>
</li></ol></blockquote>	
<p>

&#20540;&#24471;&#19968;&#25552;&#30340;&#26159;&#65292;&#21019;&#24314;&#31890;&#23376;&#36890;&#36807;&#20195;&#30721;&#24448;&#24448;&#26159;&#19968;&#20010;&#36153;&#21147;&#21644;&#32791;&#26102;&#30340;&#36807;&#31243;&#65292;&#30001;&#20110;&#22823;&#37327;&#30340;&#21442;&#25968;&#65292;&#21487;&#20197;&#25913;&#21464;&#21644;&#35843;&#25972;&#12290;&#30001;&#20110;&#36825;&#20010;&#21407;&#22240;&#65292;&#24314;&#35758;&#24744;&#22235;&#22788;&#25628;&#23547;&#65292;&#24182;&#20445;&#25345;&#26576;&#31181;&#31867;&#22411;&#30340;&#31890;&#23376;&#35774;&#35745;&#22120;&#65288;&#25110;&#33258;&#24049;&#20570;&#19968;&#20010;&#65281;&#65289;&#30340;&#31890;&#23376;&#20135;&#29983;&#30340;&#33510;&#24046;&#20107;&#12290;<br>
<br>

</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Particles</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="aaaa.html">aaa</a>
	</div>-->
</div>


<!-- KEYWORDS
-->  <!-- InstanceEndEditable -->
        </div>
        
        <nav id="menu-left">
        </nav>
        <nav id="menu-right">
        </nav>
    </div>
</body>
<!-- InstanceEnd --></html>
