<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>File Handling</title>

	
		
		<meta http-equiv="X-UA-Compatible" content="IE=9">
		<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" --><link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.css" />
<link type="text/css" rel="stylesheet" href="../../../src/css/extensions/jquery.mmenu.themes.css" />

<style type="text/css">
@media all and (min-width: 900px) {
html, body {
height: 100%

}
#menu {
background: #eee
}
#page {
border-left: 1px solid #ccc
min-height: 100%
}
}
</style>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<script type="text/javascript" src="../../../src/js/jquery.mmenu.js"></script>
<script type="text/javascript">
$(function() {
$('nav#menu').mmenu({
classes: 'mm-light'
})
})
</script>

<div id="page">
			<div id="header">
				<a href="#menu"></a>
				&#x70B9;&#x51FB;&#x5DE6;&#x8FB9;&#x6309;&#x952E;&#x6253;&#x5F00;&#x5BFC;&#x822A;&#x83DC;&#x5355;
			</div>
			<div id="content">
			
<!-- 注意：使用此库文件的页面“/body”前面必须配置mmenu_body_down.lbi 2 -->


<!-- #EndLibraryItem --><h1>File System Limits &#25991;&#20214;&#31995;&#32479;&#38480;&#21046;<br>
</h1>

<h2>&#22312;&#36825;&#37324;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;&#20449;&#24687;&#25991;&#20214;&#31995;&#32479;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#21644;&#23427;&#30340;&#38480;&#21046;&#12290;</h2>

<p>
&#24403;&#20351;&#29992;&#25991;&#20214;&#31995;&#32479;&#30340;&#20989;&#25968;&#21253;&#25324; <i>GameMaker:Studio</i> &#65292;&#36825;&#26159;&#38750;&#24120;&#37325;&#35201;&#30830;&#20999;&#22320;&#30693;&#36947;&#19968;&#20999;&#27491;&#24120;&#65292;&#20160;&#20040;&#20107;&#24773;&#20250;&#22312;&#24149;&#21518;&#12290;&#20026;&#27492;&#65292;&#26412;&#33410;&#30340;&#30446;&#30340;&#26159;&#35299;&#37322;&#21644;&#28548;&#28165;&#21040;&#24213;&#20107;&#24773;&#26159;&#22914;&#20309;&#23384;&#20648;&#30340;&#65292;&#23427;&#20204;&#23384;&#20648;&#30340;&#22320;&#26041;&#65292;&#36825;&#20010;&#31995;&#32479;&#26377;&#20160;&#20040;&#21487;&#33021;&#30340;&#38480;&#21046;&#25110;&#21464;&#36890;&#12290;<br>
<br>

</p><h3>&#27801;&#30418;</h3>
<p>
&#65288;&#26368;&#37325;&#35201;&#30340;&#65289;&#30340;&#20107;&#24773;&#35201;&#27880;&#24847;&#26377;&#20851;&#35813;&#25991;&#20214;&#30340;&#21151;&#33021;&#26159;&#65292;&#20182;&#20204;&#26159;&#26377;&#38480;&#65288;&#19968;&#33324;&#65289;&#30340;&#27801;&#31665;&#12290;&#36825;&#21477;&#35805;&#30340;&#24847;&#24605;&#26159;&#65292;<i>GameMaker:Studio</i> &#26080;&#27861;&#20445;&#23384;&#25110;&#21152;&#36733;&#25991;&#20214;&#20174;&#20219;&#20309;&#22320;&#26041;&#65292;&#26159;&#27809;&#26377;&#30340;&#28216;&#25103;&#25414;&#32465;&#25110;&#26412;&#22320;&#23384;&#20648;&#35774;&#22791;&#30340;&#19968;&#37096;&#20998;&#27809;&#26377;&#26126;&#30830;&#30340;&#20174;&#29992;&#25143;&#36755;&#20837;&#65292;&#21644;&#21363;&#20351;&#22312;&#24403;&#26102;&#36825;&#31181;&#23548;&#20837;&#26159;&#26377;&#38480;&#30340;&#21482;&#26377;Windows&#21644;Mac&#30446;&#26631;&#24179;&#21488;&#12290;<br>
<br>

&#35201;&#20102;&#35299;&#27801;&#31665;&#39318;&#20808;&#20320;&#38656;&#35201;&#20102;&#35299;&#30340;&#25991;&#20214;&#65292;&#26377;&#20004;&#20010;&#19981;&#21516;&#30340;&#39046;&#22495;&#65306;
</p><blockquote>
	<ol>
		<li><b>The File Bundle</b> - &#25991;&#20214;&#25414;&#32465; - &#36825;&#26159;&#25152;&#26377;&#30340;&#28216;&#25103;&#21487;&#25191;&#34892;&#25991;&#20214;&#65292;&#36825;&#20123;&#25991;&#20214;&#23384;&#20648;&#65292;&#21253;&#25324;&#24744;&#24050;&#32463;&#28155;&#21152;&#30340;&#25991;&#20214;&#65292;&#21253;&#25324;&#25991;&#20214;&#36164;&#28304;&#21015;&#34920;&#20174;<i>GameMaker:Studio</i>IDE&#20013;&#65288;&#36825;&#26159;&#22806;&#37096;&#25991;&#20214;&#35201;&#25171;&#21253;&#21040;&#26412;&#28216;&#25103;&#65289;&#12290; 

		</li><li><b>The Save Area</b> -&#20445;&#23384;&#21306;&#22495; - &#36825;&#26159;&#21487;&#20197;&#34987;&#23433;&#20840;&#22320;&#20889;&#20837;&#21040;&#30001;&#28216;&#25103;&#21644;&#28216;&#25103;&#65292;&#36825;&#26159;&#19968;&#20010;&#21487;&#20889;&#21306;&#22495;&#65292;&#20445;&#35777;&#35774;&#22791;&#23384;&#20648;&#30340;&#21306;&#22495;&#12290;
	</li></ol>
</blockquote>

<p>&#19979;&#22270;&#21487;&#20197;&#24110;&#21161;&#20320;&#26356;&#22909;&#30340;&#21487;&#35270;&#21270;&#36825;&#20010;&#65306;&nbsp;<img class="center" src="File_Diagram.png">

</p><p>
<i><b>NOTE : </b>&#20320;&#27704;&#36828;&#19981;&#33021;&#20889;&#20837;&#25991;&#20214;&#25414;&#32465;&#30446;&#24405;&#12290;</i><br>
<br>

</p><h3>&#20351;&#29992;&#25991;&#20214;&#20989;&#25968;</h3>
<p>
&#36825;&#20004;&#20010;&#30446;&#26631;&#21306;&#65288;&#22871;&#35013;&#30446;&#24405;&#21644;&#26412;&#22320;&#23384;&#20648;&#21306;&#22495;&#65289;&#27599;&#20010;&#30446;&#26631;&#24179;&#21488;&#19978;&#21487;&#29992;&#65292;&#20294;&#22312;&#27599;&#19968;&#20010;&#20182;&#20204;&#30340;&#24037;&#20316;&#26041;&#24335;&#30053;&#26377;&#19981;&#21516;&#12290;&#20294;&#26159; <i>GameMaker:Studio</i>&#24050;&#32463;&#25277;&#35937;&#20986;&#26469;&#20160;&#20040;&#21487;&#20197;&#21644;&#20160;&#20040;&#19981;&#33021;&#20570;&#30340;&#20027;&#35201;&#31934;&#39635;&#65292;&#20351;&#23427;&#26356;&#23481;&#26131;&#37325;&#26032;&#30446;&#26631;&#28216;&#25103;&#22810;&#20010;&#29615;&#22659;&#12290;<br>
<br>&#39318;&#20808;&#65292;&#20320;&#24212;&#35813;&#26126;&#30333;&#26159;&#20160;&#20040;&#24847;&#24605;&#24403;&#25105;&#20204;&#35848;&#35770; <a href="working_directory.html"><tt>working_directory</tt></a>&#12290;&#36825;&#26159;&#20004;&#31181;&#21487;&#33021;&#30340;&#20445;&#23384;&#20301;&#32622;&#65288;&#22914;&#19978;&#22270;&#20013;&#25152;&#31034;&#65289;&#30340;&#20195;&#21517;&#35789;&#65292;&#24403;&#24744;&#20351;&#29992;&#35813;&#30446;&#24405;&#20013;&#65292;&#23427;&#20250;&#20570;&#20004;&#20214;&#20107;&#24773;&#65292;&#36825;&#21462;&#20915;&#20110;&#24744;&#26159;&#21542;&#35835;&#21462;&#25110;&#20889;&#20837;&#65292;&#32780;&#20320;&#27491;&#22312;&#35835;&#21462;&#30340;&#25991;&#20214;&#26159;&#21542;&#24050;&#32463;&#25913;&#21464;&#19982;&#21542;
</p><blockquote>
	<ol>
		<li><b>Reading Operations</b> - &#35835;&#21462;&#25805;&#20316; - working_directory&#20250;&#20808;&#26816;&#26597;&#65292;&#30475;&#26159;&#21542;&#26377;&#34987;&#35775;&#38382;&#30340;&#25991;&#20214;&#26159;&#20445;&#23384;&#21306;&#22495;&#65292;&#22914;&#26524;&#23427;&#26159;&#34987;&#20351;&#29992;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#35813;&#25991;&#20214;&#19981;&#23384;&#22312;&#20445;&#23384;&#21306;&#22495;&#65292;&#28982;&#21518;&#26816;&#26597;&#25991;&#20214;&#25414;&#32465;&#38754;&#31215;&#21644;&#29992;&#36884;&#65288;&#22914;&#26524;&#35813;&#25991;&#20214;&#34987;&#25214;&#20320;&#30340;&#28216;&#8203;&#8203;&#25103;&#30340;&#21253;&#21547;&#25991;&#20214;&#65289;&#12290;
		
		</li><li><b>Writing Operations</b> - &#20889;&#20837;&#25805;&#20316; - &#36825;&#21482;&#33021;&#21457;&#29983;&#22312;&#20445;&#23384;&#21306;&#12290;
	</li></ol>
</blockquote>

<p>&#20351;&#29992;&#36825;&#20004;&#20010;&#31616;&#21333;&#30340;&#35268;&#21017;&#65292;&#25105;&#20204;&#29616;&#22312;&#21487;&#20197;&#30475;&#21040;&#20197;&#19979;&#20989;&#25968;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#65288;&#36825;&#20123;&#20363;&#23376;&#26469;&#24110;&#21161;&#20320;&#30340;&#36807;&#31243;&#21487;&#35270;&#21270;&#25552;&#20379;&#19981;&#21516;&#30340;&#20989;&#25968;&#65289;&#65306;
</p><blockquote>
	<ul>
		<li><a href="directory_create.html"><tt>directory_create</tt></a> &#65288;&#21644;&#20854;&#20182;&#30446;&#24405;&#30340;&#21151;&#33021;&#65289;&#23558;&#21482;&#20445;&#23384;&#24037;&#20316;&#12290;</li>
    <li><a href="File%20System/index.html">file system</a> &#20989;&#25968;&#20250;&#36820;&#22238;&#26463;&#21644;&#20445;&#23384;&#21306;&#22495;&#25991;&#20214;&#30340;&#20449;&#24687;&#65292;&#20294;&#21482;&#20250;&#20889;&#20445;&#23384;&#21306;&#22495;&#12290;
		
		</li>
<li>&#20889;&#20837;&#25991;&#26412;&#65292;&#20108;&#36827;&#21046;&#25110;ini&#25991;&#20214;&#30340;&#21151;&#33021;&#65292;&#23558;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#25991;&#20214;&#20445;&#23384;&#65292;&#22914;&#26524;&#19968;&#20010;&#24050;&#32463;&#19981;&#23384;&#22312;&#65292;&#22797;&#21046;&#19982;&#28216;&#25103;&#25414;&#32465;&#20182;&#20204;&#24212;&#35813;&#23384;&#22312;&#30340;&#21407;&#22987;&#25991;&#20214;&#30340;&#20219;&#20309;&#20449;&#24687;&#12290;
	</li></ul>
</blockquote>

<h4>&#22312;&#27801;&#31665;&#22806;&#30340;&#20445;&#23384;&#21644;&#36733;&#20837;</h4>
<p>&#22312;Windows&#24179;&#21488;&#19978;&#65292;&#26377;&#19968;&#20010;&#26041;&#27861;&#20445;&#23384;&#21644;&#21152;&#36733;&#25991;&#20214;&#30340;&#27801;&#30424;&#22806;&#65292;&#37027;&#23601;&#26159;&#20351;&#29992;&#30340;&#20989;&#25968; <a href="File%20System/get_open_filename.html"><tt>get_open_filename</tt></a> &#21644; <a href="File%20System/get_save_filename.html"><tt>get_save_filename</tt></a>&#12290;&#36825;&#20123;&#20989;&#25968;&#37117;&#35201;&#27714;&#29992;&#25143;&#36873;&#25321;&#19968;&#20010;&#21306;&#22495;&#65292;&#29992;&#20110;&#21152;&#36733;&#21644;&#20445;&#23384;&#65292;&#24182;&#36820;&#22238;&#30340;&#23383;&#31526;&#20018;&#21487;&#20197;&#34987;&#29992;&#26469;&#22312;&#20854;&#20313;&#30340;&#25991;&#20214;&#21151;&#33021;&#65292;&#32469;&#36807;&#27801;&#31665;&#12290;<br>
<br>

</p><h3>&#29305;&#23450;&#24179;&#21488;&#30340;&#20445;&#23384;/&#36733;&#20837;</h3>
<p>&#24403;<i>GameMaker:Studio</i>&#24037;&#20316;&#26102;&#65292;&#20320;&#24212;&#35813;&#30693;&#36947;&#65292;&#25945;&#30446;&#26631;&#24179;&#21488;&#37117;&#26377;&#33258;&#24049;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#21487;&#20197;&#20889;&#20837;&#21644;&#35835;&#21462;&#20445;&#23384;&#21306;&#22495;&#12290;&#19979;&#38754;&#26159;&#36825;&#20123;&#39046;&#22495;&#23545;&#27599;&#20010;&#30446;&#26631;&#30340;&#21015;&#34920;&#65306;
</p><blockquote>
	<ul>
		<li><b>Windows</b> - Windows&#30340;&#25152;&#26377;&#25991;&#20214;&#22312; <tt>%localappdata%\&lt;Game Name&gt;</tt> &#25991;&#20214;&#22841; (Windows 7 &#26159;&#22312; <tt>/Users/&lt;User Name&gt;/AppData/Local/&lt;Game Name&gt;</tt> &#25991;&#20214;&#22841;).</li><br>
		<li><b>Mac OS</b> - &#23384;&#20648;&#23558;&#21462;&#20915;&#20110;&#24212;&#29992;&#31243;&#24207;&#26159;&#21542;&#26159;&#27801;&#31665;&#25110;&#19981;&#26159;&#65288;&#33529;&#26524;&#35268;&#21017;&#65289;</li><br>
		<li><b>Ubuntu (Linux)</b> - &#25991;&#20214;&#23384;&#20648;&#22312; <tt>Home/.config/gamename</tt> &#65292; "Home" &#29992;&#25143;&#23478;&#24237;&#25991;&#20214;&#22841; - <tt>/home/&lt;username&gt;</tt>
		</li><li><b>HTML5 / Windows 8 (JS)</b> - &#19968;&#20999;&#37117;&#26159;&#36890;&#36807;&#26412;&#22320;&#23384;&#20648;</li><br>
		<li><b>iOS</b> -&nbsp; &#23384;&#20648;&#26159;&#26631;&#20934;&#30340;&#20301;&#32622;&#65288;&#22914;&#35266;&#30475;&#36890;&#36807;iTunes&#65289;&#12290;</li><br>
		<li><b>Android</b> - &#25991;&#20214;&#26159;&#22312;&#26631;&#20934;&#20301;&#32622;&#65288;&#36825;&#26159;&#19981;&#21487;&#35265;&#30340;&#65292;&#38500;&#38750;&#35813;&#35774;&#22791;&#26159;rooted&#30340;&#65289; <tt>/data/data/&lt;package name&gt;</tt>.</li><br>
		<li><b>Windows Phone</b> - &#26723;&#26696;&#26159;&#22312;&#30456;&#21516;&#30340;&#20301;&#32622;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;</li>
	</ul>
</blockquote>

<p>&#34429;&#28982;&#22312;&#19968;&#20123;&#24179;&#21488;&#19978;&#20320;&#21487;&#20197;&#20351;&#29992;&#30340;&#25991;&#20214;&#21517;&#65292;&#23427;&#33258;&#24049;&#35775;&#38382;&#21253;&#21547;&#25991;&#20214;&#65292;&#36825;&#26159;&#20540;&#24471;&#27880;&#24847;&#30340;&#65292;&#22312;&#35774;&#22791;&#65288;android&#65292;iOS&#65292;Windows
phone&#65289;&#20320;&#24517;&#39035;&#20351;&#29992;&#35775;&#38382;&#23384;&#20648;&#25991;&#20214;working_directory&#30340;&#21069;&#32512;&#65292;&#22914;&#20351;&#29992;&#27491;&#22909;&#30456;&#23545;&#36335;&#24452;&#23558;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#36824;&#20540;&#24471;&#25351;&#20986;&#30340;&#26159;HTML5&#21644;
Windows 8&#30340;&#30446;&#26631;&#27169;&#22359;&#22312;&#26412;&#22320;&#23384;&#20648;&#19978;&#26377;&#38480;&#21046;&#65288;&#21487;&#20197;&#26159;&#20171;&#20110;1MB&#21644;5MB&#21462;&#20915;&#20110;&#27983;&#35272;&#22120;&#65289;&#65292;&#36825;&#24847;&#21619;&#30528;&#20320;&#23558;&#19981;&#24471;&#20197;&#33410;&#30465;&#22823;&#37327;&#30340;&#31934;&#28789;&#65292;&#25130;&#22270;&#31561;......<br>
<br>

</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">The File System</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="../011_Data Structures/index.html">Data Structures</a>
	</div>-->
</div>


<h5>?Copyright YoYo Games Ltd. 2013 All Rights Reserved</h5><!-- KEYWORDS
file system limits
sandboxed
saving files
working_directory
saving
loading
--><!-- #BeginLibraryItem "/Library/mmenu_body_down.lbi" -->
</div>
			<nav id="menu">
				<ul>
					<li ><a href="../../../index.html">GameMaker:Studio &#x624B;&#x518C;&#x9996;&#x9875;</a></li>
					<li ><a href="../../000_Using GameMaker/index.html">GameMaker:Studio &#x4F7F;&#x7528;</a></li>
					<li ><a href="../../001_Advanced Use/index.html">Advanced Use &#x9AD8;&#x7EA7;&#x4F7F;&#x7528;</a></li>
					<li ><a href="../index.html">Reference GML&#x53C2;&#x8003;&#x624B;&#x518C;</a></li>
					<li ><a href="#">Tutorial examples and experience &#x5B9E;&#x4F8B;&#x6559;&#x7A0B;&#x53CA;&#x5FC3;&#x5F97;</a></li>
					<li ><a href="#">Experimental project &#x5B9E;&#x9A8C;&#x9879;&#x76EE;</a></li>
					<li ><a href="#">Setting &#x5E94;&#x7528;&#x8BBE;&#x7F6E;</a></li>					
				</ul>
			</nav>
</div>
<!-- 注意2 --><!-- #EndLibraryItem --></body></html>