<!doctype html>
<html><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->

<head>
    <!-- InstanceBeginEditable name="doctitle" -->
<title>Variables And Variable Scope</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />
    <link rel="stylesheet" href="../../../src/css/style.css" type="text/css" media="screen" title="style" charset="utf-8" />
    <link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.all.css" />
    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
      <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
      <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->
    <link rel="icon" type="../image/png" href="favicon.png">
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header" class="mm-fixed-top">
            <a href="#menu_left" class="menu_left" title="点击此按钮打开左侧目录菜单，右边的按钮则打开右侧菜单。"></a>GameMaker:Studio帮助手册
            <a href="#menu_right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Variables And Variable Scope &#21464;&#37327;&#19982;&#21464;&#37327;&#22495;<br>
</h1>

<h2>&#36825;&#37324;&#20320;&#33021;&#23398;&#20064;&#21040;&#22312;GameMaker:Studio&#20013;&#20851;&#20110;&#19981;&#21516;&#31867;&#22411;&#30340;&#21464;&#37327;&#12290;<br>
</h2>


<p>&#22914;&#20219;&#20309;&#32534;&#31243;&#35821;&#35328;GML&#20351;&#29992;&#21464;&#37327;&#20026;&#22823;&#22810;&#25968;&#32534;&#31243;&#25805;&#20316;&#30340;&#22522;&#26412;&#21333;&#20803;&#12290;&#21464;&#37327;&#26159;&#29992;&#26469;&#23384;&#20648;&#20449;&#24687;&#65292;&#20379;&#20197;&#21518;&#65288;&#25110;&#21363;&#26102;&#65289;&#22312;&#35774;&#22791;&#30340;&#23384;&#20648;&#22120;&#20013;&#20351;&#29992;&#65292;&#24182;&#32473;&#20182;&#20204;&#19968;&#20010;&#21517;&#31216;&#65292;&#20197;&#20415;&#24744;&#21487;&#20197;&#21442;
&#32771;&#23427;&#20204;&#30340;&#21151;&#33021;&#21644;&#31243;&#24207;&#12290;&#22312;GML&#30340;&#21464;&#37327;&#21487;&#20197;&#23384;&#20648;&#19968;&#20010;&#23454;&#25968;&#65288;&#22914;100&#65292;2.456575&#65292;-56&#31561;..&#65289;&#25110;&#19968;&#20010;&#23383;&#31526;&#20018;&#65288;&#20363;&#22914;&#8220;hello world&#65281;&#8221;&#65289;&#12290;<br>
<br>&#21464;&#37327;&#26159;&#20160;&#20040;&#65292;&#25105;&#20204;&#29992;&#23427;&#26469;&#23384;&#20648;&#22312;&#19968;&#20010;&#25110;&#22810;&#20010;&#25805;&#20316;&#25110;&#20989;&#25968;&#20351;&#29992;&#30340;&#20540; &#12290;&#24819;&#21040;&#8220;PI&#8221;&#65292;&#20363;&#22914;...
&#23427;&#26159;&#19968;&#20010;&#30495;&#27491;&#30340;&#19990;&#30028;&#30340;&#21464;&#37327;&#20445;&#23384;&#20540;&#26159;3.14159265&#65288;&#31561;..&#65289;&#12290;&#20026;&#20160;&#20040;&#21602;&#65311;&#21999;&#65292;&#35828;&#8220;PI&#8221;&#27604;&#8220;&#19977;&#28857;&#19968;&#22235;&#19968;5 9 2 6
5&#8221;&#23481;&#26131;&#65281;&#22240;&#27492;&#65292;&#21629;&#21517;&#30340;&#19996;&#35199;&#35753;&#29983;&#27963;&#26356;&#31616;&#21333;&#20102;&#24456;&#22810;&#65292;&#36825;&#20063;&#24847;&#21619;&#30528;&#65292;&#21464;&#37327;&#24212;&#35813;&#26159;&#19981;&#26029;&#21464;&#21270;&#30340;&#20540;&#65292;&#25105;&#20204;&#26080;&#39035;&#25913;&#21464;&#26080;&#22788;&#19981;&#22312;&#30340;&#21464;&#37327;&#21517;&#65292;&#23427;&#20173;&#28982;&#26159;&#30456;&#21516;&#30340;&#12290;&#22312;GML&#20013;&#65292;&#19968;&#20010;
&#21464;&#37327;&#30340;&#21517;&#31216;&#24517;&#39035;&#20197;&#23383;&#27597;&#24320;&#22836;&#65292;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#65292;&#25968;&#23383;&#21644;&#19979;&#21010;&#32447;'_'&#65292;&#26368;&#22823;&#38271;&#24230;&#20026;64&#20010;&#31526;&#21495;&#12290;&#22240;&#27492;&#65292;&#26377;&#25928;&#30340;&#21464;&#37327;&#26159;&#22914;<tt>fish</tt>&#65292;<tt>foo_bar<span style="font-family: Verdana,Helvetica,Arial,sans-serif;">&#65292;</span></tt> <tt>num1<span style="font-family: Verdana,Helvetica,Arial,sans-serif;">&#65292;</span></tt>&#21644;&#26080;&#25928;&#30340;&#21464;&#37327;<tt>&#31867;&#20284;6fish</tt>, 
<tt>foo bar</tt>, &#25110; <tt>*num</tt>.&#12290;&#29616;&#22312;&#65292;&#22312;&#35768;&#22810;&#32534;&#31243;&#35821;&#35328;&#65292;&#20320;&#38656;&#35201;&#8220;&#22768;&#26126;&#8221;&#21464;&#37327;&#65292;&#28982;&#21518;&#25165;&#33021;&#20351;&#29992;&#23427;&#12290;&#36825;&#22522;&#26412;&#19978;&#24847;&#21619;&#30528;&#65292;&#20320;&#21578;&#35785;&#35745;&#31639;&#26426;&#20320;&#24819;&#20351;&#29992;&#21517;&#23383;&#65292;&#22240;&#27492;&#65292;&#23427;&#22312;&#20869;&#23384;&#20013;&#25351;&#23450;&#19968;&#22359;&#22320;&#26041;&#23384;&#20648;&#20219;&#20309;&#20320;&#20915;&#23450;&#20445;&#23384;&#21040;&#35813;&#21464;&#37327;&#30340;&#20540;&#12290;&#38543;&#30528;GML&#65292;&#24182;&#19981;&#24635;&#26159;&#24517;&#39035;&#30340;&#65292;&#22240;&#20026;&#23427;&#20381;&#36182;&#20110;&#35813;&#21464;&#37327;&#30340;&#33539;&#22260;&#12290;&#24403;&#20320;&#30340;&#31243;&#24207;&#26159;<i>GameMaker:Studio</i>&#30340;&#26102;&#26377;&#22235;&#20010;&#20027;&#35201;&#30340;&#21464;&#37327;&#65292;&#27599;&#19968;&#20010;&#26377;&#20182;&#33258;&#24049;&#30340;&#33539;&#22260;&#65288;&#36825;&#21487;&#20197;&#34987;&#35270;&#20026;&#20854;&#36816;&#31639;&#33539;&#22260;&#65292;&#25110;&#24310;&#20280;&#65289;&#12290;&#36825;&#20123;&#21464;&#37327;&#21644;&#23427;&#20204;&#30340;&#33539;&#22260;&#27010;&#36848;&#22914;&#19979;&#65306; <br>
<br>

</p><blockquote>
	<ul>
		<li><span style="font-weight: bold;">&#23454;&#20363;</span> : &#36825;&#26159;&#26368;&#24120;&#35265;&#30340;&#21464;&#37327;&#65292;&#24182;&#19988;&#22312;&#19968;&#20010;&#23454;&#20363;&#20013;&#25152;&#23450;&#20041;&#12290;&#36825;&#20123;&#21040;&#35813;&#23454;&#20363;&#26159;&#21807;&#19968;&#30340;&#65292;&#24182;&#21487;&#20197;&#22312;&#35813;&#23454;&#20363;&#30340;&#20219;&#20309;&#20107;&#20214;&#21644;&#21151;&#33021;&#20013;&#20351;&#29992;&#12290;<br><br></li>
		
		<li><b>&#23616;&#37096;</b> : &#36825;&#20123;&#21464;&#37327;&#24517;&#39035;&#20351;&#29992;&#30340;&#8220;var&#8221;&#20989;&#25968;&#22768;&#26126;&#12290;&#23616;&#37096;&#21464;&#37327;&#26159;&#20165;&#22312;&#21019;&#24314;&#23427;&#30340;&#20107;&#20214;&#25110;&#33050;&#26412;&#36164;&#28304;&#20013;&#26377;&#25928;&#12290;&#25152;&#20197;<i>GameMaker:Studio</i> &#23558;&#21019;&#24314;&#21464;&#37327;&#65292;&#22312;&#20107;&#20214;&#20013;&#25345;&#32493;&#20351;&#29992;&#23427;&#65292;&#28982;&#21518;&#20877;&#8220;&#24536;&#35760;&#8221;&#23427;&#65292;&#36825;&#24847;&#21619;&#30528;&#65292;&#22914;&#26524;&#20320;&#23581;&#35797;&#22312;&#23427;&#22833;&#25928;&#21518;&#20351;&#29992;&#23427;&#65292;&#20320;&#20250;&#24471;&#21040;&#19968;&#20010;&#8220;&#26410;&#30693;&#21464;&#37327;&#8221;&#30340;&#38169;&#35823;&#12290;<br> <br></li>
		
		<li><b>&#20840;&#23616;</b> : &#19968;&#20010;&#20840;&#23616;&#21464;&#37327;&#26159;&#23646;&#20110;&#28216;&#25103;&#19990;&#30028;&#26412;&#36523;&#65292;&#32780;&#19981;&#26159;&#20219;&#20309;&#19968;&#20010;&#23454;&#20363;&#12290;&#23427;&#24517;&#39035;&#39318;&#20808;&#34987;&#22768;&#26126;&#20026;&#20840;&#23616;&#65292;&#20294;&#20043;&#21518;&#30340;&#20219;&#20309;&#23454;&#20363;&#21487;&#20197;&#26597;&#30475;&#25110;&#25913;&#21464;&#35813;&#21464;&#37327;&#30340;&#20540;&#65292;&#35813;&#20540;&#23558;&#24635;&#26159;&#21453;&#26144;&#20102;&#19978;&#19968;&#27425;&#30340;&#25805;&#20316;&#65292;&#19981;&#31649;&#20160;&#20040;&#23454;&#20363;&#25110;&#20195;&#30721;&#26694;&#20013;&#37117;&#33021;&#25191;&#34892;&#25805;&#20316;&#12290;<br><br></li>
		
		<li><b>&#20869;&#32622;&#21464;&#37327;</b>:&nbsp; &#36825;&#20123;&#26159;&#29305;&#27530;&#30340;&#21464;&#37327;&#8220;&#20869;&#32622;&#8221;&#22312;&#28216;&#25103;&#19990;&#30028;&#20013;&#30340;&#23545;&#35937;&#21644;&#25151;&#38388;&#65292;&#20182;&#20204;&#21487;&#20197;&#26159;&#23454;&#20363;&#21807;&#19968;&#25110;&#20840;&#23616;&#33539;&#22260;&#20869;&#30340;&#65288;&#20294;&#32477;&#19981;&#26159;&#23616;&#37096;&#30340;&#65289;&#12290;<br></li>

	</ul>
</blockquote>

<p>&#22312;&#20197;&#19979;&#39029;&#38754;
&#21487;&#20197;&#21457;&#29616;&#36825;&#20123;&#21464;&#37327;&#31867;&#22411;&#26356;&#22810;&#30340;&#32454;&#33410;&#65306; <br>
<br>

</p><blockquote>
	<ol>
		<li><a href="Instance%20Variables.html">Instance Variables &#23454;&#20363;&#21464;&#37327;</a><br>
		</li><li><a href="Local%20Variables.html">Local Variables &#23616;&#37096;&#21464;&#37327;</a><br>
		</li><li><a href="Global%20Variables.html">Global Variables &#20840;&#23616;&#21464;&#37327;</a><br>
	</li></ol>
</blockquote>

<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">GML Overview</a>
	</div>
	<div style="float: right;">
		Next : <a href="../401_05_addressing.html">Addressing Variables in Other Instances</a>
	</div>
</div>


<!-- KEYWORDS
variables
declaring variables
scope
-->  <!-- InstanceEndEditable -->
        </div>
        
        <div id="page_popup">
            <div class="popup ">
                <div>
                    <a href="#page" class="close">x</a>
                    <div>
                        <h4>喵~</h4>
                        <p>欢迎，这里是404号猫国皇室会所~~</p>
                        <p>因为找不到其它的地方，你来到了这里。</p>
                    </div>

                </div>

            </div>
        </div>
        <div id="page_fullscreen">

            <div class="panel ">
                <div>
                    <a href="#page" class="close">x</a>
                    <div>
                        <h4>喵~</h4>
                        <p>欢迎，这里是404号猫国皇室会所~~</p>
                        <p>因为找不到其它的地方，你来到了这里。</p>
                    </div>

                </div>

            </div>
        </div>

        <div id="page_mmenu">
            <nav id="menu_left">
            </nav>
            <nav id="menu_right">
            </nav>
        </div>

        <!-- KEYWORDS
        pages
        -->
    </div>
    <script type="text/javascript" src="src/js/bootstrap.min.js"></script>
    <script type="text/javascript" src="../../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../../src/js/subpage.js"></script>

</body>

<!-- InstanceEnd --></html>