<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->

<head>
    <!-- InstanceBeginEditable name="doctitle" -->
        <title>Steam API</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9">
    <link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8">
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />
    <link type="text/css" rel="stylesheet" href="../../src/css/jquery.mmenu.all.css" />
    <script type="text/javascript" src="../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../src/js/hammer.min.js"></script>
    <script type="text/javascript" src="../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../src/js/subpage.js"></script>
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
    
    <script >
    $(document).ready(function () {
	    //	The menu on the left

    $(function () {
        //左菜单加载mmenu_left.html    
        $('nav#menu-left').load("../subpage/mmenu_left.html", function () {
            //应用mmeunu
            var $menu = $('nav#menu-left');
            $menu.mmenu({
                position: 'left',
                classes: 'mm-black',
                dragOpen: true,
                counters: true,
                searchfield: true,
                labels: {
                    fixed: !$.mmenu.support.touch
                }
            });  
            
            // for one page

            var $html = $('html, body');
            //$menu.mmenu();
            $menu.find('li a').on(
                'click',
                function () {
                    var href = $(this).attr('href');
                    //	if the clicked link is linked to an anchor, scroll the page to that anchor 
                    if (href.slice(0, 1) == '#') {
                        $menu.one(
                            'closed.mm',
                            function () {
                                setTimeout(
                                    function () {
                                        $html.animate({
                                            scrollTop: $(href).offset().top
                                        });
                                    }, 10
                                );
                            });
                    };
                });
        });

    });

    //	The menu on the right
    $(function () {
        //右菜单加载mmenu_right.html
        $('nav#menu-right').load("../subpage/mmenu_right.html", function () {
            //alert("11111");
            var $menu = $('nav#menu-right');
            $menu.mmenu({
                position: 'right',
                classes: 'mm-black',
                dragOpen: true,
                counters: true,
                searchfield: true,
                labels: {
                    fixed: !$.mmenu.support.touch
                }
            });
        });     
    });
	})
    </script>
    
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header">
            <a href="#menu-left"></a>
            <!-- InstanceBeginEditable name="EditRegion_pagetitle" -->点击左边图标打开菜单<!-- InstanceEndEditable -->
            <a href="#menu-right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Steam API &#24212;&#29992;&#31243;&#24207;&#25509;&#21475;<br>
</h1>

<h2>&#26412;&#33410;&#35828;&#26126; Steam API&#30456;&#20851;&#30340;&#20989;&#25968;&#12290;</h2>


<p>&#26412;&#33410;&#26159;&#20026;&#24050;&#34987;Steam API &#20801;&#35768;&#20320;&#28216;&#25103;&#21457;&#24067;&#21040;&#35813;&#24179;&#21488;&#30340;&#36825;&#20123;&#29992;&#25143;&#12290;&#20026;&#20102;&#33021;&#22815;&#20351;&#29992;&#36825;&#20123;&#20989;&#25968;&#65292;&#24744;&#24517;&#39035;&#24050;&#34987;steam&#35768;&#21487;&#65292;&#36890;&#36807;&#19968;&#20010;&#20986;&#29256;&#21830;&#25110;&#36890;&#36807;&#23457;&#25209;&#21046;&#24230;&#65292;&#24182;&#27491;&#30830;&#35774;&#32622; <a href="../../001_Advanced%20Use/Preferences/Steam%20preferences.html">Steam Preferences</a> &#21644; <a href="../../001_Advanced%20Use/Global%20game%20settings/Steam%20Tab.html">Steam Global Game Settings</a> &#12290;<br>
<br>

</p><h3>&#26816;&#26597;Steam&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;</h3>
<p>
&#19979;&#38754;&#30340;&#19968;&#32452;&#20989;&#25968;&#37117;&#26816;&#26597;&#26576;&#20123;&#26041;&#38754;&#30340;Steam&#23458;&#25143;&#31471;&#25110;&#26381;&#21153;&#22120;API&#30340;&#21487;&#29992;&#24615;&#65292;&#24182;&#21462;&#20915;&#20110;&#26381;&#21153;&#22120;&#30340;&#22240;&#32032;&#36820;&#22238;true&#25110;false&#65292;&#22914;&#21344;&#32447;&#25110;&#29992;&#25143;&#22312;&#30331;&#24405;&#31561;..&#36825;&#24847;&#21619;&#30528;&#65292;&#36825;&#20123;&#20989;&#25968;&#24212;&#35813;&#29992;&#20110;&#20219;&#20309;&#20854;&#23427;&#20989;&#25968;&#20043;&#21069;&#35843;&#29992;&#65292;&#20197;&#30830;&#20445;&#20320;&#30340;&#28216;&#25103;&#23458;&#25143;&#31471;/&#26381;&#21153;&#22120;&#30340;&#35774;&#32622;&#26159;&#27491;&#30830;&#30340;&#65306;
</p><blockquote>
	<ol>
		<li><a href="steam_initialised.html">steam_initialised</a><br>
		</li><li><a href="steam_stats_ready.html">steam_stats_ready</a><br>		
		</li><li><a href="steam_is_overlay_enabled.html">steam_is_overlay_enabled</a><br>		
		</li><li><a href="steam_get_persona_name.html">steam_get_persona_name</a><br>
		</li><li><a href="steam_get_user_steam_id.html">steam_get_user_steam_id</a><br>
		</li><li><a href="steam_is_user_logged_on.html">steam_is_user_logged_on</a><br>		
	</li></ol>
</blockquote>
		
<h3>Steam &#35206;&#30422;</h3>
<p>&#22312;Steam&#21472;&#21152;&#24102;&#26469;&#30340;&#26174;&#31034;&#21151;&#33021;&#65292;&#33021;&#26174;&#31034;&#22312;Steam&#25509;&#21475;&#25552;&#20379;&#32473;&#29992;&#25143;&#30340;&#35270;&#35273;&#12290;&#36825;&#36890;&#24120;&#26159;&#30001;&#29992;&#25143;&#33258;&#24049;&#20351;&#29992;&#30340;&#32452;&#21512;&#38190;&#65292;&#20294;&#20320;&#20063;&#26377;&#21487;&#33021;&#20570;&#36825;&#20214;&#20107;&#20174;&#20320;&#30340;&#28216;&#25103;&#20869;&#65292;&#36825;&#26679;&#21487;&#20197;&#26144;&#23556;&#19968;&#20010;&#25353;&#38062;&#25110;&#20107;&#20214;&#26174;&#31034;&#21472;&#21152;&#65292;&#20351;&#29992;&#20197;&#19979;&#21151;&#33021;&#65306;
</p><blockquote>
	<ol>
		<li><a href="steam_activate_overlay.html">steam_activate_overlay</a><br>
		</li><li><a href="steam_is_overlay_activated.html">steam_is_overlay_activated</a><br>
	</li></ol>
</blockquote>

<h3>&#25490;&#34892;&#27036;</h3>
<p>Steam
API&#25903;&#25345;&#25345;&#20037;&#25490;&#34892;&#27036;&#33258;&#21160;&#26377;&#24207;&#30340;&#26465;&#30446;&#12290;&#36825;&#20123;&#25490;&#34892;&#27036;&#21487;&#20197;&#29992;&#26469;&#26174;&#31034;&#20840;&#23616;&#21644;&#26379;&#21451;&#30340;&#25490;&#34892;&#27036;&#22312;&#20320;&#30340;&#28216;&#25103;&#20320;&#30340;&#28216;&#25103;&#31038;&#21306;&#32593;&#39029;&#19978;&#12290;&#27599;&#22330;&#27604;&#36187;&#21487;&#20197;&#26377;&#22810;&#36798;10,000&#25490;&#34892;&#27036;&#65292;
&#27599;&#20010;&#25490;&#34892;&#27036;&#21487;&#20197;&#34987;&#26816;&#32034;&#31435;&#21363;&#21518;&#19968;&#20010;&#29699;&#21592;&#30340;&#24471;&#20998;&#24050;&#32463;&#34987;&#25554;&#20837;&#21040;&#23427;&#65292;&#20294;&#27880;&#24847;&#65292;&#27599;&#20010;&#25490;&#34892;&#27036;&#65292;&#29609;&#23478;&#21487;&#20197;&#26377;&#21482;&#26377;&#19968;&#20010;&#20837;&#21475;&#65292;&#34429;&#28982;&#25968;&#37327;&#27809;&#26377;&#38480;&#21046;&#65292;&#29609;&#23478;&#27599;&#25490;&#34892;&#27036;&#12290;<br>
<br>

&#27599;&#20010;&#25490;&#34892;&#27036;&#26465;&#30446;&#21253;&#21547;&#19968;&#20010;&#21517;&#31216;&#20026;&#25490;&#34892;&#27036;&#65292;&#24471;&#20998;&#21644;&#25490;&#21517;&#65292;&#36825;&#25968;&#25454;&#23558;&#34987;&#26367;&#25442;&#20026;&#29992;&#25143;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#25490;&#34892;&#27036;&#26465;&#30446;&#26102;&#65292;&#21487;&#20197;&#20351;&#29992;&#20197;&#19979;&#20989;&#25968;&#28155;&#21152;&#21644;&#26816;&#32034;&#36825;&#20123;&#25968;&#25454;&#24418;&#25104;&#25490;&#34892;&#27036;&#24744;&#30340;&#28216;&#25103;&#65306;
</p><blockquote>
	<ol>		
		<li><a href="steam_create_leaderboard.html">steam_create_leaderboard</a><br>
		</li><li><a href="steam_upload_score.html">steam_upload_score</a><br>
		</li><li><a href="steam_download_scores.html">steam_download_scores</a><br>
		</li><li><a href="steam_download_scores_around_user.html">steam_download_scores_around_user</a><br>
		</li><li><a href="steam_download_friends_scores.html">steam_download_friends_scores</a><br>
	</li></ol>
</blockquote>

<h3>&#25104;&#23601;&#19982;&#32479;&#35745;</h3>
<p>
Steam&#30340;&#32479;&#35745;&#25968;&#25454;&#21644;&#25104;&#23601;&#30340;API&#25552;&#20379;&#25345;&#20037;&#24615;&#65292;&#28459;&#28216;&#30340;&#25104;&#23601;&#21644;&#32479;&#35745;&#36319;&#36394;&#20026;&#24744;&#30340;&#29992;&#25143;&#25552;&#20379;&#19968;&#20010;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#20026;&#24744;&#30340;&#28216;&#25103;&#12290;&#29992;&#25143;&#30340;&#25968;&#25454;&#19982;&#33258;&#24049;&#30340;Steam&#24080;&#21495;&#65292;&#27599;&#20010;&#29992;&#25143;&#25152;&#21462;&#24471;&#30340;&#25104;&#23601;&#21644;&#32479;&#35745;&#25968;&#25454;&#21487;&#20197;&#26684;&#24335;&#21270;&#24182;&#26174;&#31034;&#22312;&#20182;&#20204;&#30340;Steam&#31038;&#21306;&#31616;&#20171;&#12290;<br>
<br>

&#38500;&#20102;&#25552;&#20379;&#39640;&#20215;&#20540;&#30340;&#22870;&#21169;&#20320;&#30340;&#28216;&#25103;&#30340;&#29609;&#23478;&#65292;&#25104;&#23601;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#40723;&#21169;&#21644;&#22870;&#21169;&#30340;&#22242;&#38431;&#31934;&#31070;&#21644;&#29609;&#23478;&#20114;&#21160;&#65292;&#28216;&#25103;&#30446;&#26631;&#25552;&#20379;&#39069;&#22806;&#30340;&#32500;&#24230;&#65292;&#29992;&#25143;&#33457;&#26356;&#22810;&#30340;&#26102;&#38388;&#22312;&#28216;&#25103;&#20013;&#22870;&#21169;&#65292;&#24182;&#22240;&#27492;&#23427;&#26159;&#24314;&#35758;&#20320;&#30340;&#28216;&#25103;&#30340;&#26377;&#20960;&#20010;&#12290;&#20182;&#20204;&#24456;&#23481;&#26131;&#20174;Steam&#20202;&#34920;&#26495;&#65292;&#20294;&#20250;&#35201;&#27714;&#20320;&#20026;&#20182;&#20204;&#21019;&#36896;&#29305;&#27530;&#30340;&#22270;&#26631;&#12290;<br>
<br>&#32479;&#35745;&#36319;&#36394;&#32454;&#31890;&#24230;&#26465;&#20449;&#24687;&#65292;&#22914;&#25773;&#25918;&#26102;&#38388;&#65292;&#25968;&#23383;&#30005;&#28304;ups&#20351;&#29992;&#65292;&#31561;&#20320;&#21487;&#20197;&#36873;&#25321;&#20351;&#29992;&#23427;&#20204;&#21482;&#26159;&#20026;&#20102;&#36319;&#36394;&#20869;&#37096;&#28216;&#25103;&#25968;&#25454; -
&#36825;&#26679;&#19968;&#26469;&#65292;&#20363;&#22914;&#65292;&#24744;&#21487;&#20197;&#25480;&#20104;&#30340;&#25104;&#23601;&#30340;&#22522;&#30784;&#19978;&#22810;&#22312;&#22810;&#21488;&#35745;&#31639;&#26426;&#19978;&#30340;&#29992;&#25143;&#20250;&#35805;&#30340;&#28216;&#25103;&#25910;&#38598;&#30340;&#32479;&#35745;&#20449;&#24687;&#12290;&#25110;&#32773;&#65292;&#20320;&#21487;&#20197;&#36319;&#36394;&#26377;&#36259;&#30340;&#28216;&#25103;&#25968;&#25454;&#26174;&#31034;&#65292;&#22312;&#29992;&#25143;&#30340;Steam&#31038;
&#21306;&#39029;&#38754;&#65292;&#29992;&#25143;&#21487;&#20197;&#22312;&#33258;&#24049;&#30340;&#32479;&#35745;&#27604;&#36739;&#65292;&#23545;&#20182;&#20204;&#30340;&#26379;&#21451;&#12290;<br>
<br>

&#19977;&#31181;&#31867;&#22411;&#65292;&#25972;&#25968;&#65292;&#28014;&#28857;&#25968;&#21644;&#24179;&#22343;&#32479;&#35745;&#65292; <i>GameMaker:Studio</i>&#20801;&#35768;&#24744;&#20462;&#25913;&#27599;&#19968;&#20010;&#20174;&#20320;&#30340;&#28216;&#25103;&#65292;&#20294;&#20182;&#20204;&#24212;&#35813;&#24050;&#32463;&#34987;&#21021;&#22987;&#21270;&#20102;Steamworks&#20320;&#30340;&#28216;&#25103;&#25511;&#21046;&#12290;<br>
<br>

</p><blockquote>
	<i><b>NOTE:</b> &#24744;&#24517;&#39035;&#31561;&#24453;&#65292;&#30452;&#21040;&#36820;&#22238; <a href="steam_stats_ready.html"><tt>steam_stats_ready</tt></a> &#20026;&#30495;&#65292;&#28982;&#21518;&#20877;&#23581;&#35797;&#35835;&#21462;&#25110;&#20889;&#20837;&#32479;&#35745;&#25968;&#25454;&#21644;&#25104;&#23601;&#12290;</i>
</blockquote>

<p>
<br>&#19979;&#38754;&#20960;&#39029;&#20013;&#25551;&#36848;&#30340;&#20989;&#25968;&#65292;&#36827;&#19968;&#27493;&#30340;&#32454;&#33410;&#21644;&#35828;&#26126;&#65292;&#22914;&#20309;&#20351;&#29992;&#32479;&#35745;&#25968;&#25454;&#21644;&#25104;&#26524;&#65292;&#21487;&#20197;&#21457;&#29616;&#65306;<br>


</p><blockquote>
	<ol>
		<li><a href="steam_set_achievement.html">steam_set_achievement</a><br>
		</li><li><a href="steam_get_achievement.html">steam_get_achievement</a><br>
		</li><li><a href="steam_clear_achievement.html">steam_clear_achievement</a><br>
		</li><li><a href="steam_set_stat_int.html">steam_set_stat_int</a><br>
		</li><li><a href="steam_set_stat_float.html">steam_set_stat_float</a><br>
		</li><li><a href="steam_set_stat_avg_rate.html">steam_set_stat_avg_rate</a><br>
		</li><li><a href="steam_get_stat_int.html">steam_get_stat_int</a><br>
		</li><li><a href="steam_get_stat_float.html">steam_get_stat_float</a><br>
		</li><li><a href="steam_get_stat_avg_rate.html">steam_get_stat_avg_rate</a><br>
		</li><li><a href="steam_reset_all_stats.html">steam_reset_all_stats</a><br>
		</li><li><a href="steam_reset_all_stats_achievements.html">steam_reset_all_stats_achievements</a><br>
	</li></ol>
</blockquote>
<p>&#22914;&#26524;&#29992;&#25143;&#22312;&#31163;&#32447;&#27169;&#24335;&#19979;&#65292;steam&#19981;&#26029;&#20351;API&#21487;&#20197;&#27491;&#24120;&#20351;&#29992;&#30340;&#32479;&#35745;&#21644;&#25104;&#32489;&#25968;&#25454;&#30340;&#26412;&#22320;&#32531;&#23384;&#12290;&#26080;&#27861;&#25552;&#20132;&#20219;&#20309;&#32479;&#35745;&#25968;&#25454;&#37117;&#20445;&#23384;&#20026;&#19979;&#19968;&#27425;&#29992;&#25143;&#22312;&#32447;&#12290;&#20107;&#20214;&#24050;&#32463;&#26377;
&#36229;&#36807;&#19968;&#21488;&#26426;&#22120;&#19978;&#30340;&#20462;&#25913;&#65292;steam&#20250;&#33258;&#21160;&#21512;&#24182;&#21462;&#24471;&#30340;&#25104;&#23601;&#21644;&#36873;&#25321;&#30340;&#19968;&#32452;&#32479;&#35745;&#25968;&#25454;&#65292;&#26377;&#26356;&#22810;&#30340;&#36827;&#23637;&#12290;&#22240;&#20026;&#33976;&#27773;&#20445;&#25345;&#32479;&#35745;&#25968;&#25454;&#30340;&#26412;&#22320;&#32531;&#23384;&#65292;&#23427;&#26159;&#27809;&#26377;&#24517;&#35201;&#30340;&#65292;&#23545;&#20110;&#28216;&#25103;
&#20063;&#20445;&#30041;&#30913;&#30424;&#19978;&#30340;&#25968;&#25454;&#30340;&#26412;&#22320;&#32531;&#23384;&#65292;&#23588;&#20854;&#26159;&#24403;&#36825;&#31181;&#32531;&#23384;&#24448;&#24448;&#22312;&#20914;&#31361;&#20013;&#21644;&#24403;&#20182;&#20204;&#36825;&#26679;&#20570;&#65292;&#23427;&#30475;&#36215;&#26469;&#20223;&#20315;&#19968;&#20010;&#29992;&#25143;&#33258;&#24049;&#30340;&#36827;&#27493;&#26377;&#24050;&#32463;&#22238;&#24402;&#20102;&#65292;&#36825;&#26159;&#19968;&#20010;&#20196;&#20154;&#27822;&#20007;&#30340;&#32463;&#39564;&#12290;<br>
<br>

</p><h3>&#20113;&#20989;&#25968;</h3>
<p>&#20113;steam &#20320;&#30340;&#28216;&#25103;&#25552;&#20379;&#20102;&#19968;&#20010;&#31616;&#21333;&#21644;&#36879;&#26126;&#30340;&#36828;&#31243;&#25991;&#20214;&#23384;&#20648;&#31995;&#32479;&#12290;&#25152;&#26377;&#25991;&#20214;&#20889;&#20837;&#21040;&#30913;&#30424;&#20351;&#29992;<i>GameMaker:Studio</i>&#30340;&#21151;&#33021;&#23558;&#34987;&#22797;&#21046;&#21040;&#26381;&#21153;&#22120;&#65292;&#22312;&#27604;&#36187;&#32467;&#26463;&#21518;&#36864;&#20986;steam&#12290;&#28982;&#21518;&#65292;&#22914;&#26524;&#29992;&#25143;&#25913;&#21464;&#20102;&#30005;&#33041;&#65292;&#25991;&#20214;&#23558;&#34987;&#19979;&#36733;&#21040;&#26032;&#30340;&#30005;&#33041;&#28216;&#25103;&#25512;&#20986;&#20043;&#21069;&#65292;&#36825;&#24847;&#21619;&#30528;&#35813;&#28216;&#25103;&#23601;&#21487;&#20197;&#35775;&#38382;&#25991;&#20214;&#65292;&#36890;&#36807;&#20351;&#29992;&#36866;&#24403;&#30340;&#20989;&#25968;&#35835;&#21462;&#20182;&#20204;&#12290; Steam&#23458;&#25143;&#31471;&#20570;&#30340;&#24037;&#20316;&#65292;&#30830;&#20445;&#22312;&#25152;&#26377;&#35745;&#31639;&#26426;&#29992;&#25143;&#21487;&#33021;&#35775;&#38382;&#30340;&#25991;&#20214;&#20445;&#25345;&#21516;&#27493;&#12290;<br>
<br>

</p><blockquote>
	<i><b>NOTE: </b>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20113;&#19981;&#33021;&#29992;&#20110;&#22312;</i><i>Steamworks&#19978;&#30340;&#28216;&#25103;&#65292;&#23427;&#24517;&#39035;&#26159;&#25552;&#21069;&#26469;&#33267;</i><i>Steamworks&#28216;&#25103;&#31649;&#29702;&#21592;&#30340;&#8220;&#20113;&#8221;&#39029;&#38754;</i><i> &#65292;&#22312;&#39029;&#38754;&#19978;&#20320;&#24212;&#35813;&#35774;&#32622;&#23383;&#33410;&#21644;&#39029;&#38754;&#37197;&#39069;&#12290;&#19979;&#27425;&#20320;&#21457;&#24067;&#20320;&#30340;&#28216;&#25103;&#21040;Steamworks&#30340;&#37197;&#32622;&#65292;&#20934;&#22791;&#20351;&#29992;&#20113;&#23384;&#20648;&#12290;</i>
</blockquote>
	
<p>
<br>&#20197;&#19979;&#20989;&#25968;&#21487;&#29992;&#20110;&#20174; <i>GameMaker:Studio&#35775;&#38382;</i>Steam Cloud from
</p><blockquote>
	<ol>
		<li><a href="steam_is_cloud_enabled_for_app.html">steam_is_cloud_enabled_for_app</a><br>
		</li><li><a href="steam_is_cloud_enabled_for_account.html">steam_is_cloud_enabled_for_account</a><br>
		</li><li><a href="steam_get_quota_total.html">steam_get_quota_total</a><br>
		</li><li><a href="steam_get_quota_free.html">steam_get_quota_free</a><br>
		</li><li><a href="steam_file_exists.html">steam_file_exists</a><br>
		</li><li><a href="steam_file_size.html">steam_file_size</a><br>
		</li><li><a href="steam_file_persisted.html">steam_file_persisted</a><br>
		</li><li><a href="steam_file_write.html">steam_file_write</a><br>
		</li><li><a href="steam_file_write_file.html">steam_file_write_file</a><br>
		</li><li><a href="steam_file_read.html">steam_file_read</a><br>
		</li><li><a href="steam_file_share.html">steam_file_share</a><br>
		</li><li><a href="steam_file_delete.html">steam_file_delete</a><br>
	</li></ol>
</blockquote>

<h3>&#29992;&#25143;&#20869;&#23481;</h3>
<p>Steam API&#38598;&#25104;&#22312;<i>GameMaker:Studio</i> &#20801;&#35768;&#26576;&#20123;&#29992;&#25143;&#29983;&#25104;&#20869;&#23481;&#30340;&#20849;&#20139;&#12290;&#24744;&#21487;&#20197;&#20026;&#20320;&#30340;&#28216;&#25103;&#20351;&#29992;&#36825;&#20123;&#20849;&#20139;&#25991;&#20214;&#20026;&#21040;<i>Steam Workshop</i>&#65292;&#21644;&#23631;&#24149;&#25130;&#22270;&#21040;&#29992;&#25143;&#25991;&#20214;&#22841;&#12290;
</p><blockquote>
	<ol>
		<li><a href="steam_publish_workshop_file.html">steam_publish_workshop_file</a><br>
		</li><li><a href="steam_is_screenshot_requested.html">steam_is_screenshot_requested</a><br>
		</li><li><a href="steam_send_screenshot.html">steam_send_screenshot</a><br>
	</li></ol>
</blockquote>

<h3>DLC</h3>
<p>
Steam
&#25903;&#25345;&#20813;&#36153;&#21644;&#20184;&#36153;&#19979;&#36733;&#20869;&#23481;&#65288;DLC&#65289;&#65292;Steam&#23458;&#25143;&#31471;&#65292;&#28216;&#25103;&#20869;&#23481;&#19979;&#36733;&#20316;&#20026;&#19968;&#20010;&#21333;&#19968;&#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#29992;&#25143;&#30340;&#28216;&#25103;&#21015;&#34920;&#65292;&#36890;&#36807;&#28216;&#25103;&#23646;&#24615;&#23545;&#35805;&#26694;&#26597;&#30475;&#19979;&#36733;&#20869;&#23481;&#20986;&#29616;&#12290;&#19968;&#26086;
&#25317;&#26377;&#65292;&#34987;&#35270;&#20026;&#26412;&#28216;&#25103;&#30340;&#19968;&#20010;&#32452;&#25104;&#37096;&#20998;&#21644;Steam&#19979;&#36733;&#30340;&#20869;&#23481;&#20250;&#33258;&#21160;&#26356;&#26032;&#19968;&#20010;&#34917;&#19969;&#21644;&#23433;&#35013;&#30340;&#20869;&#23481;&#65292;&#24403;&#29992;&#25143;&#23433;&#35013;&#30340;&#28216;&#25103;&#30340;&#20869;&#23481;&#26102;&#12290;<br>
<br>

&#30001;&#20110;&#36825;&#26159;&#25152;&#26377;&#22788;&#29702;&#30001;Steam&#26381;&#21153;&#22120;&#21644;&#20219;&#20309;DLC&#30340;&#37197;&#32622;&#26159;&#36890;&#36807;&#20102;Steamworks&#25511;&#21046;&#38754;&#26495;&#65292;&#25152;&#20197;&#21482;&#26377;&#19968;&#20123;&#24517;&#35201;&#30340;&#20989;&#25968;&#65292;&#22312;<i>GameMaker:Studio</i>&#26816;&#26597;&#36825;&#20010;&#39069;&#22806;&#30340;&#20869;&#23481;&#65306;
</p><blockquote>
	<ol>		
		<li><a href="steam_user_owns_dlc.html">steam_user_owns_dlc</a><br>
		</li><li><a href="steam_user_installed_dlc.html">steam_user_installed_dlc</a><br>
	</li></ol>
</blockquote>

		
<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Contents</a>
	</div>
</div>
<p></p>

<h5>?Copyright YoYo Games Ltd. 2013 All Rights Reserved</h5><!-- KEYWORDS
Steam API
Steam functions
Steam Cloud
Steam API
Steam Achievements
Steam Statistics
Steam User Content
Steam DLC
Steam Overlay
-->  <!-- InstanceEndEditable -->
        </div>
        
        <nav id="menu-left">
        </nav>
        <nav id="menu-right">
        </nav>
    </div>
</body>

<!-- InstanceEnd --></html>
