<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><!-- InstanceBegin template="/Templates/GMS_helppage.dwt" codeOutsideHTMLIsLocked="false" -->

<head>
    <!-- InstanceBeginEditable name="doctitle" -->
<title>Particle Systems</title>
<!-- InstanceEndEditable -->
    <meta http-equiv="X-UA-Compatible" content="IE=9" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=2.0 user-scalable=yes" />    
    <link rel="stylesheet" href="../../../src/css/style.css" type="text/css" media="screen" title="style" charset="utf-8" />
    <link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.all.css" />
    <link rel="stylesheet" href="../../../src/css/zebra_tooltips.css" type="text/css">
    <link rel="icon" type="../image/png" href="favicon.png">
    
    <!-- InstanceParam name="OptionalRegion_footer" type="boolean" value="false" -->
    <!-- InstanceParam name="OptionalRegion_pagefull" type="boolean" value="false" -->
    <!-- InstanceParam name="OptionalRegion_mmenutip" type="boolean" value="false" -->
</head>

<body bgcolor="#FFFFFF">
    <div id="page">
        <div id="header">
           <a href="#menu-left" class="mmenu-left tooltips" title="点击此按钮打开左侧目录菜单，右边的按钮则打开右侧菜单。"></a>
            <!-- InstanceBeginEditable name="EditRegion_pagetitle" -->点击左边图标打开菜单<!-- InstanceEndEditable -->
            <a href="#menu-right" class="friends right"></a>
        </div>
        <div id="content">
            <!-- InstanceBeginEditable name="EditRegion_content" -->
<h1>Particle Systems &#31890;&#23376;&#31995;&#32479;<br>
</h1>

<h2>&#26412;&#33410;&#28041;&#21450;&#24314;&#31435;&#65292;&#32500;&#25252;&#21644;&#38144;&#27585;&#31890;&#23376;&#31995;&#32479;&#12290;</h2>

<p>&#21019;&#24314;&#31890;&#23376;&#20043;&#21069;&#65292;&#20320;&#38656;&#35201;&#21019;&#24314;&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;&#12290;&#36825;&#26159;&#19968;&#20010;&#8220;&#23481;&#22120;&#8221;&#65292;&#20320;&#23558;&#21487;&#20197;&#25918;&#20837;&#20320;&#20934;&#22791;&#20351;&#29992;&#30340;&#12289;&#30340;&#31890;&#23376;&#21644;&#21457;&#23556;&#22120;&#65288;&#22914;&#26524;&#38656;&#35201;&#30340;&#35805;&#65289;&#65292;&#20320;&#35748;&#20026;&#26377;&#24517;&#35201;&#65292;&#20320;&#21487;&#20197;&#25226;&#23613;
&#21487;&#33021;&#22810;&#25110;&#23613;&#21487;&#33021;&#23569;&#30340;&#31890;&#23376;&#36827;&#20837;&#20219;&#20309;&#19968;&#20010;&#31995;&#32479;&#65292;&#20320;&#21487;&#20197;&#26377;&#24456;&#22810;&#30340;&#31995;&#32479;&#65292;&#20320;&#35748;&#20026;&#26377;&#24517;&#35201;&#30340;&#31995;&#32479;&#12290;&#28982;&#32780;&#65292;&#23427;&#22987;&#32456;&#26159;&#26356;&#22909;&#22320;&#20445;&#25345;&#23613;&#21487;&#33021;&#23567;&#30340;&#20107;&#23454;&#65292;&#27599;&#20010;&#31995;&#32479;&#65292;&#21457;&#23556;&#22120;&#21644;&#31890;&#23376;&#37117;
&#35201;&#21344;&#29992;&#30340;&#20869;&#23384;&#65292;&#20351;&#29992;&#22826;&#22810;&#21487;&#33021;&#20250;&#20943;&#24930;&#20320;&#30340;&#28216;&#25103;&#65292;&#25110;&#23548;&#33268;&#38382;&#39064;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#38656;&#35201;&#19968;&#20123;&#25928;&#26524;&#20986;&#29616;&#23454;&#20363;&#19978;&#38754;&#65292;&#20854;&#20182;&#25928;&#26524;&#20986;&#29616;&#22312;&#23454;&#20363;&#19979;&#38754;&#65292;&#24744;&#23558;&#21019;&#24314;&#20004;&#20010;&#31995;&#32479;&#65292;&#24182;&#35774;&#32622;&#23427;&#20204;
&#30340;&#28145;&#24230;&#65292;&#20197;&#33719;&#24471;&#25152;&#38656;&#30340;&#25928;&#26524;&#65292;&#25152;&#26377;&#30340;&#31890;&#23376;&#28155;&#21152;&#21040;&#27599;&#20010;&#31995;&#32479;&#30340;&#28145;&#24230;&#32472;&#21046;&#25353;&#24744;&#25152;&#25351;&#23450;&#12290; <br>
<br>

</p><h3>&#31995;&#32479;&#20989;&#25968;</h3>
<p>
&#30001;&#20110;&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;&#26159;&#19968;&#20010;&#21160;&#24577;&#21019;&#24314;&#30340;&#36164;&#28304;&#65292;&#20320;&#24517;&#39035;&#21019;&#24314;&#24182;&#23384;&#20648;&#22312;&#19968;&#20010;&#21464;&#37327;&#26469;&#24341;&#29992;&#65292;&#22312;&#20197;&#21518;&#25152;&#26377;&#30340;&#20989;&#25968;&#35843;&#29992;&#31995;&#32479;&#24182;&#36820;&#22238;&#30340;&#32034;&#24341;&#65292;&#23427;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292;&#22312;&#20320;&#19981;&#20877;&#38656;&#35201;&#23558;&#38144;&#27585;
&#31995;&#32479;&#26102;&#65292;&#21542;&#21017;&#20320;&#23558;&#26377;&#19968;&#20010;&#20869;&#23384;&#27844;&#28431;&#65292;&#36825;&#23558;&#20351;&#24471;&#31243;&#24207;&#20943;&#32531;&#19979;&#26469;&#65292;&#24182;&#26368;&#32456;&#23548;&#33268;&#28216;&#25103;&#23849;&#28291;&#12290;&#36824;&#20540;&#24471;&#25351;&#20986;&#30340;&#26159;&#31890;&#23376;&#31995;&#32479;&#65292;&#22312;&#24314;&#31435;&#21518;&#23558;&#27704;&#36828;&#23384;&#22312;&#65292;&#21363;&#20351;&#19981;&#20877;&#34987;&#23384;&#20648;&#22312;&#32034;&#24341;&#12290;&#25152;
&#20197;&#65292;&#21363;&#20351;&#20320;&#25913;&#21464;&#25151;&#38388;&#25110;&#37325;&#26032;&#21551;&#21160;&#28216;&#25103;&#65292;&#31995;&#32479;&#21644;&#31890;&#23376;&#20381;&#28982;&#23384;&#22312;&#65292;&#32780;&#19988;&#26159;&#21487;&#35265;&#30340;&#65292;&#22312;&#25152;&#26377;&#36827;&#19968;&#27493;&#30340;&#25151;&#38388;&#65292;&#25152;&#20197;&#20320;&#26368;&#22909;&#30830;&#20445;&#20320;&#38144;&#27585;&#20182;&#20204;&#65292;&#19968;&#26086;&#20320;&#19981;&#20877;&#38656;&#35201;&#23427;&#20204;&#12290;<br>
<br> &#35774;&#31435;&#19968;&#20010;&#31890;&#23376;&#30340;&#22522;&#26412;&#21151;&#33021;&#31995;&#32479;&#21015;&#20986;&#22914;&#19979;&#65306;
</p><blockquote>
	<ol>
  		<li><a href="part_system_exists.html">part_system_exists<br></a>
  		</li><li><a href="part_system_create.html">part_system_create<br></a>
  		</li><li><a href="part_system_clear.html">part_system_clear<br></a>
  		</li><li><a href="part_system_depth.html">part_system_depth<br></a>
  		</li><li><a href="part_system_position.html">part_system_position<br></a>
  		</li><li><a href="part_system_destroy.html">part_system_destroy<br></a>
  		</li><li><a href="part_particles_clear.html">part_particles_clear<br></a>
  		</li><li><a href="part_particles_count.html">part_particles_count<br></a>
	</li></ol>
</blockquote>

<h3>&#31890;&#23376;&#31995;&#32479;&#32472;&#21046;</h3>
<p>
&#19968;&#26086;&#31890;&#23376;&#34987;&#28155;&#21152;&#21040;&#19968;&#20010;&#31890;&#23376;&#31995;&#32479;&#65292;&#28982;&#21518;&#29190;&#21457;&#25110;&#27969;&#29983;&#25104;&#36827;&#20837;&#25151;&#38388;&#65292;&#20182;&#20204;&#36890;&#24120;&#20250;&#33258;&#21160;&#26356;&#26032;&#27599;&#19968;&#20010;&#27493;&#39588;&#65292;&#24182;&#21046;&#23450;&#26681;&#25454;&#24744;&#29992;&#26469;&#23450;&#20041;&#23427;&#20204;&#30340;&#21442;&#25968;&#12290;&#28982;&#32780;&#23427;&#26377;&#26102;&#21487;&#20197;&#26159;&#20309;&#26102;&#20197;&#21450;&#22914;&#20309;&#31995;&#32479;&#26356;&#26032;&#65292;&#20197;&#21450;&#22914;&#20309;&#31995;&#32479;&#24212;&#21046;&#23450;&#24517;&#35201;&#30340;&#25511;&#21046;&#65292;&#24182;&#19988; <i>GameMaker:Studio</i>&#25552;&#20379;&#20102;&#20197;&#19979;&#30340;&#21151;&#33021;&#65306;
</p><blockquote>
	<ol>
  		<li><a href="part_system_automatic_update.html">part_system_automatic_update<br></a>
  		</li><li><a href="part_system_automatic_draw.html">part_system_automatic_draw<br></a>
  		</li><li><a href="part_system_update.html">part_system_update<br></a>
  		</li><li><a href="part_system_drawit.html">part_system_drawit<br></a>
  		</li><li><a href="part_system_draw_order.html">part_system_draw_order<br></a>
	</li></ol>
</blockquote>

<h3>&#30452;&#25509;&#21019;&#36896;&#31890;&#23376;</h3>
<p><span style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36); display: inline ! important; float: none;">&#36890;&#24120;&#20320;&#20250;&#20351;&#29992;</span> <a href="../Particle%20Emitters/index.html">particle emitters</a> <span style="color: rgb(238, 238, 238); font-family: Verdana,Helvetica,Arial,sans-serif; font-size: 12px; font-style: normal; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; background-color: rgb(36, 36, 36); display: inline ! important; float: none;">&#29190;&#35010;&#25110;&#27969;&#29983;&#25104;&#31890;&#23376;&#21040;&#19968;&#20010;&#22320;&#21306;&#65292;&#20294;&#22312;&#35768;&#22810;&#24773;&#20917;&#19979;&#65292;&#36825;&#26159;&#27809;&#26377;&#24517;&#35201;&#30340;&#65292;&#23427;&#23454;&#38469;&#19978;&#27604;&#21018;&#25165;&#21019;&#24314;&#30340;&#31890;&#23376;&#26356;&#22909;&#30340;&#26041;&#24335;&#26159;&#30452;&#25509;&#20351;&#29992;&#19979;&#38754;&#30340;&#20989;&#25968;&#65306;</span>
</p><p>
</p><blockquote>
	<ol>
  		<li><a href="part_particles_create.html">part_particles_create<br></a>
  		</li><li><a href="part_particles_create_color.html">part_particles_create_color<br></a>
	</li></ol>
</blockquote>

<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="../index.html">Particles</a>
	</div>
	<!--<div style="float:right">
		Next : <a href="Setting_Up_GM.html">  </a>
	</div>-->
</div>


<!-- KEYWORDS
-->  <!-- InstanceEndEditable -->
        </div>
        
        <nav id="menu-left" >
        </nav>
        <nav id="menu-right" >
        </nav>
        
        
        <!-- KEYWORDS
        pages
        -->
    </div>
    
    <script type="text/javascript" src="../../../src/js/jquery.min.js"></script>
    <script type="text/javascript" src="../../../src/js/zebra_tooltips.js"></script>
    <script type="text/javascript" src="../../../src/js/hammer.min.js"></script>
    <script type="text/javascript" src="../../../src/js/jquery.mmenu.min.all_old.js"></script>
    <script type="text/javascript" src="../../../src/js/subpage_.js"></script>
    
</body>

<!-- InstanceEnd --></html>