<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Addressing Variables in Other Instances</title>



	
	<meta http-equiv="X-UA-Compatible" content="IE=9">
	<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" --><link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.css" />
<link type="text/css" rel="stylesheet" href="../../../src/css/extensions/jquery.mmenu.themes.css" />

<style type="text/css">
@media all and (min-width: 900px) {
html, body {
height: 100%

}
#menu {
background: #eee
}
#page {
border-left: 1px solid #ccc
min-height: 100%
}
}
</style>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<script type="text/javascript" src="../../../src/js/jquery.mmenu.js"></script>
<script type="text/javascript">
$(function() {
$('nav#menu').mmenu({
classes: 'mm-light'
})
})
</script>

<div id="page">
			<div id="header">
				<a href="#menu"></a>
				&#x70B9;&#x51FB;&#x5DE6;&#x8FB9;&#x6309;&#x952E;&#x6253;&#x5F00;&#x5BFC;&#x822A;&#x83DC;&#x5355;
			</div>
			<div id="content">
			
<!-- 注意：使用此库文件的页面“/body”前面必须配置mmenu_body_down.lbi 2 -->


<!-- #EndLibraryItem --><h1>Addressing Variables in Other Instances &#23547;&#22336;&#21464;&#37327;&#22312;&#20854;&#20182;&#23454;&#20363;&#20013;<br>
</h1>

<h2>&#22312;&#36825;&#37324;&#20320;&#21487;&#20197;&#25214;&#21040;&#21508;&#31181;&#26041;&#27861;&#26469;&#35299;&#20915;&#21464;&#37327;&#22312;&#20854;&#20182;&#23454;&#20363;&#12290;&#12290;</h2>

<p>&#26412;&#31456;&#22522;&#20110; <a href="Variables/index.html">variables</a>
&#65292;&#24744;&#21487;&#22312;&#37027;&#31456;&#20013;&#25214;&#21040;&#22914;&#20309;&#21019;&#36896;&#21644;&#20351;&#29992;&#21464;&#37327;&#22312;&#21333;&#29420;&#30340;&#23454;&#20363;&#20013;&#65292;&#25110;&#32773;&#20351;&#29992;&#20840;&#23616;&#21464;&#37327;&#65292;&#20294;&#26159;&#22914;&#26524;&#24744;&#24819;&#35753;&#19968;&#20010;&#23454;&#20363;&#20013;&#21464;&#37327;&#20256;&#21040;&#21478;&#22806;&#19968;&#20010;&#23454;&#20363;&#65292;&#23601;&#19981;&#21516;&#20102;&#65311;&#24456;&#22810;&#26102;&#20505;&#24744;&#20250;&#24819;&#36825;&#26679;
&#20570;&#65292;&#20363;&#22914;&#23376;&#24377;&#30896;&#25758;&#65292;&#24744;&#20250;&#25214;&#20986;&#30896;&#25758;&#21040;&#21738;&#31181;&#23376;&#24377;&#30340;&#20260;&#23475;&#65292;&#25110;&#32773;&#24744;&#24819;&#20572;&#27490;&#31227;&#21160;&#25152;&#26377;&#30340;&#29699;&#26469;&#24605;&#32771;&#65292;&#25110;&#32773;&#24744;&#24819;&#31227;&#21160;&#20027;&#35282;&#21040;&#19968;&#20010;&#29305;&#23450;&#20301;&#32622;&#65292;&#25110;&#32773;&#20854;&#20182;&#24744;&#28216;&#25103;&#20013;&#30340;&#29305;&#23450;&#24773;&#20917;&#12290;&#24198;&#24184;
&#30340;&#26159;GML&#24050;&#32463;&#20855;&#22791;&#36825;&#31181;&#26426;&#21046;&#26469;&#23454;&#29616;&#36825;&#31181;&#24773;&#20917;&#65306;<br>
<br>

</p><h3>Using a point "."</h3>
<p>&#19968;&#31181;&#24120;&#35265;&#35775;&#38382;&#25110;&#25913;&#21464;&#30340;&#21464;&#37327;&#22312;&#21478;&#22806;&#19968;&#20010;&#23454;&#20363;&#20013;&#30340;&#29992;&#27861;&#26159;&#29992;&#23545;&#35937;&#21517;&#21518;&#21152;&#19978; "." &#12290;&#20363;&#23376;&#22914;&#19979;&#65306;<br>
<br>
</p><p class="code">
obj_ball.speed = 0;<br>
</p>

<p>
<br>&#22914;&#19978;&#20195;&#30721;&#24744;&#35774;&#23450;&#36895;&#24230;&#21040;&#20840;&#37096;"obj_ball"&#30340;&#23454;&#20363;&#65292;&#22240;&#27492;&#36825;&#31181;&#26041;&#27861;&#20351;&#20320;&#33021;&#25913;&#21464;&#29305;&#23450;&#23545;&#35937;&#30340;&#20840;&#37096;&#23454;&#20363;&#65292;&#20294;&#26159;&#24744;&#22914;&#26524;&#21482;&#24819;&#35774;&#23450;&#36895;&#24230;&#21040;&#19968;&#20010;&#21333;&#29420;&#30340;&#29699;&#65292;&#32780;&#19981;&#26159;&#25152;&#26377;&#29699;&#65311;&#36825;&#30475;&#36215;&#26469;&#20250;&#26356;&#26377;&#38590;&#24230;&#65292;&#20294;&#26159;&#35268;&#21017;&#36824;&#26159;&#19968;&#26679;&#65292;&#21482;&#26159;&#25226;&#23545;&#35937;&#21517;&#25442;&#25104;&#29305;&#23450;&#30340;&#23454;&#20363;&#21517;&#65292;&#25105;&#20204;&#23558;&#20351;&#29992;&#21040; 
<b>instance id </b>&#22312;GMS&#20013;&#22788;&#29702;&#21333;&#29420;&#23454;&#20363;&#12290;<br>
<br>&#27599;&#20010;&#23454;&#20363;&#22312;&#28216;&#25103;&#20013;&#34987;&#21019;&#36896;&#26102;&#37117;&#20250;&#33719;&#24471;&#19968;&#20010; <b>instance id</b> &#65292;&#24403;&#24744;&#25226;&#23454;&#20363;&#25918;&#20837;&#25151;&#38388;&#22312;&#25151;&#38388;&#32534;&#36753;&#22120;&#20013;&#65292;&#40736;&#26631;&#25351;&#21040;&#36825;&#20010;&#23454;&#20363;&#65292;&#23454;&#20363;&#30340;id&#20250;&#26174;&#31034;&#22312;&#31383;&#21475;&#19979;&#26041;&#65292;&#20294;&#26159;&#22914;&#26524;&#24744;&#36890;&#36807;&#20195;&#30721;&#21019;&#36896;&#30340;&#23454;&#20363;&#20063;&#20250;&#26377;&#19968;&#20010;&#29420;&#19968;&#26080;&#20108;&#30340;id&#12290;&#36825;&#20010;&#25968;&#20540;&#24635;&#26159;&#22823;&#20110;&#25110;&#31561;&#20110;100000&#65292;&#20687;&#36825;&#26679;&#30340;&#25968;&#20540;&#21487;&#20197;&#20351;&#29992;&#22312;&#28857;&#31526;&#21495;&#30340;&#24038;&#36793;&#12290; <i><b>Note :&#36825;&#20123;&#25968;&#20540;&#21518;&#38754;&#36319;&#28857;&#20250;&#34987;&#29702;&#35299;&#20026;&#23567;&#25968;&#28857;&#65292;&#35201;&#36991;&#20813;&#36825;&#31181;&#24773;&#20917;&#35831;&#20351;&#29992;&#25324;&#21495;&#65281; </b></i><br>
<br>&#20363;&#23376;&#22914;&#19979;:
<br>
<br>

</p>
<p class="code">
(100012).speed = 0;<br>
</p>
<p>
<br>&#26368;&#21518;&#65292;&#24744;&#33021;&#20351;&#29992;&#29305;&#27530;&#30340;&#20851;&#38190;&#20540;&#25110;&#32773;&#20854;&#20182;&#23454;&#20363;&#20013;&#23427;&#20204;&#33258;&#24049;&#30340;id&#12290;&#22312;GMS&#20851;&#38190;&#20540;&#26159;&#19968;&#31181;&#29305;&#27530;&#31867;&#22411;&#30340;&#21464;&#37327;&#65292;&#35782;&#21035;&#21644;&#35299;&#37322;&#37117;&#26377;&#29305;&#21035;&#30340;&#26041;&#24335;&#12290;&#23384;&#22312;&#30340;&#20851;&#38190;&#20540;&#22914;&#19979;&#65306;

</p><div class="compat">
<table>
	<tbody><tr><th>Keyword</th><th>Description</th></tr>

	<tr><td>self</td>
	<td>&#25191;&#34892;&#35813;&#20195;&#30721;&#30340;&#24403;&#21069;&#23454;&#20363;&#12290;</td><td><br>
</td></tr>
	
	<tr class="alt"><td>other</td>
	<td>&#20854;&#20182;&#23454;&#20363;&#21253;&#25324;&#22312;&#30896;&#25758;&#20107;&#20214; &#25110;&#36890;&#36807; <a href="401_18_with.html"><tt>with</tt></a> &#20989;&#25968;&#24471;&#21040;&#30340;&#20854;&#20182;&#23454;&#20363;&#12290;</td></tr>

	<tr><td>all</td>
	<td>&#25151;&#38388;&#20013;&#20840;&#37096;&#27963;&#21160;&#30340;&#23454;&#20363;&#12290;</td></tr>
	
	<tr class="alt"><td>noone</td>
	<td>&#22312;&#20840;&#37096;&#20013;&#27809;&#26377;&#30340;&#23454;&#20363;&#65288;&#36825;&#24863;&#35273;&#24456;&#35809;&#24322;&#65292;&#20294;&#26159;&#20320;&#23558;&#22312;&#35828;&#26126;&#20070;&#20854;&#20182;&#37096;&#20998;&#30475;&#21040;&#23427;&#30340;&#29992;&#22788;&#65289;</td></tr>		
</tbody></table>
</div>

<p>
<br>&#20851;&#20110;&#20351;&#29992;&#21464;&#37327;&#65292;&#19968;&#20010;&#31616;&#31572;&#30340;&#24773;&#20917;&#26159;<b>instance id </b>&#22312;&#25191;&#34892;&#20195;&#30721;&#21069;&#20351;&#29992;&#65292;&#20363;&#23376;&#22914;&#19979;...<br>
<br>&#20351;&#29992;&#20851;&#38190;&#20540;&#21435;&#35774;&#23450;&#20840;&#37096;&#23454;&#20363;:
<br>
<br>
</p><p class="code">
if instance_position(mouse_x, mouse_y, all) = noone<br>
&nbsp;&nbsp;&nbsp;{<br>
&nbsp;&nbsp;&nbsp;all.speed = 0;<br>
&nbsp;&nbsp;&nbsp;}<br>
</p>
<p>
<br>

&#20351;&#29992;&#21464;&#37327;&#35774;&#23450;&#21333;&#29420;&#23454;&#20363; :
<br>
<br>
</p><p class="code">
var nnn;<br>
nnn = instance_create(100, 100, obj_ball);<br>
nnn.speed = 8;<br>
nnn.direction = random(360);<br>
</p>
<p>
<br>&#36825;&#20123;&#37117;&#26159;&#26377;&#25928;&#30340;&#35835;&#21462;&#65292;&#25913;&#21464;&#21644;&#35774;&#23450;&#20854;&#20182;&#23454;&#20363;&#20013;&#21464;&#37327;&#30340;&#26041;&#27861;&#65292;&#22240;&#20026;&#28857;&#20165;&#26159;&#19968;&#20010;&#25805;&#20316;&#31526;&#12290;
&#23427;&#38656;&#35201;&#19968;&#20010;&#20540;&#20316;&#20026;&#24038;&#25805;&#20316;&#25968;&#21644;&#19968;&#20010;&#21464;&#37327;(&#22320;&#22336;)&#65292;&#21491;&#25805;&#20316;&#25968;&#21516;&#26679;&#65292;&#24182;&#36820;&#22238;&#22320;&#22336;&#30340;&#36825;&#20010;&#29305;&#23450;&#30340;&#21464;&#37327;&#25351;&#23450;&#30340;&#23545;&#35937;&#25110;&#23454;&#20363;&#12290;&#25152;&#26377;&#30340;&#23545;&#35937;&#21517;&#31216;,&#29305;&#27530;&#23545;&#35937;&#34920;&#31034;&#20197;&#19978;&#20165;&#20165;&#20195;&#34920;
&#20540;,&#36825;&#20123;&#21487;&#20197;&#22788;&#29702;&#31867;&#20284;&#30340;&#20219;&#20309;&#20854;&#20182;&#20540;&#12290;&#23545;&#35937;&#21517;&#31216;,&#29305;&#27530;&#30340;&#20851;&#38190;&#23383;,&#21644;&#23454;&#20363;id&#20063;&#21487;&#20197;&#29992;&#20110;&#35768;&#22810;&#20854;&#20182;&#21151;&#33021;,&#22240;&#20026;&#23427;&#20204;&#23454;&#38469;&#19978;&#22312;&#31243;&#24207;&#32534;&#20889;&#26102;&#26159;&#35270;&#20026;&#24120;&#37327;&#12290;<br>
<br>

</p><h3>Using "other"</h3>
<p><b>other </b>&#29305;&#27530;&#30340;&#20851;&#38190;&#23383;&#26377;&#20004;&#20010;&#19981;&#21516;&#30340;&#26041;&#27861;,&#23427;&#21487;&#20197;&#29992;&#26469;&#24341;&#29992;&#19968;&#20010;&#29305;&#23450;&#30340;&#23454;&#20363;: &#24403;&#20351;&#29992; <tt><b>with</b></tt> &#20989;&#25968; (&#35299;&#37322;&#35831;&#28857; <a href="401_18_with.html">here</a>) 
&#25110;&#32773;&#20351;&#29992;&#22312; <a href="../../000_Using%20GameMaker/Events/Collision%20Event.html">collision event</a>, &#26412;&#31456;&#33410;&#23558;&#35299;&#37322;.
<br>
<br>&#19968;&#20010;&#30896;&#25758;&#20107;&#20214;&#21482;&#33021;&#21457;&#29983;&#22312;&#20004;&#20010;&#23454;&#20363;&#20013;&#12290;&#24403;&#28982;,&#20320;&#21487;&#20197;&#26377;&#22810;&#20010;&#23454;&#20363;&#20043;&#38388;&#30340;&#22810;&#20010;&#30896;&#25758;&#65292;&#20294;&#20182;&#20204;&#37117;&#26159;&#22522;&#20110;&#35299;&#20915;&#20004;&#20010;&#20043;&#38388;&#30340;&#22522;&#30784;&#19978;&#65292;&#23454;&#20363;&#30340;&#30896;&#25758;&#20107;&#20214;&#21644;&#8220;<b>other</b>&#8221;&#23454;&#20363;&#30456;&#20851;&#30340;&#12290;&#25152;&#20197;&#20551;&#35774;&#20320;&#26377;&#19968;&#20010;&#35282;&#33394;&#23545;&#35937;,&#25932;&#20154;&#23545;&#35937;&#21644;&#23376;&#24377;&#23545;&#35937;&#65292;&#25932;&#20154;&#21487;&#20197;&#23545;&#20320;&#24320;&#28779;&#12290;&#20320;&#21487;&#20197;&#25351;&#23450;&#27599;&#20010;&#25932;&#20154;&#19968;&#39063;&#23376;&#24377;&#65292;&#20294;&#24403;&#21019;&#24314;&#26102;&#19981;&#21516;&#30340;&#20260;&#23475;&#38543;&#26426;&#20998;&#37197;&#65292;&#20363;&#23376;&#22914;&#19979;&#65306;<br>
<br>

</p>
<p class="code">
var nnn;<br>
nnn = instance_create(x, y, obj_Bullet);<br>
nnn.damage = 5 + irandom(5);<br>
nnn.speed = 8;<br>
nnn.direction = point_direction(x, y, obj_Player.x, obj_Player.y);<br>
</p>
<p>
<br>&#30475;&#21040;&#25105;&#20204;&#22914;&#20309;&#20351;&#29992;&#28857;&#31526;&#21495;&#35774;&#32622;&#23427;&#30340;&#21464;&#37327;&#26041;&#27861;&#20102;&#21527;&#65311;&#20294;&#26159;&#35282;&#33394;&#23545;&#35937;?&#23427;&#23558;&#22914;&#20309;&#26816;&#27979;&#21040;&#20260;&#23475;&#65311;&#26159;&#36890;&#36807;&#20351;&#29992; <b>other </b>&#22312;&#30896;&#25758;&#20107;&#20214;&#65292;&#36825;&#26159;&#24403;&#28982;!<br>
<br>
</p><p class="code">
hp -= other.damage;<br>
if hp &lt;= 0 instance_destroy();<br>
</p>
<p>
<br>&#19978;&#38754;&#30340;&#20195;&#30721;&#23558;&#20250;&#25187;&#38500;&#23384;&#20648;&#30340;&#20540;&#65292;&#22312;&#20854;&#20182;&#23454;&#20363;&#8220;damage&#8221;&#21464;&#37327;&#20256;&#21040;&#29609;&#23478;&#8220;hp&#8221;&#21464;&#37327;&#65292;&#28982;&#21518;&#26816;&#26597;&#8220;hp&#8221;&#26159;&#21542;&#20302;&#20110;&#25110;&#31561;&#20110;0&#12290;&#22914;&#26524;&#23427;&#26159;&#37027;&#20040;&#30772;&#22351;&#35282;&#33394;&#23545;&#35937;&#12290;&#35831;&#27880;&#24847; <b>other </b>&#36825;&#31181;&#20351;&#29992;&#26041;&#24335;&#21482;&#33021;&#22312;&#30896;&#25758;&#20107;&#20214;&#21644;&#20854;&#20182;&#30340;&#23454;&#20363;&#21464;&#37327;&#24517;&#39035;&#33021;&#34987;&#26816;&#26597;&#65292;&#21542;&#21017;&#20250;&#25243;&#20986;&#19968;&#20010;&#38169;&#35823;&#12290;&#20294;&#26159;&#20320;&#21487;&#20197;&#20026;&#21464;&#37327;&#36171;&#20540;&#65292;&#29978;&#33267;&#21019;&#36896;&#20986;&#26032;&#30340;&#24819;&#27861;,&#20687;&#20351;&#29992; <b>other </b>&#30340;&#30896;&#25758;&#20107;&#20214;&#36825;&#26679;&#65306;
<br>
<br>
</p><p class="code">
other.mana += 10; //add ten to the other instance "mana" variable<br>
other.hit = true; //set the other instance variable "hit" to true, ceating it if the variable doesn't already exist<br>
</p>

<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">GML Overview</a>
	</div>
	<div style="float: right;">
		Next : <a href="401_06_arrays.html">Arrays</a>
	</div>
</div>


<!-- KEYWORDS
self
other
all
noone
instance id
--><!-- #BeginLibraryItem "/Library/mmenu_body_down.lbi" -->
</div>
			<nav id="menu">
				<ul>
					<li ><a href="../../../index.html">GameMaker:Studio &#x624B;&#x518C;&#x9996;&#x9875;</a></li>
					<li ><a href="../../000_Using GameMaker/index.html">GameMaker:Studio &#x4F7F;&#x7528;</a></li>
					<li ><a href="../../001_Advanced Use/index.html">Advanced Use &#x9AD8;&#x7EA7;&#x4F7F;&#x7528;</a></li>
					<li ><a href="../index.html">Reference GML&#x53C2;&#x8003;&#x624B;&#x518C;</a></li>
					<li ><a href="#">Tutorial examples and experience &#x5B9E;&#x4F8B;&#x6559;&#x7A0B;&#x53CA;&#x5FC3;&#x5F97;</a></li>
					<li ><a href="#">Experimental project &#x5B9E;&#x9A8C;&#x9879;&#x76EE;</a></li>
					<li ><a href="#">Setting &#x5E94;&#x7528;&#x8BBE;&#x7F6E;</a></li>					
				</ul>
			</nav>
</div>
<!-- 注意2 --><!-- #EndLibraryItem --></body></html>