<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>What Is A Vector?</title>

	
		
		<meta http-equiv="X-UA-Compatible" content="IE=9">
		<link rel="stylesheet" href="../../../style.css" type="text/css" media="screen" title="style" charset="utf-8"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" --><link type="text/css" rel="stylesheet" href="../../../../src/css/jquery.mmenu.css" />
<link type="text/css" rel="stylesheet" href="../../../../src/css/extensions/jquery.mmenu.themes.css" />

<style type="text/css">
@media all and (min-width: 900px) {
html, body {
height: 100%;

}
#menu {
background: #eee;
}
#page {
border-left: 1px solid #ccc;
min-height: 100%;
}
}
</style>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<script type="text/javascript" src="../../../../src/js/jquery.mmenu.js"></script>
<script type="text/javascript">
$(function() {
$('nav#menu').mmenu({
classes: 'mm-light'
});
});
</script>

<div id="page">
			<div id="header">
				<a href="#menu"></a>
				点击左边按键打开导航菜单
			</div>
			<div id="content">
			
<!-- 注意：使用此库文件的页面“/body”前面必须配置mmenu_body_down.lbi 2 -->


<!-- #EndLibraryItem --><h1>What Is A Vector? &#20160;&#20040;&#26159;&#30690;&#37327;&#65311;</h1>

<h2>&#26412;&#31456;&#33410;&#35299;&#37322;&#20160;&#20040;&#26159;&#19968;&#20010;&#30690;&#37327;&#12290;</h2>

<p>
&#20219;&#20309;&#22797;&#26434;&#30340;&#28216;&#25103;&#22312;&#26576;&#20123;&#26102;&#20505;&#65292;&#20320;&#37117;&#21487;&#33021;&#20250;&#22788;&#29702;&#30690;&#37327;&#12290;&#23427;&#20204;&#34987;&#29992;&#26469;&#22312;&#29289;&#29702;&#65292;AI&#65292;&#19977;&#35282;&#25968;&#23398;&#21644;&#35768;&#22810;&#20854;&#20182;&#24773;&#20917;&#19979;&#65292;&#20294;&#19968;&#20010;&#30690;&#37327;&#26159;&#20160;&#20040;&#65311;&#22909;&#20102;&#65292;&#31616;&#21333;&#22320;&#35828;&#65292;&#19968;&#20010;&#30690;&#37327;&#26159;&#19968;&#20010;
&#25968;&#37327;&#12290;&#35753;&#25105;&#20204;&#39318;&#20808;&#30475;&#19968;&#20010;&#19968;&#32500;&#30690;&#37327;&#65292;&#36825;&#20165;&#20165;&#26159;&#19968;&#20010;&#30456;&#21516;&#30340;&#21333;&#19968;&#25968;&#23383;&#65292;&#32472;&#21046;&#32534;&#21495;&#25353;&#31661;&#22836;&#20174;&#38646;&#24320;&#22987;&#65292;&#32467;&#26463;&#20110;5&#12290;&#36825;&#26159;&#19968;&#20010;&#31561;&#20110;5&#30340;&#30690;&#37327;a&#65292;&#22914;&#26524;&#32472;&#21046;&#21478;&#19968;&#20010;&#31661;&#22836;&#25105;&#20204;&#22312;5
&#24320;&#22987;&#21644;&#32467;&#26463;&#20110;8&#25105;&#20204;&#26377;&#31561;&#20110;3&#30340;&#30690;&#37327;b&#12290;<br>

<img class="center" src="1d_vector_image.png">

</p><p>
&#20320;&#24212;&#35813;&#35748;&#35782;&#21040;&#65292;&#30690;&#37327;&#22312;&#21738;&#20799;&#24320;&#22987;&#24182;&#19981;&#37325;&#35201;&#65292;&#25152;&#26377;&#37325;&#35201;&#30340;&#26159;&#23427;&#26377;&#22810;&#38271;&#65292;&#23427;&#20250;&#26397;&#20160;&#20040;&#26041;&#21521;&#12290;&#25152;&#20197;&#65292;&#21521;&#37327;b&#24320;&#22987;&#20110;5&#65292;&#38271;&#26159;3&#20010;&#21333;&#20301;&#65292;&#24182;&#25351;&#21521;&#8220;&#21491;&#36793;&#8221;&#65292;&#20351;&#20043;&#25104;&#20026;&#19982;&#20174;0&#24320;
&#22987;&#65292;&#21040;3&#32467;&#26463;&#30456;&#21516;&#12290;&#29616;&#22312;&#65292;&#20320;&#20063;&#21487;&#20197;&#23558;&#36825;&#20123;&#30690;&#37327;&#65292;&#25226;&#20004;&#20010;&#30690;&#37327;a &#21644; b&#30340;
&#31471;&#21040;&#31471;&#31561;&#20110;8&#30340;&#30690;&#37327;?#12290;&#26377;&#20851;&#36127;&#25968;&#24590;&#20040;&#21150;&#65311;&#37027;&#20040;&#65292;&#22914;&#26524;&#22312;&#19978;&#38754;&#30340;&#22270;&#29255;&#20013;&#65292;&#19968;&#20010;&#36733;&#20307;&#65292;&#8220;&#21491;&#8221;&#30340;&#28857;&#65292;&#23545;&#24212;&#20110;&#27491;&#25968;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#19968;&#20010;&#21521;&#37327;&#25351;&#21521;&#8220;&#24038;&#8221;&#30340;&#23545;&#24212;&#36127;&#25968;&#65292;&#19968;&#20010;&#19968;
&#32500;&#21521;&#37327;&#27809;&#26377;&#36229;&#36807;&#31526;&#21495;&#65288;+ / - &#65289;&#30340;&#25968;&#30446;&#12290;&#36825;&#23601;&#35299;&#37322;&#20102;&#19968;&#20010;&#21521;&#37327;&#30340;&#22522;&#26412;&#27010;&#24565;&#65306;&#21482;&#26377;&#38271;&#24230;&#21644;&#26041;&#21521;&#35745;&#25968;&#65288;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#8220;&#24038;&#8221;&#25110;&#8220;&#21491;&#8221;&#65289;&#65292;&#19981;&#26159;&#20301;&#32622;&#12290; <br>
<br>

&#25152;&#20197;&#65292;&#20160;&#20040;&#32422;2&#32500;&#21521;&#37327;&#65311;&#37027;&#20040;&#65292;&#25105;&#20204;&#21487;&#20197;&#35748;&#20026;&#20182;&#20204;&#19981;&#21482;&#26159;&#8220;&#24038;&#8221;&#21644;&#8220;&#21491;&#65292;&#36824;&#26377;&#8221;&#21521;&#19978;&#8220;&#21644;&#8221;&#21521;&#19979;&#8220;&#32452;&#25104;&#65306;<br>

<img class="center" src="2d_vector_image_1.png">

</p><p>&#29616;&#22312;&#65292;&#37027;&#20123;&#36824;&#19981;&#26159;&#23454;&#38469;&#30690;&#37327;&#65292;&#22240;&#20026;&#25105;&#20204;&#20173;&#28982;&#38656;&#35201;&#31616;&#21270;&#20182;&#20204;&#21040;&#36215;&#28857;&#21644;&#32456;&#28857;&#22352;&#26631;&#12290;&#22312;&#30690;&#37327;&#65292;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#23427;&#26377;&#19968;&#20010;&#36215;&#22987;&#22352;&#26631;&#20026;[2,2]&#21644;&#32456;&#28857;&#22352;&#26631;&#20026;
[4,3]&#65292;&#25152;&#20197;&#36825;&#19968;&#28857;&#65292;&#25105;&#20204;&#38656;&#35201;&#31616;&#21270;&#23427;&#65292;&#20174;&#19968;&#24320;&#22987;&#20943;&#21435;&#32467;&#26463;&#30340;&#30690;&#37327;&#22352;&#26631;&#65292;&#31867;&#20284;&#36825;&#26679;&#30340;&#22352;&#26631;&#65306;[&#65288;X2-X1&#65289;&#65292;&#65288;Y2-Y1&#65289;] =
[&#65288;4-2&#65289;&#65292;&#65288;3-2&#65289;] = [2,1]&#12290;&#35753;&#25105;&#20204;&#20570;&#30456;&#21516;&#30340;&#30690;&#37327; B&#822;&#65306;[&#65288;-1.2 - &#65288;3.2&#65289;&#65289;&#65292;&#65288;2.1 - 1.1&#65289;] =
[2,1]&#12290;&#27880;&#24847;&#21040;&#20102;&#21527;&#65311;&#36825;&#20004;&#20010;&#21521;&#37327;&#26159;&#19968;&#26679;&#30340;&#65281;&#36825;&#21448;&#26159;&#19968;&#20010;&#31034;&#33539;&#65292;&#30690;&#37327;&#26377;&#27809;&#26377;&#20301;&#32622;&#65292;&#21807;&#19968;&#30340;&#21482;&#26377;&#26041;&#21521;&#21644;&#38271;&#24230;&#65292;&#25105;&#20204;&#21487;&#20197;&#24471;&#20986;&#36825;&#20123;&#30690;&#37327;&#24444;&#27492;&#30456;&#23545;&#20110;&#26412;&#22320;&#30340;&#20301;&#32622;
[0,0]&#36724;&#65306; <br>

<img class="center" src="2d_vector_image_2.png">

</p><p>
&#36825;&#24847;&#21619;&#30528;&#65292;&#19968;&#20010;2D&#21521;&#37327;&#34987;&#23450;&#20041;&#20026;&#20004;&#20010;&#20540;&#65292; &#19968;&#20010; x &#21644; y &#22352;&#26631;&#12290;&#30456;&#23545;&#26412;&#22320;[0,0]&#36724;&#12290;&#20160;&#20040;&#26679;&#30340;&#26159;3D&#21521;&#37327;&#21602;&#65311;&#22909;&#20102;&#65292;&#20182;&#20204;&#26377;&#8220;&#28145;&#24230;&#8221;&#30340;&#32500;&#36825;&#26679;&#30340;&#20107;&#24773;&#65292;&#23558;&#34987;&#35745;&#31639;&#20026;x&#65292;y&#65292;z&#22352;&#26631;&#65306;<br>

<img class="center" src="3d_vector_image.png">

</p><p>


</p>
<p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">Vector Functions</a>
	</div>
	<div style="float: right;">
		Next : <a href="Normalised%20Vectors.html">Normalised Vectors</a>
	</div>
</div>


<!-- KEYWORDS
vectors
what is a vector
--><!-- #BeginLibraryItem "/Library/mmenu_body_down.lbi" -->
</div>
			<nav id="menu">
				<ul>
					<li ><a href="../../../../index.html">GameMaker:Studio 手册首页</a></li>
					<li ><a href="../../../000_Using GameMaker/index.html">GameMaker:Studio 使用</a></li>
					<li ><a href="../../../001_Advanced Use/index.html">Advanced Use 高级使用</a></li>
					<li ><a href="../../index.html">Reference GML参考手册</a></li>
					<li ><a href="#">Tutorial examples and experience 实例教程及心得</a></li>
					<li ><a href="#">Experimental project 实验项目</a></li>
					<li ><a href="#">Setting 应用设置</a></li>					
				</ul>
			</nav>
</div>
<!-- 注意2 --><!-- #EndLibraryItem --></body></html>