<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Obsolete Splash Functions</title>




	
		
		<meta http-equiv="X-UA-Compatible" content="IE=9">
		<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" --><link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.css" />
<link type="text/css" rel="stylesheet" href="../../../src/css/extensions/jquery.mmenu.themes.css" />

<style type="text/css">
@media all and (min-width: 900px) {
html, body {
height: 100%;

}
#menu {
background: #eee;
}
#page {
border-left: 1px solid #ccc;
min-height: 100%;
}
}
</style>

<script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/1.7.2/jquery.min.js"></script>
<script type="text/javascript" src="../../../src/js/jquery.mmenu.js"></script>
<script type="text/javascript">
$(function() {
$('nav#menu').mmenu({
classes: 'mm-light'
});
});
</script>

<div id="page">
			<div id="header">
				<a href="#menu"></a>
				点击左边按键打开导航菜单
			</div>
			<div id="content">
			
<!-- 注意：使用此库文件的页面“/body”前面必须配置mmenu_body_down.lbi 2 -->


<!-- #EndLibraryItem --><h1>Obsolete Splash Functions &#28120;&#27760;&#39134;&#28293;&#20989;&#25968;<br>
</h1>
  
<h2>&#36825;&#20123;&#20989;&#25968;&#26159;&#22788;&#29702;&#39134;&#28293;&#21644;&#35270;&#39057;&#30340;&#12290;
</h2>
<p>
  
</p><h3> <b>Function List :</b> </h3>
<div class="param">
<table>
	<tbody><tr><th>Function</th><th>Description</th></tr>

	<tr><td>splash_show_video</td><td>&#26174;&#31034;&#19968;&#20010;&#25351;&#23450;&#25991;&#20214;&#21517;&#30340;&#35270;&#39057;&#39134;&#28293;&#12290;&#26159;&#21542;&#19968;&#20010;&#29305;&#23450;&#30340;&#30005;&#24433;&#25991;&#20214;&#30340;&#25903;&#25345;&#21462;&#20915;&#20110;&#26426;&#22120;&#19978;&#30340;&#39537;&#21160;&#12290;&#36890;&#24120;,&#24744;&#21487;&#20197;&#20351;&#29992;.avi, .mpg, and .wmv&#25991;&#20214;&#20294;&#36991;&#20813;&#20351;&#29992;&#29305;&#27530;&#30340;&#32534;&#35299;&#30721;&#22120;&#12290;&#20320;&#26368;&#22909;&#25226;&#36825;&#20010;&#25991;&#20214;&#22312;&#20320;&#33258;&#24049;&#28216;&#25103;&#25991;&#20214;&#22841;&#30340;&#25110;&#32773;&#23376;&#25991;&#20214;&#22841;&#12290;loop&#26159;&#26159;&#21542;&#24490;&#29615;&#26174;&#31034;&#35270;&#39057;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_show_text</td><td> &#26174;&#31034;&#19968;&#20010;&#25351;&#23450;&#25991;&#20214;&#21517;&#30340;&#25991;&#26412;&#39134;&#28293;&#12290;&#20320;&#21487;&#20197;&#26174;&#31034;&#26631;&#20934;&#25991;&#26412;&#25991;&#20214;(. txt)&#25110;&#23500;&#25991;&#26412;&#25991;&#20214;(. 
rtf)&#12290;&#21482;&#26377;&#37096;&#20998;&#30340;&#23500;&#25991;&#26412;&#29305;&#24615;&#32771;&#34385;&#22312;&#20869;&#12290;&#22914;&#22270;&#20687;&#21644;&#20854;&#20182;&#23884;&#20837;&#24335;&#23545;&#35937;&#19981;&#26174;&#31034;&#12290;&#24310;&#36831;&#34920;&#31034;&#24310;&#36831;&#27627;&#31186;&#21518;&#25165;&#33021;&#32487;&#32493;&#28216;&#25103;&#12290;&#20351;&#29992;0&#25110;&#36127;&#20540;&#31561;&#21040;&#29609;&#23478;&#25353;&#19979;&#36864;&#20986;&#38190;&#25110;&#28857;&#20987;&#40736;&#26631;&#22312;&#31383;&#21475;&#12290;(&#27880;&#24847;,&#27809;&#26377;&#28378;&#21160;&#26465;&#20250;&#26174;&#31034;&#20063;&#27809;&#26377;&#21478;&#19968;&#31181;&#28378;&#21160;&#25991;&#26412;&#12290;&#25152;&#20197;&#25991;&#26412;&#24517;&#39035;&#36866;&#24212;&#31383;&#21475;&#12290;)</td></tr>

	<tr><td>splash_show_image</td><td>&#26174;&#31034;&#19968;&#20010;&#25351;&#23450;&#25991;&#20214;&#21517;&#22270;&#20687;&#39134;&#28293;&#12290;&#35768;&#22810;&#22270;&#20687;&#31867;&#22411;&#30340;&#25903;&#25345;(&#20363;&#22914;.bmp, .jpg, .tif, and .wmf)&#20294;&#27809;&#26377;&#21160;&#30011;&#22270;&#20687;&#12290;&#25302;&#24310;&#26159;&#25512;&#36831;&#27627;&#31186;&#21518;&#25165;&#33021;&#32487;&#32493;&#28216;&#25103;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_show_web</td><td>&#26174;&#31034;&#20102;&#19968;&#20010;web&#39029;&#38754;&#21551;&#21160;&#30011;&#38754;&#12290;url&#26159;&#32593;&#39029;&#30340;url(&#20174;http://)&#25110;&#32773;&#26159;&#25991;&#20214;&#21517;&#31216;&#20026;&#24403;&#22320;&#30340;html&#25991;&#20214;&#12290;&#20294;&#26159;&#35201;&#27880;&#24847;,&#20320;&#24517;&#39035;&#25552;&#20379;&#23436;&#25972;&#36335;&#24452;&#23545;&#20110;&#36825;&#20010;&#24037;&#20316;&#12290;&#25152;&#20197;&#20320;&#26368;&#22909;&#22914;&#20351;&#29992;url&#31867;&#20284;&#24037;&#20316;&#30446;&#24405;+&#8220;\ 
index . html&#8221;&#12290;&#25302;&#24310;&#26159;&#25512;&#36831;&#27627;&#31186;&#21518;&#25165;&#33021;&#32487;&#32493;&#28216;&#25103;</td></tr>
	
	<tr><td>splash_set_main</td><td>&#26174;&#31034;&#39134;&#28293;&#26159;&#21542;&#24517;&#39035;&#26174;&#31034;&#22312;&#20027;&#28216;&#25103;&#31383;&#21475;(&#30495;&#30340;,&#40664;&#35748;)&#25110;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#31383;&#21475;(false)&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_scale</td><td>&#35774;&#32622;&#39134;&#28293;&#27604;&#20363;&#29992;&#26469;&#24403;&#26174;&#31034;&#19968;&#20010;&#35270;&#39057;&#25110;&#22270;&#20687;,&#24403;&#20351;&#29992;&#19968;&#20010;&#20540;&#20026;0&#30340;&#27604;&#20363;&#31995;&#25968;&#36873;&#25321;&#30340;&#31383;&#21475;&#26159;&#22635;&#20805;(&#40664;&#35748;)&#12290;</td></tr>
	
	<tr><td>splash_set_cursor</td><td>&#35774;&#32622;&#26159;&#21542;&#24212;&#35813;&#20986;&#29616;&#22312;&#40736;&#26631;&#22312;&#39134;&#28293;&#19978;&#12290;&#40664;&#35748;&#26159;&#21487;&#35265;&#30340;&#12290;&#23545;&#20110;&#30005;&#24433;&#40736;&#26631;&#19981;&#33021;&#20851;&#38381;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_color</td><td>&#35774;&#32622;&#39068;&#33394;&#22312;&#22270;&#20687;&#25110;&#35270;&#39057;&#30340;&#21608;&#36793;&#22320;&#21306;&#12290;</td></tr>
	
	<tr><td>splash_set_caption</td><td>&#35774;&#32622;&#39134;&#28293;&#31383;&#21475;&#30340;&#26631;&#39064;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#20351;&#29992;&#31354;&#23383;&#31526;&#20018;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_fullscreen</td><td>&#35774;&#32622;&#26159;&#21542;&#20351;&#29992;&#20840;&#23631;&#31383;&#21475;&#25110;&#19981;&#26159;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#27491;&#24120;&#20351;&#29992;&#40664;&#35748;&#31383;&#21475;&#12290;</td></tr>
	
	<tr><td>splash_set_border</td><td>&#35774;&#32622;&#39134;&#28293;&#26159;&#21542;&#24212;&#35813;&#26377;&#19968;&#20010;&#36793;&#26694;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#30340;&#36793;&#30028;&#34987;&#20351;&#29992;&#12290;</td></tr>

	<tr class="alt"><td>splash_set_size</td><td>&#35774;&#32622;&#39134;&#28293;&#31383;&#21475;&#23610;&#23544;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#22823;&#23567;&#20026;640 x480&#12290;</td></tr>
	
	<tr><td>splash_set_position</td><td>&#35774;&#32622;&#39134;&#28293;&#31383;&#21475;&#20301;&#32622;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#30340;Windows&#20915;&#23450;&#20301;&#32622;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_adapt</td><td>&#35774;&#32622;&#39134;&#28293;&#22823;&#23567;&#26159;&#21542;&#24517;&#39035;&#36866;&#24212;&#25193;&#23637;&#23610;&#23544;&#30340;&#35270;&#39057;&#25110;&#22270;&#20687;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#30340;&#36866;&#24212;&#20026;&#30495;&#12290;</td></tr>
	
	<tr><td>splash_set_top</td><td>&#35774;&#32622;&#39134;&#28293;&#26159;&#21542;&#22312;&#20854;&#20182;&#31383;&#21475;&#30340;&#39030;&#37096;&#12290;&#36825;&#21482;&#26377;&#25928;&#24212;&#26159;&#19968;&#20010;&#21333;&#29420;&#30340;&#31383;&#21475;&#26102;&#39134;&#28293;&#30340;&#20351;&#29992;&#12290;&#40664;&#35748;&#20540;&#20026;&#30495;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_interrupt</td><td>&#35774;&#32622;&#26159;&#21542;&#29609;&#25171;&#26029;&#28216;&#25103;&#32780;&#26174;&#31034;&#39134;&#28293;&#31383;&#21475;&#12290;&#36825;&#21482;&#33021;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#39134;&#28293;&#31383;&#21475;&#26102;&#20351;&#29992;&#12290;&#40664;&#35748;&#20540;&#20026;&#30495;&#12290;</td></tr>
	
	<tr><td>splash_set_stop_key</td><td>&#35774;&#32622;&#20572;&#27490;&#26174;&#31034;&#39134;&#28293;&#31383;&#21475;&#24403;&#29609;&#23478;&#25353;&#19979;Esc&#26102;&#12290;&#40664;&#35748;&#20540;&#20026;&#30495;&#12290;</td></tr>
	
	<tr class="alt"><td>splash_set_stop_mouse</td><td>&#35774;&#32622;&#24403;&#29609;&#23478;&#22312;&#39134;&#28293;&#31383;&#21475;&#20013;&#25353;&#19979;&#40736;&#26631;&#26159;&#21542;&#20572;&#27490;&#39134;&#28293;&#31383;&#21475;&#65292;&#40664;&#35748;&#20540;&#20026;&#30495;&#12290;</td></tr>	
	
	<tr><td>splash_set_close_button</td><td>&#35774;&#32622;&#26159;&#21542;&#22312;&#39134;&#28293;&#31383;&#21475;&#19978;&#26174;&#31034;&#20851;&#38381;&#25353;&#38062;&#12290;&#36825;&#26159;&#26377;&#29992;&#30340;&#22312;&#36816;&#34892;&#28216;&#25103;&#20840;&#23631;&#27169;&#24335;&#25110;&#27809;&#26377;&#36793;&#30028;&#12290;&#40664;&#35748;&#20540;&#20026;&#30495;&#12290;</td></tr>

</tbody></table>
</div>

<p>&#20197;&#19979;&#20989;&#25968;&#20063;&#34987;&#21024;&#38500; :

</p><div class="param">
<table>
	<tbody><tr><th>Function</th><th>Description</th></tr>

	<tr><td>show_info</td><td>&#26174;&#31034;&#28216;&#25103;&#20449;&#24687;&#12290;</td></tr>
	
	<tr class="alt"><td>load_info</td><td>&#20174;&#25991;&#20214;fname&#20013;&#35835;&#21462;&#28216;&#25103;&#20449;&#24687;&#12290;&#24517;&#39035;&#26159;.rtf&#26684;&#24335;&#12290;&#36825;&#20010;&#20989;&#25968;&#29992;&#20110;&#22312;&#19981;&#21516;&#26102;&#21051;&#26174;&#31034;&#19981;&#21516;&#30340;&#24110;&#21161;&#25991;&#20214;</td></tr>	
	
</tbody></table>
</div>

<h3> <b>&#20026;&#20160;&#20040;&#28120;&#27760;&#36825;&#20123;</b> </h3>
<p>
&#36825;&#20123;&#20165;windows&#25903;&#25345;&#65292;&#20854;&#20182;&#35774;&#22791;&#19981;&#25903;&#25345;&#65292;&#29305;&#21035;&#26159;&#22312;&#36816;&#34892;&#31243;&#24207;&#26102;&#26174;&#31034;&#39134;&#28293;&#31383;&#21475;&#12290;<br>
<br>

</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">Obsolete Functions</a>
	</div>
	<div style="float: right;">
		Next : <a href="Obsolete%20Particle%20Functions.html">Particle Functions</a>
	</div>
</div>


<!-- KEYWORDS
splash_show_video (obsolete)
splash_show_text (obsolete)
splash_show_image (obsolete)
splash_show_web (obsolete)
splash_set_main (obsolete)
splash_set_scale (obsolete)
splash_set_cursor (obsolete)
splash_set_color (obsolete)
splash_set_caption (obsolete)
splash_set_fullscreen (obsolete)
splash_set_border (obsolete)
splash_set_size (obsolete)
splash_set_position (obsolete)
splash_set_adapt (obsolete)
splash_set_top (obsolete)
splash_set_interrupt (obsolete)
splash_set_stop_key (obsolete)
splash_set_stop_mouse (obsolete)
splash_set_close_button (obsolete)
show_info
load_info
--><!-- #BeginLibraryItem "/Library/mmenu_body_down.lbi" -->
</div>
			<nav id="menu">
				<ul>
					<li ><a href="../../000_Using GameMaker/index.html">GameMaker:Studio 使用</a></li>
					<li ><a href="../../001_Advanced Use/Extensions/index.html">Advanced Use高级使用</a></li>
					<li><a href="../../../demo/vertical-submenus.html">Vertical submenus example</a></li>
					<li><a href="../../../demo/photos.html">Photos in sliding panels</a></li>
					<li><a href="../../../demo/positions.html">Positioning the menu</a></li>
					<li><a href="../../../demo/colors.html">Coloring the menu</a></li>
					<li><a href="../../../demo/advanced.html">Advanced example</a></li>
					<li><a href="../../../demo/onepage.html">One page scrolling example</a></li>
					<li><a href="../../../demo/jqmobile/index.html">jQuery Mobile example</a></li>
				</ul>
			</nav>
</div>
<!-- 注意2 --><!-- #EndLibraryItem --></body></html>