<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><title>Trigger Events</title>


	
<meta http-equiv="X-UA-Compatible" content="IE=9">
	<link rel="stylesheet" href="../../style.css" type="text/css" media="screen" title="style" charset="utf-8">
	<meta http-equiv="X-UA-Compatible" content="IE=9"><meta name="viewport" content="width=device-width initial-scale=1.0 maximum-scale=1.0 user-scalable=yes" /></head><body><!-- #BeginLibraryItem "/Library/mmenu_head.lbi" -->		<link type="text/css" rel="stylesheet" href="../../style.css" />
		<link type="text/css" rel="stylesheet" href="../../../src/css/jquery.mmenu.all.css" />
		<script type="text/javascript" src="../../../src/js/jquery.min.js"></script>
		<script type="text/javascript" src="../../../src/js/hammer.min.js"></script>
		<script type="text/javascript" src="../../../src/js/jquery.mmenu.min.all_old.js"></script>		
		
	<!-- scripts links 
		
		<style type="text/css">
			.mm-menu li.img a
			{
				font-size: 16px;
			}
			.mm-menu li.img a img
			{
				float: left;
				margin: -5px 10px -5px 0;
			}
			.mm-menu li.img a small
			{
				font-size: 12px;
			}
		</style>

   	
   
		<style type="text/css">
		@media all and (min-width: 900px) {
		html, body {
		height: 100%
		
		}
		#menu {
		background: #eee
		}
		#page {
		border-left: 1px solid #ccc
		min-height: 100%
		}
		}
		</style>
   -->
 
		<script type="text/javascript">

			//	The menu on the right
			$(function() {

				var $menu = $('nav#menu-right');
				$menu.mmenu({
					position	: 'right',
					classes		: 'mm-light',
					dragOpen	: true,
					counters	: true,
					searchfield	: true,
					labels		: {
						fixed		: !$.mmenu.support.touch
					},
					header		: {
						add			: true,
						update		: true,
						title		: 'Contributors'
					}
				});

				//	Click a menu-item
				var $confirm = $('#confirmation');
				$menu.find( 'li a' ).not( '.mm-subopen' ).not( '.mm-subclose' ).bind(
					'click.example',
					function( e )
					{
						e.preventDefault();
						$confirm.show().text( 'You clicked "' + $.trim( $(this).text() ) + '"' );
						$('#menu-right').trigger( 'close' );
					}
				);
			});
			
			//	The menu on the left
			$(function() {

				var $menu0 = $('nav#menu-left');

				$menu0.mmenu({
					position	: 'left',
					classes		: 'mm-light',
					dragOpen	: true,
					counters	: true,
					searchfield	: true,
					labels		: {
						fixed		: !$.mmenu.support.touch
					}
				});
			});			

			// for one page

			$(function() {
				var $menu = $('nav#menu-left'),
					$html = $('html, body');
		
				$menu.mmenu();
				$menu.find( 'li > a' ).on(
					'click',
					function()
					{
						var href = $(this).attr( 'href' );
		
						//	if the clicked link is linked to an anchor, scroll the page to that anchor 
						if ( href.slice( 0, 1 ) == '#' )
						{
							$menu.one(
								'closed.mm',
								function()
								{
									setTimeout(
										function()
										{
											$html.animate({
												scrollTop: $( href ).offset().top
											});	
										}, 10
									);	
								}
							);						
						}
					}
				);
			});

			// for the tips
			
			$(function() {
				var options = {
					classes			: 'mm-light',
					modal			: true
				};
				
				options.position = 'left';
				options.zposition = 'next';
				$('#tooltip-1').mmenu( options );
				
				options.position = 'right';
				options.zposition = 'next';
				$('#tooltip-2').mmenu( options );
				
				options.position = 'bottom';
				options.zposition = 'front';
				$('#popup-1').mmenu( options );

				options.position = 'top';
				options.zposition = 'front';
				$('#popup-2').mmenu( options );
			});
	
		</script>
		
<!-- mmenu_head for update files 1,2:2 -->


<!-- #EndLibraryItem --><!-- the page header part  -->
<div id="page">
			<div id="header" >
				<a href="#menu-left"></a>
				&#x70B9;&#x51FB;&#x5DE6;&#x8FB9;&#x6309;&#x952E;&#x6253;&#x5F00;&#x5BFC;&#x822A;&#x83DC;&#x5355;
				<a href="#menu-right" class="friends right"></a>
			</div>

			<div id="content" >
			
<h1>Trigger Events &#35302;&#21457;&#22120;&#20107;&#20214;<br>
</h1>
<br>
<b>&#35302;&#21457;&#20107;&#20214;&#26159;&#19968;&#31181;&#29305;&#27530;&#30340;&#20107;&#20214;&#65292;&#23558;&#8220;&#35302;&#21457;&#8221;&#26102;&#65292;&#20320;&#22312;&#20195;&#30721;&#20013;&#25351;&#23450;&#30340;&#35201;&#27714;&#24050;&#24471;&#21040;&#28385;&#36275;&#12290;</b><br><br>
<p>

</p><h3>&#20026;&#20160;&#20040;&#28120;&#27760;&#36825;&#20123;<br>
</h3>
<p>&#35302;&#21457;&#22120;&#65292;&#23454;&#29616;&#30001;&#20197;&#21069;&#29256;&#26412;&#30340;&#28216;&#25103;&#21046;&#20316;&#65292;&#22312;&#39640;&#25928;&#26102;&#65292;&#22823;&#22810;&#25968;&#20154;&#24456;&#23569;&#20351;&#29992;&#30340;&#65292;&#20284;&#20046;&#36896;&#25104;&#28216;&#25103;&#30340;&#36923;&#36753;&#21644;&#36319;&#36394;&#22256;&#38590;&#24471;&#22810;&#65292;&#27604;&#22797;&#26434;&#30340;&#28216;&#25103;&#12290;&#23545;&#20110;&#37027;&#20123;&#20351;&#29992;&#23427;&#20204;&#65292;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#23454;&#29616;&#30456;&#21516;&#30340;&#21151;&#33021;&#65292;&#36890;&#36807;&#21019;&#24314;&#19968;&#20010;&#33050;&#26412;&#65292;&#25226;&#23427;&#22312;&#24320;&#22987;&#19968;&#27493;&#20107;&#20214;&#65292;step&#20107;&#20214;&#25110;&#20107;&#20214;&#30340;&#23545;&#35937;&#30340;&#32467;&#26463;&#27493;&#12290;<br>
<br>&#27491;&#22914;&#20320;&#21487;&#33021;&#24050;&#32463;&#20351;&#29992;&#35302;&#21457;&#22120;&#30340;&#28216;&#25103;&#21046;&#20316;&#19982;&#20197;&#21069;&#29256;&#26412;&#30340;&#26087;&#25991;&#20214;&#65292;&#20320;&#21487;&#20197;&#25214;&#21040;&#19968;&#20010;&#27010;&#35201;&#30340;&#35302;&#21457;&#20107;&#20214;&#26159;&#20160;&#20040;&#20197;&#21450;&#23427;&#26159;&#22914;&#20309;&#20316;&#20026;&#21442;&#32771;&#20351;&#29992;&#19979;&#38754;&#30340;&#65306;<br>
<br>
<br>
<br>

</p><h3>&#35302;&#21457;&#22120;&#20107;&#20214;</h3>
<p>&#35201;&#23450;&#20041;&#35302;&#21457;&#20107;&#20214;&#65292;&#20320;&#36873;&#25321;&#20174;&#8220;&#36164;&#28304;&#8221;&#33756;&#21333;&#20013;&#23450;&#20041;&#35302;&#21457;&#22120;&#30340;&#20027;&#35201;&#28216;&#25103;&#21046;&#20316;&#31383;&#21475;&#30340;&#39030;&#37096;&#65292;&#25110;&#32773;&#20320;&#21487;&#20197;&#36873;&#25321;&#22312;&#23545;&#35937;&#20013;&#28155;&#21152;&#19968;&#20010;&#35302;&#21457;&#22120;&#20107;&#20214;&#65292;&#28982;&#21518;&#36873;&#25321;&#8220;&#28155;&#21152;/&#20462;&#25913;&#35302;&#21457;&#22120;&#8221;&#12290;&#26080;&#35770;&#21738;&#31181;&#26041;&#27861;&#65292;&#23558;&#25171;&#24320;&#19979;&#38754;&#30340;&#34920;&#21333;&#65292;&#24744;&#23450;&#20041;&#35302;&#21457;&#30701;&#20195;&#30721;&#21151;&#33021;&#12290;&#36825;&#21487;&#33021;&#26159;&#20070;&#38754;&#30340;&#24418;&#24335;&#22914;&#19979;&#22270;&#25152;&#31034;&#65292;&#21253;&#21547;&#19968;&#20010;&#20363;&#23376;&#12290;

</p><p>
<img class="center" src="../../images/form_trigger.png">

</p><p>&#22312;&#20320;&#30340;&#24038;&#36793;&#30475;&#21040;&#19968;&#20010;&#21015;&#34920;&#30340;&#25152;&#26377;&#35302;&#21457;&#22120;&#65292;&#36804;&#20170;&#24050;&#23450;&#20041;&#30340;&#65288;&#26174;&#28982;&#26159;&#31354;&#30340;&#65292;&#22914;&#26524;&#20320;&#36824;&#27809;&#26377;&#21019;&#24314;&#20219;&#20309;&#65281;&#65289;&#12290;&#19979;&#38754;&#26377;&#19968;&#20123;&#25353;&#38062;&#20855;&#26377;&#20197;&#19979;&#21151;&#33021;&#65306;

</p><p>
</p><ul>
	<li><b>Add</b>. &#20351;&#29992;&#27492;&#25353;&#38062;&#26469;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#35302;&#21457;&#20107;&#20214;&#30340;&#21015;&#34920;&#12290;&#24418;&#24335;&#23558;&#25913;&#21464;&#65292;&#20197;&#26174;&#31034;&#26032;&#30340;&#31354;&#35302;&#21457;&#20934;&#22791;&#28155;&#21152;&#24517;&#35201;&#30340;&#20195;&#30721;&#21644;&#21517;&#31216;&#12290;</li>
	<br>
	<li><b>Delete</b>. &#21024;&#38500;&#24403;&#21069;&#36873;&#23450;&#30340;&#35302;&#21457;&#20107;&#20214;&#30340;&#21015;&#34920;&#20013;&#36873;&#25321;&#12290;&#35201;&#23567;&#24515;&#65292;&#20174;&#26469;&#27809;&#26377;&#21024;&#38500;&#35302;&#21457;&#20107;&#20214;&#30340;&#23545;&#35937;&#20013;&#20351;&#29992;&#65281;&#36825;&#23558;&#23548;&#33268;&#19981;&#21487;&#39044;&#26009;&#30340;&#32467;&#26524;&#65292;&#32943;&#23450;&#20250;&#24341;&#36215;&#20320;&#30340;&#38382;&#39064;&#22312;&#24744;&#30340;&#39033;&#30446;&#20013;&#12290; </li>
	<br>
	<li><b>Load</b>. &#35302;&#21457;&#22120;&#20174;&#25991;&#20214;&#21152;&#36733;&#30340;&#38598;&#21512;&#12290;&#36825;&#26679;&#30340;&#25991;&#20214;&#25193;&#23637;&#21517;&#24517;&#39035;&#20026;.gmtrg&#12290;&#30340;&#35302;&#21457;&#26469;&#33258;&#35813;&#25991;&#20214;&#30340;&#24038;&#20391;&#19978;&#30340;&#35302;&#21457;&#22120;&#30340;&#24418;&#24335;&#28155;&#21152;&#21040;&#21015;&#34920;&#20013;&#65292;&#28982;&#21518;&#65292;&#21487;&#20197;&#20351;&#29992;&#25110;&#20462;&#25913;&#20026;&#27491;&#24120;&#12290;</li>
	<br>
	<li><b>Save</b>. &#25910;&#38598;&#20445;&#23384;&#21040;&#19968;&#20010;&#25991;&#20214;&#20013;&#30340;&#35302;&#21457;&#22120;&#12290;&#24517;&#39035;&#22312;&#35813;&#25991;&#20214;&#30340;&#25193;&#23637;&#21517;&#20026;.gmtrg&#12290;&#22312;&#36825;&#31181;&#26041;&#24335;&#20013;&#65292;&#24744;&#21487;&#20197;&#21019;&#24314;&#33258;&#24049;&#30340;&#24211;&#30340;&#35302;&#21457;&#22120;&#65292;&#28982;&#21518;&#21487;&#20197;&#21152;&#36733;&#21040;&#20351;&#29992;&#20219;&#20309;&#36827;&#19968;&#27493;&#30340;&#39033;&#30446;&#65292;&#24182;&#22240;&#27492;&#33410;&#30465;&#24744;&#30340;&#26102;&#38388;&#12290;</li>
	<br>
	<li><b>Clear</b>. &#24443;&#24213;&#28165;&#38500;&#21015;&#34920;&#20013;&#30340;&#25152;&#26377;&#35302;&#21457;&#22120;&#12290;&#35201;&#23567;&#24515;&#65292;&#21482;&#20351;&#29992;&#23545;&#35937;&#26102;&#65292;&#27809;&#26377;&#20351;&#29992;&#20219;&#20309;&#35302;&#21457;&#20107;&#20214;&#65281;&#21024;&#38500;&#28165;&#38500;&#30340;&#23545;&#35937;&#27491;&#22312;&#20351;&#29992;&#30340;&#35302;&#21457;&#20107;&#20214;&#26102;&#65292;&#21487;&#20197;&#26377;&#19981;&#24517;&#35201;&#30340;&#21103;&#20316;&#29992;&#65292;&#21487;&#33021;&#20250;&#23548;&#33268;&#20005;&#37325;&#30340;&#38382;&#39064;&#65292;&#24403;&#36816;&#34892;&#24744;&#30340;&#39033;&#30446;&#12290;</li>
</ul>

<p>&#19968;&#26086;&#20320;&#23436;&#25104;&#65292;&#20320;&#24517;&#39035;&#25353;&#8220;&#30830;&#23450;&#8221;&#25353;&#38062;&#65292;&#20445;&#23384;&#25152;&#20570;&#30340;&#26356;&#25913;&#65292;&#21487;&#20197;&#20351;&#29992;&#35302;&#21457;&#20107;&#20214;&#22312;&#23545;&#35937;&#12290;&#22914;&#26524;&#20320;&#19981;&#24819;&#20445;&#23384;&#26356;&#25913;&#65292;&#21482;&#38656;&#22312;&#21313;&#23383;&#26550;&#19978;&#65292;&#36890;&#36807;&#28857;&#20987;&#21491;&#19978;&#35282;&#20851;&#38381;&#65292;&#24182;&#34920;&#26126;&#24744;&#19981;&#24819;&#20445;&#23384;&#26356;&#25913;&#65292;&#20250;&#24377;&#20986;&#23545;&#35805;&#26041;&#22359;&#20013;&#30340;&#12290;<br>
<br>

</p><h3>&#23450;&#20041;&#19968;&#20010;&#35302;&#21457;&#22120;</h3>

<p>&#19968;&#26086;&#20320;&#24050;&#32463;&#21019;&#24314;&#20102;&#19968;&#20010;&#35302;&#21457;&#22120;&#65292;&#24744;&#24517;&#39035;&#22635;&#20889;&#22312;&#20854;&#23646;&#24615;&#65292;&#19968;&#33324;&#24320;&#22987;&#32473;&#23427;&#36215;&#21517;&#23383;&#12290;&#27492;&#21517;&#31216;&#21487;&#20197;&#26159;&#20219;&#20309;&#20320;&#24819;&#35201;&#30340;&#65292;&#21482;&#35201;&#20320;&#20351;&#29992;&#30340;&#23383;&#31526;&#65288;&#35265;&#36827;&#19968;&#27493;&#19979;&#38477;&#30340;&#20449;&#24687;&#65292;&#35302;&#21457;&#21629;
&#21517;&#20026;&#19968;&#24120;&#25968;&#65289;&#65292;&#20294;&#24212;&#35813;&#26159;&#25551;&#36848;&#65292;&#35753;&#20320;&#30693;&#36947;&#23427;&#30340;&#30636;&#38388;&#26159;&#20160;&#20040;&#65292;&#24403;&#20320;&#36873;&#25321;&#23427;&#20351;&#29992;&#22312;&#19968;&#20010;&#23545;&#35937;&#12290;&#27492;&#21517;&#31216;&#23558;&#20986;&#29616;&#22312;&#33756;&#21333;&#21487;&#29992;&#30340;&#35302;&#21457;&#22120;&#65292;&#22312;&#20107;&#20214;&#21015;&#34920;&#20013;&#30340;&#23545;&#35937;&#12290;&#25509;&#19979;&#26469;&#20320;&#24517;&#39035;&#20570;
&#30340;&#26159;&#25351;&#23450;&#30340;&#26465;&#20214;&#65292;&#23558;&#8220;&#35302;&#21457;&#8221;&#35302;&#21457;&#20107;&#20214;&#65281;&#36825;&#26159;&#19968;&#22359;&#30340;GML&#20195;&#30721;&#21040;&#31383;&#21475;&#19978;&#20889;&#30340;&#26435;&#21033;&#36816;&#34892;&#26102;&#65292;&#23427;&#36820;&#22238;&#19968;&#20010;true&#25110;false&#20540;&#12290;&#22312;&#36825;&#26679;&#19968;&#20010;&#35302;&#21457;&#22120;&#23558;&#35302;&#21457;&#26102;&#30340;&#36820;&#22238;
&#20540;&#26159;&#30495;&#23454;&#30340;&#12290;<br>
<br>
</p><h3>&#20351;&#29992;&#33539;&#20363;</h3>

<p>&#20551;&#35774;&#20320;&#35201;&#21019;&#24314;&#30340;&#20107;&#20214;&#21457;&#29983;&#65292;&#24403;&#29609;&#23478;&#25353;&#19979;&#25511;&#21046;&#38190;&#21644;A&#38190;&#12290;&#23545;&#20110;&#36825;&#19968;&#28857;&#65292;&#20320;&#21487;&#20197;&#20889;&#20197;&#19979;&#26465;&#20214;&#33050;&#26412;&#65306;<br>
<br>

</p><p class="code">
{<br>
  <b>return</b> keyboard_check(ord('A')) &amp;&amp; keyboard_check(vk_control);<br>
}<br>
</p>

<p>
<br>&#27491;&#22914;&#20320;&#21487;&#20197;&#30475;&#21040;&#30340;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#33050;&#26412;&#23558;&#36820;&#22238;false&#65292;&#38500;&#38750;&#25511;&#21046;&#38190;&#21644;A&#38190;&#19968;&#36215;&#25353;&#19979;&#12290;<br>
<br>
&#23454;&#38469;&#19978;&#65292;&#20320;&#21487;&#20197;&#25226;&#19968;&#20123;&#30456;&#24403;&#22797;&#26434;&#30340;&#65292;&#23436;&#25972;&#30340;&#33050;&#26412;&#20026;&#26465;&#20214;&#65292;&#21482;&#35201;&#22312;&#37027;&#37324;&#30340;&#26576;&#20010;&#22320;&#26041;&#65292;&#20320;&#26377;&#19968;&#20010;return&#35821;&#21477;&#30340;&#35745;&#31639;&#32467;&#26524;&#20026;true&#25110;false&#12290;&#20363;&#22914;&#65292;&#26377;&#19968;&#20010;&#20107;&#20214;&#21457;&#29983;&#65292;&#21482;&#26377;&#24403;&#23454;&#20363;&#30340;&#25968;&#37327;&#65288;&#22312;&#36825;&#31181;&#24773;&#20917;&#8220;obj_ball&#8221;&#65289;&#26159;&#22312;3&#21644;5&#20043;&#38388;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#19979;&#38754;&#30340;&#26465;&#20214;&#33050;&#26412;&#65306;<br>
<br>

</p><p class="code">
{<br>
  <b>var</b> n;<br>
  n = instance_number(obj_ball);<br>
  <b>return</b> (n &gt;= 3) &amp;&amp; (n &lt;= 5);<br>
}
</p>

<p>
<br>&#24744;&#21487;&#33021;&#20250;&#21457;&#29616;&#65292;&#26377;&#26102;&#20320;&#38656;&#35201;&#30340;&#20195;&#30721;&#26469;&#23450;&#20041;&#26465;&#20214;&#26159;&#22826;&#38271;&#30340;&#20195;&#30721;&#31383;&#21475;&#20869;&#35302;&#21457;&#24418;&#24335;&#65292;&#25152;&#20197;&#20320;&#21487;&#33021;&#35201;&#22312;&#23454;&#38469;&#30340;&#20195;&#30721;&#32534;&#36753;&#22120;&#20013;&#36827;&#34892;&#32534;&#36753;&#65292;&#32780;&#19981;&#26159;&#12290;&#20026;&#27492;&#25353;&#19979;&#25353;&#38062;&#20351;&#29992;&#20195;&#30721;&#32534;&#36753;&#22120;&#20013;&#25171;&#24320;&#35813;&#31383;&#21475;&#65292;&#24182;&#20445;&#25345;&#27491;&#24120;&#30340;&#24037;&#20316;&#65292;&#22312;&#24038;&#19978;&#35282;&#23558;&#26356;&#25913;&#20445;&#23384;&#21040;&#35302;&#21457;&#28857;&#20987;&#19978;&#25171;&#38057;&#12290;<br>
<br>
&#24744;&#21487;&#20197;&#21019;&#24314;&#35768;&#22810;&#20854;&#20182;&#31867;&#22411;&#30340;&#35302;&#21457;&#20107;&#20214;&#12290;&#20363;&#22914;&#65292;&#20107;&#20214;&#65292;&#35831;&#26816;&#26597;&#24744;&#26159;&#21542;&#38752;&#36817;&#25932;&#20154;&#65292;&#20107;&#20214;&#65292;&#35831;&#26816;&#26597;&#24744;&#26159;&#21542;&#25910;&#38598;&#21040;&#36275;&#22815;&#30340;&#38065;&#25110;&#20855;&#26377;&#36739;&#39640;&#30340;&#20998;&#25968;&#65292;&#20107;&#20214;&#29983;&#25104;&#19968;&#20010;&#23545;&#35937;&#22312;&#26576;&#19968;&#20010;&#22320;&#26041;...&#21487;&#33021;&#24615;&#26159;&#26080;&#31351;&#26080;&#23613;&#30340;&#65292;&#36825;&#20351;&#24471;&#20351;&#29992;&#35302;&#21457;&#19968;&#20010;&#38750;&#24120;&#26041;&#20415;&#30340;&#26041;&#24335;&#26469;&#32452;&#32455;&#20320;&#30340;&#28216;&#25103;&#65292;&#20877;&#21033;&#29992;&#33050;&#26412;&#22312;&#20854;&#20182;&#39033;&#30446;&#20013;&#26159;&#26377;&#24110;&#21161;&#30340;&#12290;<br>
<br>
&#24744;&#25152;&#25351;&#23450;&#30340;&#26465;&#20214;&#33050;&#26412;&#21518;&#65292;&#20320;&#24212;&#35813;&#25351;&#23450;&#35201;&#27979;&#35797;&#30340;&#26465;&#20214;&#12290;&#26377;&#19977;&#20010;&#36873;&#39033;&#65292;&#25152;&#26377;&#30456;&#20851;&#30340;&#27493;&#39588;&#20107;&#20214;&#65306; <br>
</p><ul>
	<li>&#20320;&#21487;&#20197;&#22312;&#24320;&#22987;&#27493;&#20043;&#21069;&#27979;&#35797;&#26465;&#20214;&#65288;&#23601;&#22312;&#24320;&#22987;&#27493;&#20107;&#20214;&#20043;&#21069;&#65289;</li>
	<li>&#20320;&#21487;&#20197;&#22312;&#27493;&#20013;&#26102;&#27979;&#35797;&#26465;&#20214;&#65288;&#23601;&#22312;&#27493;&#20107;&#20214;&#20043;&#21069;&#65289;</li>
	<li>&#25110;&#32773;&#20320;&#21487;&#20197;&#22312;&#27493;&#32467;&#26463;&#26102;&#27979;&#35797;&#26465;&#20214;&#65288;&#23601;&#22312;&#32467;&#26463;&#27493;&#20107;&#20214;&#21069;&#65289;</li>
</ul>
<p>&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#40664;&#35748;&#30340;&#20013;&#38388;&#20301;&#32622;&#26159;&#22909;&#30340;&#65292;&#20294;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#20320;&#38656;&#35201;&#30340;&#26102;&#21051;&#65292;&#29305;&#21035;&#26159;&#22914;&#26524;&#35302;&#21457;&#30340;&#32467;&#26524;&#23558;&#24433;&#21709;&#26410;&#26469;&#30340;&#19968;&#27493;&#65292;&#25110;&#20381;&#36182;&#20110;&#20197;&#21069;&#24050;&#32463;&#23436;&#25104;&#30340;&#19996;&#35199;&#12290;<br>
<br>

</p><h3>&#21629;&#21517;&#19968;&#20010;&#24120;&#25968;</h3>
<p>&#26368;&#21518;&#65292;&#20320;&#29978;&#33267;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;&#24120;&#25968;&#65292;&#20174;&#20195;&#30721;&#20013;&#35843;&#29992;&#25351;&#23450;&#30340;&#35302;&#21457;&#20107;&#20214;&#12290;&#35201;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#20320;&#24517;&#39035;&#32473;&#23427;&#19968;&#20010;&#21517;&#31216;&#19981;&#33021;&#21253;&#21547;&#31354;&#26684;&#65292;&#20063;&#19981;&#26159;&#26410;&#32463;&#25480;&#26435;&#30340;&#23383;&#31526;&#65292;&#32780;&#19988;&#24456;&#23481;&#26131;&#35760;
&#20303;&#12290;&#22914;&#26524;&#20320;&#30475;&#30475;&#19978;&#38754;&#30340;&#22270;&#29255;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#65292;&#25105;&#20204;&#24050;&#32463;&#20351;&#29992;&#20102;&#8220;tr_Near_Wall&#8221;&#65292;&#35302;&#21457;&#23450;&#20041;&#24120;&#37327;&#12290;&#22312;&#27492;&#20043;&#21069;&#30340;&#21629;&#21517;&#35268;&#21017;&#65292;&#26159;&#25551;&#36848;&#24615;&#30340;&#65292;&#26131;&#20110;&#29702;&#35299;&#65292;&#23558;&#20801;&#35768;
&#20174;&#20219;&#20309;&#20854;&#20182;&#20107;&#20214;&#20013;&#30340;&#20195;&#30721;&#34987;&#31216;&#20026;&#35302;&#21457;&#12290;&#24212;&#35813;&#25351;&#20986;&#30340;&#26159;&#65292;&#22312;&#20195;&#30721;&#20013;&#20351;&#29992;&#35302;&#21457;&#22120;&#19981;&#35745;&#31639;&#20026;true&#25110;false&#65292;&#20294;&#23427;&#20173;&#28982;&#21487;&#20197;&#34987;&#29992;&#26469;&#35774;&#32622;&#21464;&#37327;&#21644;&#20854;&#20182;&#30340;&#19996;&#35199;&#12290;&#20195;&#30721;&#20351;&#29992;
&#30340;&#26679;&#26412;&#23558;&#26159;&#65306;<br>
<br>

</p><p class="code">
event_perform(ev_trigger, tr_Near_Wall);<br>
</p>

<h3><br>&#20351;&#29992;&#35302;&#21457;&#22120;</h3>

<p>&#19968;&#26086;&#20320;&#23450;&#20041;&#20102;&#20320;&#30340;&#35302;&#21457;&#22120;&#23450;&#20041;&#23545;&#35937;&#26102;&#65292;&#21487;&#20197;&#20351;&#29992;&#23427;&#20204;&#12290;&#35201;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#20320;&#23601;&#28857;&#20987;&#8220;&#28155;&#21152;&#20107;&#20214;&#65292;&#28982;&#21518;&#36873;&#25321;&#8221;&#35302;&#21457;&#20107;&#20214;&#8220;&#12290;

</p><p>
<img class="center" src="../../images/form_event_selector.png">

</p><p>&#19968;&#20010;&#24377;&#20986;&#20250;&#32473;&#20320;&#19968;&#20010;&#20320;&#24050;&#32463;&#21019;&#24314;&#25110;&#21152;&#36733;&#65292;&#24182;&#20174;&#37027;&#37324;&#65292;&#20320;&#21487;&#20197;&#36873;&#25321;&#20320;&#24819;&#20351;&#29992;&#30340;&#35302;&#21457;&#22120;&#21015;&#34920;&#12290;&#28982;&#21518;&#65292;&#23427;&#23558;&#34987;&#28155;&#21152;&#21040;&#20107;&#20214;&#21015;&#34920;&#20026;&#27491;&#24120;&#12290;</p><p>
- &#30887;&#32511;&#30340;&#28246; -<br>
</p>
<p>

</p><div class="clear">
	<div style="float: left;">
		Back : <a href="index.html">Obsolete Functions</a>
	</div>
	<div style="float: right;">
		Next : <a href="Obsolete%20Registry%20Functions.html">Registry Functions</a>
	</div>
</div>


<!-- KEYWORDS
triggers (obsolete)
defining triggers
ev_trigger (obsolete)
-->  </div>   <!-- #BeginLibraryItem "/Library/mmenu_leftlist.lbi" -->
			<nav id="menu-left">
				<ul>
					<li ><a href="../../../index.html">GameMaker:Studio 手册首页</a>
						<ul>
							<li><a href="#intro">GMS文档简介</a></li>
							<li><a href="#first">GameMaker:Studio 使用</a></li>
							<li><a href="#second">Advanced Use高级使用</a></li>
							<li><a href="#third">Reference 参考</a></li>
							<li><a href="#fourth">贡献者 Versions by</a></li>						
						</ul>
					
					</li>					
					<li >
						<a href="../../000_Using GameMaker/index.html">GameMaker:Studio 使用</a>
						<ul>
							<li><a href="../../000_Using GameMaker/000_Introduction.html">Introduction 介绍</a></li>
							<li><a href="../../000_Using GameMaker/001_Installation.html">Installation 安装</a></li>
							<li><a href="../../000_Using GameMaker/002_Activation.html">Activation 激活</a></li>
							<li><a href="../../000_Using GameMaker/003_GameMaker Studio Overview.html">GameMaker:Studio Overview 概述</a></li>
							<li>
								<a href="../../000_Using GameMaker/004_The Graphical User Interface.html">The Graphical User Interface 绘制用户界面</a>
								<ul>
									<li><a href="#">The File Menu</a></li>
									<li><a href="#">The Edit Menu</a></li>
									<li><a href="#">The Resources Menu</a></li>
									<li><a href="#">The Scripts Menu</a></li>
									<li><a href="#">The Run Menu</a></li>
									<li><a href="#">The Window Menu</a></li>
									<li><a href="#">The Help Menu</a></li>									
								</ul>
							</li>
							<li><a href="../../000_Using GameMaker/005_Loading Sprites.html">Loading Sprites 载入精灵</a></li>
							<li><a href="../../000_Using GameMaker/006_Sounds and music.html">Sounds And Music 声音与音乐</a></li>
							<li><a href="../../000_Using GameMaker/007_Backgrounds.html">Backgrounds 背景</a></li>
							<li><a href="../../000_Using GameMaker/008_Defining objects.html">Defining Objects 定义对象</a></li>
							<li>
								<a href="../../000_Using GameMaker/Events/index.html">Events 事件</a>
								<ul>
									<li><a href="#">Create Event</a></li>
									<li><a href="#">Destroy Event</a></li>
									<li><a href="#">Alarm Events</a></li>
									<li><a href="#">Step Events</a></li>
									<li><a href="#">Collision Event</a></li>
									<li><a href="#">Keyboard Events</a></li>
									<li><a href="#">Other Events</a></li>
									<li><a href="#">Draw Event</a></li>
									<li><a href="#">Asynchronous Events</a></li>									
								</ul>
							</li>
							<li>
								<a href="../../000_Using GameMaker/Actions/index.html">Actions 动作</a>
								<ul>
									<li><a href="#">Move Actions</a></li>
									<li><a href="#">Main Actions, Set 1</a></li>
									<li><a href="#">Main Actions, Set 2</a></li>
									<li><a href="#">Control Actions</a></li>
									<li><a href="#">Score Actions</a></li>
									<li><a href="#">Extra Actions</a></li>
									<li><a href="#">Draw Actions</a></li>
									<li><a href="#">Using Variables and Expressions in Actions</a></li>																	
								</ul>
							</li>
							<li>
								<a href="../../000_Using GameMaker/Rooms/index.html">Creating Rooms 创造房间</a>
								<ul>
									<li><a href="#">Settings</a></li>
									<li><a href="#">Backgrounds</a></li>
									<li><a href="#">Objects</a></li>																
								</ul>								
							</li>
							<li><a href="../../000_Using GameMaker/Game Information.html">Game Information</a></li>							
							<li><a href="../../000_Using GameMaker/009_Distributing your game.html">Distributing Your Game 发布您的游戏</a></li>						

						</ul>
					</li>
					<li >
						<a href="../../001_Advanced Use/index.html">Advanced Use 高级使用</a>
						<ul>
							<li class="Label">Game Assets游戏资产</li>
							<li><a href="#">More About Sprites 更多关于精灵</a></li>
							<li><a href="#">More About Backgrounds 更多关于背景</a></li>
							<li><a href="#">More About Objects 更多关于对象</a></li>
							<li><a href="#">More About Rooms 更多关于房间</a></li>
							<li><a href="#">More About Async Events 更多关于异步事件</a></li>
							<li class="Label">Resource Editors资源编辑器</li>
							<li><a href="#">Fonts 字体</a></li>
							<li><a href="#">Paths 路径</a></li>
							<li><a href="#">Time Lines 时间线</a></li>
							<li><a href="#">Scripts 脚本</a></li>
							<li><a href="#">Constants 常量</a></li>
							<li><a href="#">Including Files 包含文件</a></li>
							<li><a href="#">Importing Resources 导入资源</a></li>
							<li class="Label">Game Settings游戏设置</li>
							<li><a href="#">Extension Packages 扩展包</a></li>
							<li><a href="#">Configurations 配置</a></li>
							<li><a href="#">Source Control 源代码控制</a></li>
							<li><a href="#">Global Game Settings 全局游戏设定</a></li>
							<li><a href="#">GameMaker:Studio Preferences 首选项</a></li>
							<li><a href="#">Debugging 调试</a></li>
							
							<li><a href="#content">Introduction</a></li>
							<li><a href="#first">First section</a></li>
							<li><a href="#second">Second section</a></li>
							<li><a href="#third">Third section</a></li>
							
							
							<li><a href="#">First sub-item</a></li>
							<li>
								<a href="#">Second sub-item</a>
								<ul>
									<li><a href="#">First sub-sub-item</a></li>
									<li><a href="#">Second sub-sub-item</a></li>
									<li><a href="#">Third sub-sub-item</a></li>
								</ul>
							</li>
							<li><a href="#">Third sub-item</a></li>
						</ul>


					</li>
					<li >
						<a href="../index.html">Reference GML参考手册</a>
						<ul>
							<li><a href="#">GML Overview 概述</a></li>
							<li class="Label">Real Numbers And Strings 实数与字符串</li>
							<li><a href="#">Maths 数学</a></li>
							<li><a href="#">Date and Time 日期与时间</a></li>
							<li><a href="#">Strings 字符串</a></li>
							<li class="Label">Game Play 游戏运行</li>							
							<li><a href="#">Game Assets 游戏资产</a></li>
							<li><a href="#">Objects and Instances 对象与实例</a></li>
							<li><a href="#">Movement and Collisions 移动与碰撞</a></li>
							<li><a href="#">Mouse, Keyboard and Other Controls 鼠标、键盘和其他控制设备</a></li>							
							<li class="Label">Drawing And Display 绘制与显示</li>
							<li><a href="#">Drawing 绘制</a></li>
							<li><a href="#">Surfaces 表面</a></li>
							<li><a href="#">Windows And Views 窗口与视野</a></li>
							<li class="Label">Advanced Functions 高级函数</li>
							<li><a href="#">Data Structures 数据结构</a></li>
							<li><a href="#">Particles 粒子</a></li>
							<li><a href="#">Physics 物理</a></li>
							<li><a href="#">File Handling 文件处理</a></li>
							<li><a href="#">Operating System 操作系统</a></li>
							<li><a href="#">Buffers 缓存区</a></li>
							<li><a href="#">Networking 联网</a></li>
							<li class="Label">Platform Specific 平台特性</li>
							<li><a href="#">HTML5</a></li>
							<li><a href="#">Advertising and Analytics 广告与分析</a></li>
							<li><a href="#">Social Gaming 社交游戏</a></li>
							<li><a href="#">In App Purchases 应用程序内购买</a></li>
							<li><a href="#">Asynchronous 异步</a></li>
							<li><a href="#">Cloud Services 云服务</a></li>
							<li><a href="#">Steam API 应用程序接口</a></li>
							<li class="Label">Extras 附加</li>
							<li><a href="#">Debugging 调试</a></li>
							<li><a href="#">Miscellaneous 杂项</a></li>
							<li><a href="#">Obsolete Functions 淘汰函数</a></li>

							
							<li><a href="#content">Introduction</a></li>
							<li><a href="#first">First section</a></li>
							<li><a href="#second">Second section</a></li>
							<li><a href="#third">Third section</a></li>
							
							
							<li><a href="#">First sub-item</a></li>
							<li>
								<a href="#">Second sub-item</a>
								<ul>
									<li><a href="#">First sub-sub-item</a></li>
									<li><a href="#">Second sub-sub-item</a></li>
									<li><a href="#">Third sub-sub-item</a></li>
								</ul>
							</li>
							<li><a href="#">Third sub-item</a></li>
						</ul>



					</li>
					<li ><a href="#">Examples and Experience 实例教程及心得</a></li>
					<li ><a href="#">Experimental project 实验项目</a></li>
					<li ><a href="#">Setting 应用设置</a></li>					
				</ul>
			</nav>

<!-- mmenu_leftlist for update files 3,4:5 --><!-- #EndLibraryItem --><!-- #BeginLibraryItem "/Library/mmenu_rightlist.lbi" -->			<nav id="menu-right">
				<ul>
					<li>
						<span>Friends</span>
						<ul>
							<li class="Label">A</li>
							<li class="img">
								<a href="#">
									<img src="#people/1/" />
									Alexa<br />
									<small>Johnson</small>
								</a>
							</li>
							<li class="img Collapsed">
								<a href="#">
									<img src="#people/2/" />
									Alexander<br />
									<small>Brown</small>
								</a>
							</li>

							<li class="Label">F</li>
							<li class="img Collapsed">
								<a href="#">
									<img src="#people/3/" />
									Fred<br />
									<small>Smith</small>
								</a>
							</li>

							<li class="Label">J</li>
							<li class="img Collapsed">
								<a href="#">
									<img src="#people/4/" />
									James<br />
									<small>Miller</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/5/" />
									Jefferson<br />
									<small>Jackson</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/6/" />
									Jordan<br />
									<small>Lee</small>
								</a>
							</li>

							<li class="Label">K</li>
							<li class="img">
								<a href="#">
									<img src="#people/7/" />
									Kim<br />
									<small>Adams</small>
								</a>
							</li>

							<li class="Label">M</li>
							<li class="img">
								<a href="#">
									<img src="#people/8/" />
									Meagan<br />
									<small>Miller</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/9/" />
									Melissa<br />
									<small>Johnson</small>
								</a>
							</li>
							
							<li class="Label">N</li>
							<li class="img">
								<a href="#">
									<img src="#people/10/" />
									Nicole<br />
									<small>Smith</small>
								</a>
							</li>

							<li class="Label">S</li>
							<li class="img">
								<a href="#">
									<img src="#people/1/" />
									Samantha<br />
									<small>Harris</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/2/" />
									Scott<br />
									<small>Thompson</small>
								</a>
							</li>
						</ul>
					</li>
					
					<li>
						<span>Family</span>
						<ul>
							<li class="Label">A</li>
							<li class="img">
								<a href="#">
									<img src="#people/3/" />
									Adam<br />
									<small>White</small>
								</a>
							</li>

							<li class="Label">B</li>
							<li class="img">
								<a href="#">
									<img src="#people/4/" />
									Ben<br />
									<small>Robinson</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/5/" />
									Bruce<br />
									<small>Lee</small>
								</a>
							</li>

							<li class="Label">E</li>
							<li class="img">
								<a href="#">
									<img src="#people/6/" />
									Eddie<br />
									<small>Williams</small>
								</a>
							</li>

							<li class="Label">J</li>
							<li class="img">
								<a href="#">
									<img src="#people/7/" />
									Jack<br />
									<small>Johnson</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/8/" />
									John<br />
									<small>Jackman</small>
								</a>
							</li>

							<li class="Label">M</li>
							<li class="img">
								<a href="#">
									<img src="#people/9/" />
									Martina<br />
									<small>Thompson</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/10/" />
									Matthew<br />
									<small>Watson</small>
								</a>
							</li>

							<li class="Label">O</li>
							<li class="img">
								<a href="#">
									<img src="#people/1/" />
									Olivia<br />
									<small>Taylor</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/2/" />
									Owen<br />
									<small>Wilson</small>
								</a>
							</li>
						</ul>
					</li>

					<li>
						<span>Work colleagues</span>
						<ul>
							<li class="Label">D</li>
							<li class="img">
								<a href="#">
									<img src="#people/3/" />
									David<br />
									<small>Harris</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/4/" />
									Dennis<br />
									<small>King</small>
								</a>
							</li>
							
							<li class="Label">E</li>
							<li class="img">
								<a href="#">
									<img src="#people/5/" />
									Eliza<br />
									<small>Walker</small>
								</a>
							</li>
							
							<li class="Label">L</li>
							<li class="img">
								<a href="#">
									<img src="#people/6/" />
									Larry<br />
									<small>Turner</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/7/" />
									Lisa<br />
									<small>Wilson</small>
								</a>
							</li>
							
							<li class="Label">M</li>
							<li class="img">
								<a href="#">
									<img src="#people/8/" />
									Michael<br />
									<small>Jordan</small>
								</a>
							</li>
							
							<li class="Label">R</li>
							<li class="img">
								<a href="#">
									<img src="#people/9/" />
									Rachelle<br />
									<small>Cooper</small>
								</a>
							</li>
							<li class="img">
								<a href="#">
									<img src="#people/10/" />
									Rick<br />
									<small>James</small>
								</a>
							</li>
						</ul>
					</li>
				</ul>
			</nav>

<!-- mmenu_right update 5,6:6 -->

<!-- #EndLibraryItem --></div></body></html>